wosayttn/sdk-bsp-numaker-m55m1/Debug/svd/M55M1.svd
<?xml version="1.0" encoding="utf-8"?>
<device schemaVersion="1.1" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="CMSIS-SVD_Schema_1_1.xsd" >
  <name>M55M1</name>
  <version>1.0</version>
  <description>M55M1 SVD file</description>
  <!-- Bus Interface Properties -->
  <!-- Cortex-M0 is byte addressable -->
  <addressUnitBits>8</addressUnitBits>
  <!-- the maximum data bit width accessible within a single transfer is 32bits -->
  <width>32</width>

  <!-- Register Default Properties -->
  <!-- the size of the registers is set to a bit width of 32. This can be overruled for individual peripherals and/or registers -->
  <size>32</size>
  <!-- the access to all registers is set to be readable and writeable. This can be overruled for individual peripherals and/or registers -->
  <access>read-write</access>
  <!-- for demonstration purposes the resetValue for all registers of the device is set to be 0. This can be overruled within the description -->
  <resetValue>0</resetValue>
  <!-- the resetMask = 0 specifies that by default no register of this device has a defined reset value -->
  <resetMask>0</resetMask>

  <peripherals>
    <peripheral>
      <name>SCS</name>
      <description>SCR Register Map</description>
      <groupName>SCR</groupName>
      <baseAddress>0xE000E000</baseAddress>
      <!-- d -> no access permission -->
      <addressBlock>
        <offset>0xDD0</offset>
        <size>0x14</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
       <register>
          <name>SAU_CTRL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SAU_CTRL</displayName>
          <description>SAU Control Register</description>
          <addressOffset>0xDD0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>SAU Enable Bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>SAU Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>SAU Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>ALLNS</name>
              <description>All Non-secure</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>All Memory region is marked as Secure and is not Non-secure callable</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>All Memory region is marked as Non-secure by SAU, indicating the security attribute of all memory is defined by IDAU</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>SAU_TYPE</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SAU_TYPE</displayName>
          <description>SAU Type Register</description>
          <addressOffset>0xDD4</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000008</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SREGION</name>
              <description>SAU Regions\nIndicates the number of regions implemented by the Security Attribution Unit.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>SAU_RNR</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SAU_RNR</displayName>
          <description>SAU Region Number Register</description>
          <addressOffset>0xDD8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFF00</resetMask>
          <fields>
            <field>
              <name>REGION</name>
              <description>Current Region of SAU\nIndicates the SAU region accessed by SAU_RBAR and SAU_RLAR.\nSet a value to select the region to be configure through SAU_RBAR and SAU_RLAR.\nIt can be set to 0 ~ the value of SAU_TYPE -1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>SAU_RBAR</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SAU_RBAR</displayName>
          <description>SAU Region Base Address Register</description>
          <addressOffset>0xDDC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000F</resetMask>
          <fields>
            <field>
              <name>BADDR</name>
              <description>Base Address of Currently Selected Region\nThe base address of the region selected by SAU_RNR.\nSAU region is 32-byte-aligned.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>27</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>SAU_RLAR</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SAU_RLAR</displayName>
          <description>SAU Region Limit Address Register</description>
          <addressOffset>0xDE0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RENABLE</name>
              <description>Region Enable Bit\nEnable or disable the currently selected region set by SAU_RNR.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Disabled selected region set by SAU_RNR</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Enabled selected region set by SAU_RNR</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>NSC</name>
              <description>Non-secure Callable Setting Bit\nControls whether Non-secure state is permitted to execute an SG instruction\nfrom this region.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Region is not Non-secure callable. If RENABLE =1, the current region is Non-secure</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Region is Non-secure callable. If RENABLE=1, the current region is Secure and Non-secure callable</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>LADDR</name>
              <description>Limit Address of Currently Selected Region\nThe limited address of the region selected by SAU_RNR.\nThe region of the selected SAU region is [SAU_RBAR.BADDR,5'b00000] ~ [LADDR,5'b11111]</description>
              <bitOffset>5</bitOffset>
              <bitWidth>27</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
