wosayttn/sdk-bsp-numaker-m55m1/Debug/svd/M55M1.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PMC</name>
      <description>PMC Register Map</description>
      <groupName>PMC</groupName>
      <baseAddress>0x40002000</baseAddress>
      <!-- d -> no access permission -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0xC</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x10</offset>
        <size>0x8</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x20</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x28</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x30</offset>
        <size>0x14</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x50</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x60</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x100</offset>
        <size>0x14</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x124</offset>
        <size>0x8</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x140</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
       <register>
          <name>PMC_PWRCTL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PMC_PWRCTL</displayName>
          <description>System Power-down Control Register</description>
          <addressOffset>0x0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00001100</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>D0PGEN</name>
              <description>Power Domain 0 Power Gating Enable Bit (Write Protect)\nThis bit control power domain 0 (Performance Domain) power gating function when system enter Power-down mode(CPU execute WFI/WFE instruction and SLEEPDEEP(SCR[2]) is 1).\nNote 1: This bit is write protected. Refer to the SYS_REGLCTL register.\nNote 2: Write operation is ignored when WRBUSY is high.\nNote 3: This bit is not retained when D4 power is turned off.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Power domain 0 keep supply</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Power domain 0 stop supply</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>D1PGEN</name>
              <description>Power Domain 1 Power Gating Enable Bit (Write Protect)\nThis bit control power domain 1 (Base Domain) power gating function when system enter Power-down mode(CPU execute WFI/WFE instruction and SLEEPDEEP(SCR[2]) is 1).\nNote 1: This bit is write protected. Refer to the SYS_REGLCTL register.\nNote 2: Write operation is ignored when WRBUSY is high.\nNote 3: If D0PGEN(PMC_PWRCTL[0]) is 0, The power domain 1 always keep supply, even if D1PGEN is 1.\nNote 4: This bit is not retained when D4 power is turned off.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Power domain 1 keep supply</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Power domain 1 stop supply</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>D2PGEN</name>
              <description>Power Domain 2 Power Gating Enable Bit (Write Protect)\nThis bit control power domain 2 (Low Power Domain) power gating function when system enter Power-down mode(CPU execute WFI/WFE instruction and SLEEPDEEP(SCR[2]) is 1).\nNote 1: This bit is write protected. Refer to the SYS_REGLCTL register.\nNote 2: Write operation is ignored when WRBUSY is high.\nNote 3: If D1PGEN(PMC_PWRCTL[1]) is 0, The power domain 2 always keep supply, even if D2PGEN is 1.\nNote 4: This bit is not retained when D4 power is turned off.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Power domain 2 keep supply</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Power domain 2 stop supply</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>D3PGEN</name>
              <description>Power Domain 3 Power Gating Enable Bit (Write Protect)\nThis bit control power domain 3 (Standby Power Domain) power gating function when system enter Power-down mode(CPU execute WFI/WFE instruction and SLEEPDEEP(SCR[2]) is 1).\nNote 1: This bit is write protected. Refer to the SYS_REGLCTL register.\nNote 2: Write operation is ignored when WRBUSY is high.\nNote 3: If D2PGEN(PMC_PWRCTL[2]) is 0, The power domain 3 always keep supply, even if D3PGEN is 1.\nNote 4: This bit is not retained when D4 power is turned off.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Power domain 3 keep supply</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Power domain 3 stop supply</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>AOCKPDEN</name>
              <description>Auto Operation Mode Clock Power-down Enable (Write Protect)\nWhen this bit is set to 1, Auto Operation Mode clock Power-down mode is enabled and MIRC and HIRC keeps active till the chip enter Power-down mode.\nIf chip in Power-down mode, HXT, HIRC48M, APLL0, APLL1 and system clock will be disabled and ignored the clock source selection. The clocks of peripheral are not controlled by Power-down mode, if the peripheral clock source is from LXT, LIRC, MIRC or HIRC.\nNote 1: This bit is write protected. Refer to the SYS_REGLCTL register.\nNote 2: This bit is not retained when D2 power is turned off.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>MIRC and HIRC enable in Power-down mode</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>MIRC and HIRC disable in Power-down mode under normal circumstances, but MIRC and HIRC will be enable via a trigger from auto operation mode</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>VDROPEN</name>
              <description>Voltage Regulator Output Drop Enable Bit (Write Protect)\nWhen this bit is set to 1, voltage regulator output drop to 0.7v in Power-down mode. \nNote 1: This bit is write protected. Refer to the SYS_REGLCTL register.\nNote 2: Write operation is ignored when WRBUSY is high.\nNote 3: This bit is not retained when D3 power is turned off.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Regulator voltage auto drop function Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Regulator voltage auto drop function Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>FWEN</name>
              <description>Fast Wake-up Enable Bit (Write Protect)\nWhen this bit is set to 1, wake-up will be speed up, but power consumption is increase about 30uA in Power-down mode. \nNote 1: This bit is write protected. Refer to the SYS_REGLCTL register.\nNote 2: Write operation is ignored when WRBUSY is high.\nNote 3: This bit is not retained when D4 power is turned off.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Regulator voltage auto drop function Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Regulator voltage auto drop function Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>PRSTDBEN</name>
              <description>Pin Reset De-Bounce Enable Bit (Write Protect)\nWhen this bit is set to 1, pin reset clock base de-bounce circuit is enable in Power-down mode. \nNote 1: This bit is write protected. Refer to the SYS_REGLCTL register.\nNote 2: This bit is not retained when D2 power is turned off.\nNote 3: If D2PGEN(PMC_PWRCTL[2]) is 1, The pin reset de-bounce circuit always keep disable, even if PRSTDBEN is 1.\nNote 4: If VDROPEN(PMC_PWRCTL[10]) is 1, The pin reset de-bounce circuit always keep disable, even if PRSTDBEN is 1.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Pin reset de-bounce circuit Disable, and de-bounce time about 300ns</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Pin reset de-bounce circuit Enable, and de-bounce time about 32us</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>WRBUSY</name>
              <description>Write Busy Flag (Read Only)\nIf PMC_PWRCTL is written, this bit is asserted automatically by hardware, and is de-asserted when write procedure is finished.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>PMC_PWRCTL register is ready for write operation</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>PMC_PWRCTL register is busy on the last write operation. Other write operations are  ignored</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
          </fields>
       </register>
