wosayttn/sdk-bsp-numaker-m55m1/Debug/svd/M55M1.svd
       <register>
          <name>PMC_INTEN</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PMC_INTEN</displayName>
          <description>PMC Interrupt Enable Register</description>
          <addressOffset>0x4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PDWKIEN</name>
              <description>Power-down Mode Wake-up Interrupt Enable Bit (Write Protect)\nNote 1: The PMC interrupt will occur when both PDWKIF(PMC_INTSTS[0] and PDWKIEN(PMC_INTEN[0]) are 1.\nNote 2: This bit is write protected. Refer to the SYS_REGLCTL register.\nNote 3: This bit is not retained when D4 power is turned off.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Power-down mode wake-up interrupt Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Power-down mode wake-up interrupt Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>STMRWKIEN</name>
              <description>Standby Timer Wake-up Interrupt Enable Bit (Write Protect)\nNote 1: The PMC interrupt will occur when both STMRWKIF(PMC_INTSTS[1] and STMRWKIEN(PMC_INTEN[1]) are 1.\nNote 2: This bit is write protected. Refer to the SYS_REGLCTL register.\nNote 3: This bit is not retained when D4 power is turned off.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>High Voltage Timer wake-up interrupt disable</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>High Voltage Timer wake-up interrupt enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN0WKIEN</name>
              <description>Pin 0 Wake-up Interrupt Enable Bit (Write Protect)\nNote 1: The PMC interrupt will occur when both PIN0WKIF(PMC_INTSTS[8] and PIN0WKIEN(PMC_INTEN[8]) are 1.\nNote 2: This bit is write protected. Refer to the SYS_REGLCTL register.\nNote 3: This bit is not retained when D4 power is turned off.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Pin 0 wake-up interrupt disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Pin 0 wake-up interrupt enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN1WKIEN</name>
              <description>Pin 1 Wake-up Interrupt Enable Bit (Write Protect)\nNote 1: The PMC interrupt will occur when both PIN1WKIF(PMC_INTSTS[9] and PIN1WKIEN(PMC_INTEN[9]) are 1.\nNote 2: This bit is write protected. Refer to the SYS_REGLCTL register.\nNote 3: This bit is not retained when D4 power is turned off.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Pin 1 wake-up interrupt disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Pin 1 wake-up interrupt enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN2WKIEN</name>
              <description>Pin 2 Wake-up Interrupt Enable Bit (Write Protect)\nNote 1: The PMC interrupt will occur when both PIN2WKIF(PMC_INTSTS[10] and PIN2WKIEN(PMC_INTEN[10]) are 1.\nNote 2: This bit is write protected. Refer to the SYS_REGLCTL register.\nNote 3: This bit is not retained when D4 power is turned off.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Pin 2 wake-up interrupt disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Pin 2 wake-up interrupt enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN3WKIEN</name>
              <description>Pin 3 Wake-up Interrupt Enable Bit (Write Protect)\nNote 1: The PMC interrupt will occur when both PIN3WKIF(PMC_INTSTS[11] and PIN3WKIEN(PMC_INTEN[11]) are 1.\nNote 2: This bit is write protected. Refer to the SYS_REGLCTL register.\nNote 3: This bit is not retained when D4 power is turned off.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Pin 3 wake-up interrupt disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Pin 3 wake-up interrupt enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN4WKIEN</name>
              <description>Pin 4 Wake-up Interrupt Enable Bit (Write Protect)\nNote 1: The PMC interrupt will occur when both PIN4WKIF(PMC_INTSTS[12] and PIN4WKIEN(PMC_INTEN[12]) are 1.\nNote 2: This bit is write protected. Refer to the SYS_REGLCTL register.\nNote 3: This bit is not retained when D4 power is turned off.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Pin 4 wake-up interrupt disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Pin 4 wake-up interrupt enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN5WKIEN</name>
              <description>Pin 5 Wake-up Interrupt Enable Bit (Write Protect)\nNote 1: The PMC interrupt will occur when both PIN4WKIF(PMC_INTSTS[13] and PIN4WKIEN(PMC_INTEN[13]) are 1.\nNote 2: This bit is write protected. Refer to the SYS_REGLCTL register.\nNote 3: This bit is not retained when D4 power is turned off.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Pin 5 wake-up interrupt disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Pin 5 wake-up interrupt enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>GPATGWKIEN</name>
              <description>GPA Trigger Wake-up Interrupt Enable Bit (Write Protect)\nNote 1: The PMC interrupt will occur when both GPATGWKIF(PMC_INTSTS[16] and GPATGWKIEN(PMC_INTEN[16]) are 1.\nNote 2: This bit is write protected. Refer to the SYS_REGLCTL register.\nNote 3: This bit is not retained when D3 power is turned off.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>GPA triggrer wake-up interrupt disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>GPA triggrer wake-up interrupt enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>GPBTGWKIEN</name>
              <description>GPB Trigger Wake-up Interrupt Enable Bit (Write Protect)\nNote 1: The PMC interrupt will occur when both GPBTGWKIF(PMC_INTSTS[17] and GPBTGWKIEN(PMC_INTEN[17]) are 1.\nNote 2: This bit is write protected. Refer to the SYS_REGLCTL register.\nNote 3: This bit is not retained when D3 power is turned off.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>GPB triggrer wake-up interrupt disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>GPB triggrer wake-up interrupt enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>GPCTGWKIEN</name>
              <description>GPC Trigger Wake-up Interrupt Enable Bit (Write Protect)\nNote 1: The PMC interrupt will occur when both GPCTGWKIF(PMC_INTSTS[18] and GPCTGWKIEN(PMC_INTEN[18]) are 1.\nNote 2: This bit is write protected. Refer to the SYS_REGLCTL register.\nNote 3: This bit is not retained when D3 power is turned off.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>GPC triggrer wake-up interrupt disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>GPC triggrer wake-up interrupt enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>GPDTGWKIEN</name>
              <description>GPD Trigger Wake-up Interrupt Enable Bit (Write Protect)\nNote 1: The PMC interrupt will occur when both GPDTGWKIF(PMC_INTSTS[19] and GPDTGWKIEN(PMC_INTEN[19]) are 1.\nNote 2: This bit is write protected. Refer to the SYS_REGLCTL register.\nNote 3: This bit is not retained when D3 power is turned off.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>GPD triggrer wake-up interrupt disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>GPD triggrer wake-up interrupt enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>PMC_INTSTS</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PMC_INTSTS</displayName>
          <description>PMC Interrupt Status Register</description>
          <addressOffset>0x8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PDWKIF</name>
              <description>Power-down Mode Wake-up Interrupt Status\nSet by 'Power-down wake-up event', it indicates that resume from Power-down mode. \nThe flag is set if any wake-up source occurred. Refer Power Modes and Wake-up Sources chapter.\nNote 1: The PMC interrupt will occur when both PDWKIF(PMC_INTSTS[0] and PDWKIEN(PMC_INTEN[0]) are 1.\nNote 2: This bit is not retained when D0 power is turned off.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STMRWKIF</name>
              <description>Standby Timer Wake-up Interrupt Status\nThe flag is set if stadnby timer wake-up event occurred in Power-down mode.\nNote 1: The PMC interrupt will occur when both STMRWKIF(PMC_INTSTS[1] and STMRWKIEN(PMC_INTEN[1]) are 1.\nNote 2: This bit is not retained when D0 power is turned off.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN0WKIF</name>
              <description>Pin 0 Wake-up Interrupt Status\nThe flag is set if Pin 0 wake-up event occurred in Power-down mode.\nNote 1: The PMC interrupt will occur when both PIN0WKIF(PMC_INTSTS[8] and PIN0WKIEN(PMC_INTEN[8]) are 1.\nNote 2: This bit is not retained when D0 power is turned off.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN1WKIF</name>
              <description>Pin 1 Wake-up Interrupt Status\nThe flag is set if Pin 1 wake-up event occurred in Power-down mode.\nNote 1: The PMC interrupt will occur when both PIN1WKIF(PMC_INTSTS[9] and PIN1WKIEN(PMC_INTEN[9]) are 1.\nNote 2: This bit is not retained when D0 power is turned off.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN2WKIF</name>
              <description>Pin 2 Wake-up Interrupt Status\nThe flag is set if Pin 2 wake-up event occurred in Power-down mode.\nNote 1: The PMC interrupt will occur when both PIN2WKIF(PMC_INTSTS[10] and PIN2WKIEN(PMC_INTEN[10]) are 1.\nNote 2: This bit is not retained when D0 power is turned off.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN3WKIF</name>
              <description>Pin 3 Wake-up Interrupt Status\nThe flag is set if Pin 3 wake-up event occurred in Power-down mode.\nNote 1: The PMC interrupt will occur when both PIN3WKIF(PMC_INTSTS[11] and PIN3WKIEN(PMC_INTEN[11]) are 1.\nNote 2: This bit is not retained when D0 power is turned off.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN4WKIF</name>
              <description>Pin 4 Wake-up Interrupt Status\nThe flag is set if Pin 4 wake-up event occurred in Power-down mode.\nNote 1: The PMC interrupt will occur when both PIN4WKIF(PMC_INTSTS[12] and PIN4WKIEN(PMC_INTEN[12]) are 1.\nNote 2: This bit is not retained when D0 power is turned off.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN5WKIF</name>
              <description>Pin 5 Wake-up Interrupt Status\nThe flag is set if Pin 5 wake-up event occurred in Power-down mode.\nNote 1: The PMC interrupt will occur when both PIN4WKIF(PMC_INTSTS[13] and PIN4WKIEN(PMC_INTEN[13]) are 1.\nNote 2: This bit is not retained when D0 power is turned off.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPATGWKIF</name>
              <description>GPA Trigger Wake-up Interrupt Status\nThe flag is set if GPA trigger wake-up event occurred in Power-down mode.\nNote 1: The PMC interrupt will occur when both GPATGWKIF(PMC_INTSTS[16] and GPATGWKIEN(PMC_INTEN[16]) are 1.\nNote 2: This bit is not retained when D0 power is turned off.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPBTGWKIF</name>
              <description>GPB Trigger Wake-up Interrupt Status\nThe flag is set if GPB trigger wake-up event occurred in Power-down mode.\nNote 1: The PMC interrupt will occur when both GPBTGWKIF(PMC_INTSTS[17] and GPBTGWKIEN(PMC_INTEN[17]) are 1.\nNote 2: This bit is not retained when D0 power is turned off.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPCTGWKIF</name>
              <description>GPC Trigger Wake-up Interrupt Status\nThe flag is set if GPC trigger wake-up event occurred in Power-down mode.\nNote 1: The PMC interrupt will occur when both GPCTGWKIF(PMC_INTSTS[18] and GPCTGWKIEN(PMC_INTEN[18]) are 1.\nNote 2: This bit is not retained when D0 power is turned off.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPDTGWKIF</name>
              <description>GPC Trigger Wake-up Interrupt Status\nThe flag is set if GPD trigger wake-up event occurred in Power-down mode.\nNote 1: The PMC interrupt will occur when both GPDTGWKIF(PMC_INTSTS[19] and GPDTGWKIEN(PMC_INTEN[19]) are 1.\nNote 2: This bit is not retained when D0 power is turned off.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLRWK</name>
              <description>Clear Wake-up Flag\nClearing the Wake-up flag is not timely. Flags in PMC_INTSTS will not be immediately  cleared in the next cycle when CLRWK written to 1.\nNote 1: This bit is auto cleared by hardware.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No clear</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Clear all wake-up flags</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>PMC_PLCTL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PMC_PLCTL</displayName>
          <description>Power Level Control Register</description>
          <addressOffset>0x10</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PLSEL</name>
              <description>Power Level Select (Write Protect)\nNote 1: These bits are write protected. Refer to the SYS_REGLCTL register.\nNote 2: Write operation is ignored when WRBUSY is high.\nNote 3: These bits are not retained when D3 power is turned off.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Set to Power level 0 (PL0)</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Set to Power level 1 (PL1). (default)</description>
                    <value>#01</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>WRBUSY</name>
              <description>Write Busy Flag (Read Only)\nIf PMC_PLCTL is written, this bit is asserted automatically by hardware, and is de-asserted when write procedure is finished.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>PMC_PLCTL register is ready for write operation</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>PMC_PLCTL register is busy on the last write operation. Other write operations are ignored</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
          </fields>
       </register>
