wosayttn/sdk-bsp-numaker-m55m1/Debug/svd/M55M1.svd
       <register>
          <name>PMC_PINWKCTL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PMC_PINWKCTL</displayName>
          <description>Pin Wake-up Control Register</description>
          <addressOffset>0x60</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WKPINEN0</name>
              <description>Wake-up Pin0 Enable Bit (Write Protect)\nThis is control register for GPC.0 to wake-up pin.\nNote 1: These bits are write protected. Refer to the SYS_REGLCTL register.\nNote 2: These bits are not retained when D4 power is turned off.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Wake-up pin disable</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Wake-up pin rising edge enabled</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>Wake-up pin falling edge enabled</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Wake-up pin both edge enabled</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>WKPINEN1</name>
              <description>Wake-up Pin1 Enable Bit (Write Protect)\nThis is control register for GPB.0 to wake-up pin.\nNote 1: These bits are write protected. Refer to the SYS_REGLCTL register.\nNote 2: These bits are not retained when D4 power is turned off.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Wake-up pin disable</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Wake-up pin rising edge enabled</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>Wake-up pin falling edge enabled</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Wake-up pin both edge enabled</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>WKPINEN2</name>
              <description>Wake-up Pin2 Enable Bit (Write Protect)\nThis is control register for GPB.2 to wake-up pin.\nNote 1: These bits are write protected. Refer to the SYS_REGLCTL register.\nNote 2: These bits are not retained when D4 power is turned off.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Wake-up pin disable</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Wake-up pin rising edge enabled</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>Wake-up pin falling edge enabled</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Wake-up pin both edge enabled</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>WKPINEN3</name>
              <description>Wake-up Pin3 Enable Bit (Write Protect)\nThis is control register for GPB.12 to wake-up pin.\nNote 1: These bits are write protected. Refer to the SYS_REGLCTL register.\nNote 2: These bits are not retained when D4 power is turned off.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Wake-up pin disable</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Wake-up pin rising edge enabled</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>Wake-up pin falling edge enabled</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Wake-up pin both edge enabled</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>WKPINEN4</name>
              <description>Wake-up Pin4 Enable Bit (Write Protect)\nThis is control register for GPF.6 to wake-up pin.\nNote 1: These bits are write protected. Refer to the SYS_REGLCTL register.\nNote 2: These bits are not retained when D4 power is turned off.\nNote 3: Setting IOCTLSEL(RTC_LXTCTL[8]) to avoid GPF6 unexpected falling edge.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Wake-up pin disable</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Wake-up pin rising edge enabled</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>Wake-up pin falling edge enabled</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Wake-up pin both edge enabled</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>WKPINEN5</name>
              <description>Wake-up Pin5 Enable Bit (Write Protect)\nThis is control register for GPA.12 to wake-up pin.\nNote 1: These bits are write protected. Refer to the SYS_REGLCTL register.\nNote 2: These bits are not retained when D4 power is turned off.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Wake-up pin disable</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Wake-up pin rising edge enabled</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>Wake-up pin falling edge enabled</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Wake-up pin both edge enabled</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>PMC_SYSRB0PC</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PMC_SYSRB0PC</displayName>
          <description>System SRAM Bank 0 Power Mode Control Register</description>
          <addressOffset>0x100</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SRAM0PMS</name>
              <description>System SRAM0 In Bank0 Power Mode Select (Write Protect)\nThis field can control SRAM0 in bank0 (64k) power mode for range 0x2010_0000 - 0x2010_FFFF.\nNote 1: Power shut down mode can get least leakage, but don't guarantee the retention of SRAM data.\nNote 2: This bit is write protected. Refer to the SYS_REGLCTL register.\nNote 3: Write operation is ignored when PCBUSY is 1.\nNote 4: These bits are not retained when D3 power is turned off.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>System SRAM0 in bank0 is normal mode</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>System SRAM0 in bank0 is retention mode</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>System SRAM0 in bank0 is power shut down mode</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Reserved (Write Ignore)</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SRAM1PMS</name>
              <description>System SRAM1 In Bank0 Power Mode Select (Write Protect)\nThis field can control SRAM1 in bank0 (64k) power mode for range 0x2011_0000 - 0x2011_FFFF.\nNote 1: Power shut down mode can get least leakage, but don't guarantee the retention of SRAM data.\nNote 2: This bit is write protected. Refer to the SYS_REGLCTL register.\nNote 3: Write operation is ignored when PCBUSY is 1.\nNote 4: These bits are not retained when D3 power is turned off.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>System SRAM1 in bank0 is normal mode</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>System SRAM1 in bank0 is retention mode</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>System SRAM1 in bank0 is power shut down mode</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Reserved (Write Ignore)</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SRAM2PMS</name>
              <description>System SRAM2 In Bank0 Power Mode Select (Write Protect)\nThis field can control SRAM2 in bank0 (64k) power mode for range 0x2012_0000 - 0x2012_FFFF.\nNote 1: Power shut down mode can get least leakage, but don't guarantee the retention of SRAM data.\nNote 2: This bit is write protected. Refer to the SYS_REGLCTL register.\nNote 3: Write operation is ignored when PCBUSY is 1.\nNote 4: These bits are not retained when D3 power is turned off.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>System SRAM2 in bank0 is normal mode</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>System SRAM2 in bank0 is retention mode</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>System SRAM2 in bank0 is power shut down mode</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Reserved (Write Ignore)</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SRAM3PMS</name>
              <description>System SRAM3 In Bank0 Power Mode Select (Write Protect)\nThis field can control SRAM3 in bank0 (64k) power mode for range 0x2013_0000 - 0x2013_FFFF.\nNote 1: Power shut down mode can get least leakage, but don't guarantee the retention of SRAM data.\nNote 2: This bit is write protected. Refer to the SYS_REGLCTL register.\nNote 3: Write operation is ignored when PCBUSY is 1.\nNote 4: These bits are not retained when D3 power is turned off.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>System SRAM3 in bank0 is normal mode</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>System SRAM3 in bank0 is retention mode</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>System SRAM3 in bank0 is power shut down mode</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Reserved (Write Ignore)</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SRAM4PMS</name>
              <description>System SRAM4 In Bank0 Power Mode Select (Write Protect)\nThis field can control SRAM4 in bank0 (64k) power mode for range 0x2014_0000 - 0x2014_FFFF.\nNote 1: Power shut down mode can get least leakage, but don't guarantee the retention of SRAM data.\nNote 2: This bit is write protected. Refer to the SYS_REGLCTL register.\nNote 3: Write operation is ignored when PCBUSY is 1.\nNote 4: These bits are not retained when D3 power is turned off.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>System SRAM4 in bank0 is normal mode</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>System SRAM4 in bank0 is retention mode</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>System SRAM4 in bank0 is power shut down mode</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Reserved (Write Ignore)</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SRAM5PMS</name>
              <description>System SRAM5 In Bank0 Power Mode Select (Write Protect)\nThis field can control SRAM5 in bank0 (64k) power mode for range 0x2015_0000 - 0x2015_FFFF.\nNote 1: Power shut down mode can get least leakage, but don't guarantee the retention of SRAM data.\nNote 2: This bit is write protected. Refer to the SYS_REGLCTL register.\nNote 3: Write operation is ignored when PCBUSY is 1.\nNote 4: These bits are not retained when D3 power is turned off.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>System SRAM5 in bank0 is normal mode</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>System SRAM5 in bank0 is retention mode</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>System SRAM5 in bank0 is power shut down mode</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Reserved (Write Ignore)</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SRAM6PMS</name>
              <description>System SRAM6 In Bank0 Power Mode Select (Write Protect)\nThis field can control SRAM6 in bank0 (64k) power mode for range 0x2016_0000 - 0x2016_FFFF.\nNote 1: Power shut down mode can get least leakage, but don't guarantee the retention of SRAM data.\nNote 2: This bit is write protected. Refer to the SYS_REGLCTL register.\nNote 3: Write operation is ignored when PCBUSY is 1.\nNote 4: These bits are not retained when D3 power is turned off.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>System SRAM6 in bank0 is normal mode</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>System SRAM6 in bank0 is retention mode</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>System SRAM6 in bank0 is power shut down mode</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Reserved (Write Ignore)</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SRAM7PMS</name>
              <description>System SRAM7 In Bank0 Power Mode Select (Write Protect)\nThis field can control SRAM7 in bank0 (64k) power mode for range 0x2017_0000 - 0x2017_FFFF.\nNote 1: Power shut down mode can get least leakage, but don't guarantee the retention of SRAM data.\nNote 2: This bit is write protected. Refer to the SYS_REGLCTL register.\nNote 3: Write operation is ignored when PCBUSY is 1.\nNote 4: These bits are not retained when D3 power is turned off.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>System SRAM7 in bank0 is normal mode</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>System SRAM7 in bank0 is retention mode</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>System SRAM7 in bank0 is power shut down mode</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Reserved (Write Ignore)</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>PCBUSY</name>
              <description>Power Changing Busy Flag (Read Only)\nIf PMC_SYSRB0PC is written, this bit is asserted automatically by hardware, and is de-asserted when SRAM power change procedure is finished.\nset to power shut down mode by hardware.\nNote 1: This bit is not retained when D3 power is turned off.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>System SRAM bank 0 power change finished</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>System SRAM bank 0 power changing. The PMC_SYSRB0PC write operations are ignored</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
          </fields>
       </register>
