wosayttn/sdk-bsp-numaker-m55m1/Debug/svd/M55M1.svd
       <register>
          <name>PMC_SYSRB1PC</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PMC_SYSRB1PC</displayName>
          <description>System SRAM Bank 1 Power Mode Control Register</description>
          <addressOffset>0x104</addressOffset>
          <access>read-write</access>
          <resetValue>0x0000AAAA</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SRAM0PMS</name>
              <description>System SRAM0 In Bank1 Power Mode Select (Write Protect)\nThis field can control SRAM0 in bank1 (64k) power mode for range 0x2018_0000 - 0x2018_FFFF.\nNote 1: Power shut down mode can get least leakage, but don't guarantee the retention of SRAM data.\nNote 2: This bit is write protected. Refer to the SYS_REGLCTL register.\nNote 3: Write operation is ignored when PCBUSY is 1.\nNote 4: If system enter Power-down mode and D0PGEN(PMC_PWRCTL[0]) is set to 1, This SRAM is auto set to power shut down mode by hardware.\nNote 5: These bits are not retained when D0 power is turned off.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>System SRAM0 in bank1 is normal mode</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>System SRAM0 in bank1 is retention mode</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>System SRAM0 in bank1 is power shut down mode</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Reserved (Write Ignore)</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SRAM1PMS</name>
              <description>System SRAM1 In Bank1 Power Mode Select (Write Protect)\nThis field can control SRAM1 in bank1 (64k) power mode for range 0x2019_0000 - 0x2019_FFFF.\nNote 1: Power shut down mode can get least leakage, but don't guarantee the retention of SRAM data.\nNote 2: This bit is write protected. Refer to the SYS_REGLCTL register.\nNote 3: Write operation is ignored when PCBUSY is 1.\nNote 4: If system enter Power-down mode and D0PGEN(PMC_PWRCTL[0]) is set to 1, This SRAM is auto set to power shut down mode by hardware.\nNote 5: These bits are not retained when D0 power is turned off.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>System SRAM1 in bank1 is normal mode</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>System SRAM1 in bank1 is retention mode</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>System SRAM1 in bank1 is power shut down mode</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Reserved (Write Ignore)</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SRAM2PMS</name>
              <description>System SRAM2 In Bank1 Power Mode Select (Write Protect)\nThis field can control SRAM2 in bank1 (64k) power mode for range 0x201A_0000 - 0x201A_FFFF.\nNote 1: Power shut down mode can get least leakage, but don't guarantee the retention of SRAM data.\nNote 2: This bit is write protected. Refer to the SYS_REGLCTL register.\nNote 3: Write operation is ignored when PCBUSY is 1.\nNote 4: If system enter Power-down mode and D0PGEN(PMC_PWRCTL[0]) is set to 1, This SRAM is auto set to power shut down mode by hardware.\nNote 5: These bits are not retained when D0 power is turned off.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>System SRAM2 in bank1 is normal mode</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>System SRAM2 in bank1 is retention mode</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>System SRAM2 in bank1 is power shut down mode</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Reserved (Write Ignore)</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SRAM3PMS</name>
              <description>System SRAM3 In Bank1 Power Mode Select (Write Protect)\nThis field can control SRAM3 in bank1 (64k) power mode for range 0x201B_0000 - 0x201B_FFFF.\nNote 1: Power shut down mode can get least leakage, but don't guarantee the retention of SRAM data.\nNote 2: This bit is write protected. Refer to the SYS_REGLCTL register.\nNote 3: Write operation is ignored when PCBUSY is 1.\nNote 4: If system enter Power-down mode and D0PGEN(PMC_PWRCTL[0]) is set to 1, This SRAM is auto set to power shut down mode by hardware.\nNote 5: These bits are not retained when D0 power is turned off.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>System SRAM3 in bank1 is normal mode</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>System SRAM3 in bank1 is retention mode</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>System SRAM3 in bank1 is power shut down mode</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Reserved (Write Ignore)</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SRAM4PMS</name>
              <description>System SRAM4 In Bank1 Power Mode Select (Write Protect)\nThis field can control SRAM4 in bank1 (64k) power mode for range 0x201C_0000 - 0x201C_FFFF.\nNote 1: Power shut down mode can get least leakage, but don't guarantee the retention of SRAM data.\nNote 2: This bit is write protected. Refer to the SYS_REGLCTL register.\nNote 3: Write operation is ignored when PCBUSY is 1.\nNote 4: If system enter Power-down mode and D0PGEN(PMC_PWRCTL[0]) is set to 1, This SRAM is auto set to power shut down mode by hardware.\nNote 5: These bits are not retained when D0 power is turned off.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>System SRAM4 in bank1 is normal mode</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>System SRAM4 in bank1 is retention mode</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>System SRAM4 in bank1 is power shut down mode</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Reserved (Write Ignore)</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SRAM5PMS</name>
              <description>System SRAM5 In Bank1 Power Mode Select (Write Protect)\nThis field can control SRAM5 in bank1 (64k) power mode for range 0x201D_0000 - 0x201D_FFFF.\nNote 1: Power shut down mode can get least leakage, but don't guarantee the retention of SRAM data.\nNote 2: This bit is write protected. Refer to the SYS_REGLCTL register.\nNote 3: Write operation is ignored when PCBUSY is 1.\nNote 4: If system enter Power-down mode and D0PGEN(PMC_PWRCTL[0]) is set to 1, This SRAM is auto set to power shut down mode by hardware.\nNote 5: These bits are not retained when D0 power is turned off.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>System SRAM5 in bank1 is normal mode</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>System SRAM5 in bank1 is retention mode</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>System SRAM5 in bank1 is power shut down mode</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Reserved (Write Ignore)</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SRAM6PMS</name>
              <description>System SRAM6 In Bank1 Power Mode Select (Write Protect)\nThis field can control SRAM6 in bank1 (64k) power mode for range 0x201E_0000 - 0x201E_FFFF.\nNote 1: Power shut down mode can get least leakage, but don't guarantee the retention of SRAM data.\nNote 2: This bit is write protected. Refer to the SYS_REGLCTL register.\nNote 3: Write operation is ignored when PCBUSY is 1.\nNote 4: If system enter Power-down mode and D0PGEN(PMC_PWRCTL[0]) is set to 1, This SRAM is auto set to power shut down mode by hardware.\nNote 5: These bits are not retained when D0 power is turned off.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>System SRAM6 in bank1 is normal mode</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>System SRAM6 in bank1 is retention mode</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>System SRAM6 in bank1 is power shut down mode</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Reserved (Write Ignore)</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SRAM7PMS</name>
              <description>System SRAM7 In Bank1 Power Mode Select (Write Protect)\nThis field can control SRAM7 in bank1 (64k) power mode for range 0x201F_0000 - 0x201F_FFFF.\nNote 1: Power shut down mode can get least leakage, but don't guarantee the retention of SRAM data.\nNote 2: This bit is write protected. Refer to the SYS_REGLCTL register.\nNote 3: Write operation is ignored when PCBUSY is 1.\nNote 4: If system enter Power-down mode and D0PGEN(PMC_PWRCTL[0]) is set to 1, This SRAM is auto set to power shut down mode by hardware.\nNote 5: These bits are not retained when D0 power is turned off.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>System SRAM7 in bank1 is normal mode</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>System SRAM7 in bank1 is retention mode</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>System SRAM7 in bank1 is power shut down mode</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Reserved (Write Ignore)</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>PCBUSY</name>
              <description>Power Changing Busy Flag (Read Only)\nIf PMC_SYSRB1PC is written, this bit is asserted automatically by hardware, and is de-asserted when SRAM power change procedure is finished.\nNote 1: This bit is not retained when D0 power is turned off.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>System SRAM bank 1 power change finished</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>System SRAM bank 1 power changing. The PMC_SYSRB1PC write operations are ignored</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
          </fields>
       </register>
