wosayttn/sdk-bsp-numaker-m55m1/Debug/svd/M55M1.svd
       <register>
          <name>PMC_SYSRB2PC</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PMC_SYSRB2PC</displayName>
          <description>System SRAM Bank 2 Power Mode Control Register</description>
          <addressOffset>0x108</addressOffset>
          <access>read-write</access>
          <resetValue>0x000002AA</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SRAM0PMS</name>
              <description>System SRAM0 In Bank2 Power Mode Select (Write Protect)\nThis field can control SRAM0 in bank2 (64k) power mode for range 0x2020_0000 - 0x2020_FFFF.\nNote 1: Power shut down mode can get least leakage, but don't guarantee the retention of SRAM data.\nNote 2: This bit is write protected. Refer to the SYS_REGLCTL register.\nNote 3: Write operation is ignored when PCBUSY is 1.\nNote 4: If system enter Power-down mode and D0PGEN(PMC_PWRCTL[0]) is set to 1, This SRAM is auto set to power shut down mode by hardware.\nNote 5: These bits are not retained when D0 power is turned off.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>System SRAM0 in bank2 is normal mode</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>System SRAM0 in bank2 is retention mode</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>System SRAM0 in bank2 is power shut down mode</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Reserved (Write Ignore)</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SRAM1PMS</name>
              <description>System SRAM1 In Bank2 Power Mode Select (Write Protect)\nThis field can control SRAM1 in bank2 (64k) power mode for range 0x2021_0000 - 0x2021_FFFF.\nNote 1: Power shut down mode can get least leakage, but don't guarantee the retention of SRAM data.\nNote 2: This bit is write protected. Refer to the SYS_REGLCTL register.\nNote 3: Write operation is ignored when PCBUSY is 1.\nNote 4: If system enter Power-down mode and D0PGEN(PMC_PWRCTL[0]) is set to 1, This SRAM is auto set to power shut down mode by hardware.\nNote 5: These bits are not retained when D0 power is turned off.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>System SRAM1 in bank2 is normal mode</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>System SRAM1 in bank2 is retention mode</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>System SRAM1 in bank2 is power shut down mode</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Reserved (Write Ignore)</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SRAM2PMS</name>
              <description>System SRAM2 In Bank2 Power Mode Select (Write Protect)\nThis field can control SRAM2 in bank2 (64k) power mode for range 0x2022_0000 - 0x2022_FFFF.\nNote 1: Power shut down mode can get least leakage, but don't guarantee the retention of SRAM data.\nNote 2: This bit is write protected. Refer to the SYS_REGLCTL register.\nNote 3: Write operation is ignored when PCBUSY is 1.\nNote 4: If system enter Power-down mode and D0PGEN(PMC_PWRCTL[0]) is set to 1, This SRAM is auto set to power shut down mode by hardware.\nNote 5: These bits are not retained when D0 power is turned off.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>System SRAM2 in bank2 is normal mode</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>System SRAM2 in bank2 is retention mode</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>System SRAM2 in bank2 is power shut down mode</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Reserved (Write Ignore)</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SRAM3PMS</name>
              <description>System SRAM3 In Bank2 Power Mode Select (Write Protect)\nThis field can control SRAM3 in bank2 (64k) power mode for range 0x2023_0000 - 0x2023_FFFF.\nNote 1: Power shut down mode can get least leakage, but don't guarantee the retention of SRAM data.\nNote 2: This bit is write protected. Refer to the SYS_REGLCTL register.\nNote 3: Write operation is ignored when PCBUSY is 1.\nNote 4: If system enter Power-down mode and D0PGEN(PMC_PWRCTL[0]) is set to 1, This SRAM is auto set to power shut down mode by hardware.\nNote 5: These bits are not retained when D0 power is turned off.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>System SRAM3 in bank2 is normal mode</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>System SRAM3 in bank2 is retention mode</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>System SRAM3 in bank2 is power shut down mode</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Reserved (Write Ignore)</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SRAM4PMS</name>
              <description>System SRAM4 In Bank2 Power Mode Select (Write Protect)\nThis field can control SRAM2 in bank1 (64k) power mode for range 0x2024_0000 - 0x2024_FFFF.\nNote 1: Power shut down mode can get least leakage, but don't guarantee the retention of SRAM data.\nNote 2: This bit is write protected. Refer to the SYS_REGLCTL register.\nNote 3: Write operation is ignored when PCBUSY is 1.\nNote 4: If system enter Power-down mode and D0PGEN(PMC_PWRCTL[0]) is set to 1, This SRAM is auto set to power shut down mode by hardware.\nNote 5: These bits are not retained when D0 power is turned off.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>System SRAM4 in bank2 is normal mode</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>System SRAM4 in bank2 is retention mode</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>System SRAM4 in bank2 is power shut down mode</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Reserved (Write Ignore)</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>PCBUSY</name>
              <description>Power Changing Busy Flag (Read Only)\nIf PMC_SYSRB2PC is written, this bit is asserted automatically by hardware, and is de-asserted when SRAM power change procedure is finished.\nNote: This bit is not retained when D0 power is turned off.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>System SRAM bank 2 power change finished</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>System SRAM bank 2 power changing. The PMC_SYSRB2PC write operations are ignored</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>PMC_SYSRB3PC</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PMC_SYSRB3PC</displayName>
          <description>System SRAM Bank 3 Power Mode Control Register</description>
          <addressOffset>0x10C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000002</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SRAM0PMS</name>
              <description>System SRAM0 In Bank3 Power Mode Select (Write Protect)\nThis field can control SRAM0 in bank3 (8k) power mode for range 0x2030_0000 - 0x2030_1FFF.\nNote 1: Power shut down mode can get least leakage, but don't guarantee the retention of SRAM data.\nNote 2: This bit is write protected. Refer to the SYS_REGLCTL register.\nNote 3: Write operation is ignored when PCBUSY is 1.\nNote 4: If system enter Power-down mode and D1PGEN(PMC_PWRCTL[1]) is set to 1, This SRAM is auto set to power shut down mode by hardware.\nNote 5: These bits are not retained when D1 power is turned off.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>System SRAM0 in bank3 is normal mode</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>System SRAM0 in bank3 is retention mode</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>System SRAM0 in bank3 is power shut down mode</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Reserved (Write Ignore)</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>PCBUSY</name>
              <description>Power Changing Busy Flag (Read Only)\nIf PMC_SYSRB3PC is written, this bit is asserted automatically by hardware, and is de-asserted when SRAM power change procedure is finished.\nNote 1: This bit is not retained when D1 power is turned off.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>System SRAM bank 3 power change finished</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>System SRAM bank 3 power changing. The PMC_SYSRB0PC write operations are ignored</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>PMC_LPSYSRPC</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PMC_LPSYSRPC</displayName>
          <description>Low Power Domain System SRAM Power Mode Control Register</description>
          <addressOffset>0x110</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SRAM0PMS</name>
              <description>Low Power Domain SRAM0 Power Mode Select (Write Protect)\nThis field can control SRAM0 (8k) power mode for range 0x2031_0000 - 0x2031_0FFF.\nNote 1: Power shut down mode can get least leakage, but don't guarantee the retention of SRAM data.\nNote 2: This bit is write protected. Refer to the SYS_REGLCTL register.\nNote 3: Write operation is ignored when PCBUSY is 1.\nNote 4: If system enter Power-down mode and D3PGEN(PMC_PWRCTL[3]) is set to 1, This SRAM is auto set to power shut down mode by hardware.\nNote 5: These bits are not retained when D3 power is turned off.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>System SRAM0 in low power domain is normal mode</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>System SRAM0 in low power domain is retention mode</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>System SRAM0 in low power domain is power shut down mode</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Reserved (Write Ignore)</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>PCBUSY</name>
              <description>Power Changing Busy Flag (Read Only)\nIf PMC_LPSYSRPC is written, this bit is asserted automatically by hardware, and is de-asserted when SRAM power change procedure is finished.\nNote 1: This bit is not retained when D3 power is turned off.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Low power domain SRAM bank 3 power change finished</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Low power domain power changing. The PMC_SYSLPRPC write operations are ignored</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>PMC_CCAPRPC</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PMC_CCAPRPC</displayName>
          <description>CCAP SRAM Power Mode Control Register</description>
          <addressOffset>0x124</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000002</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CCAP0SRPMS</name>
              <description>CCAP0 SRAM Power Mode Select (Write Protect)\nThis field can control CCAP0 SRAM power mode.\nNote 1: Power shut down mode can get least leakage, but don't guarantee the retention of SRAM data.\nNote 2: This bit is write protected. Refer to the SYS_REGLCTL register.\nNote 3: Write operation is ignored when PCBUSY is 1.\nNote 4: These bits are not retained when D2 power is turned off.\nNote 5: This field only reset by POR reset.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>CCAP0 SRAM is normal mode</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>CCAP0 SRAM is retention mode</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>CCAP0 SRAM is power shut down mode</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Reserved (Write Ignore)</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>PCBUSY</name>
              <description>Power Changing Busy Flag (Read Only)\nIf PMC_CCAPRPC is written, this bit is asserted automatically by hardware, and is de-asserted when SRAM power change procedure is finished.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>CCAP SRAM power change finished</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>CCAP SRAM power changing. The PMC_CCAPRPC write operations are ignored</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>PMC_DMICRPC</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PMC_DMICRPC</displayName>
          <description>DMIC SRAM Power Mode Control Register</description>
          <addressOffset>0x128</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000002</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DMIC0SRPMS</name>
              <description>DMIC0 SRAM Power Mode Select (Write Protect)\nThis field can control DMIC0 SRAM power mode.\nNote 1: Power shut down mode can get least leakage, but don't guarantee the retention of SRAM data.\nNote 2: This bit is write protected. Refer to the SYS_REGLCTL register.\nNote 3: Write operation is ignored when PCBUSY is 1.\nNote 4: These bits are not retained when D2 power is turned off.\nNote 5: This field only reset by POR reset.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>DMIC0 SRAM is normal mode</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>DMIC0 SRAM is retention mode</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>DMIC0 SRAM is power shut down mode</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Reserved (Write Ignore)</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>PCBUSY</name>
              <description>Power Changing Busy Flag (Read Only)\nIf PMC_DMICRPC is written, this bit is asserted automatically by hardware, and is de-asserted when SRAM power change procedure is finished.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>DMIC SRAM power change finished</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>DMIC SRAM power changing. The PMC_DMICRPC write operations are ignored</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
          </fields>
       </register>
