wosayttn/sdk-bsp-numaker-m55m1/Debug/svd/M55M1.svd
       <register>
          <name>SYS_SRAMSTS</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SYS_SRAMSTS</displayName>
          <description>System SRAM Parity Check Status Register</description>
          <addressOffset>0x14</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFF0</resetMask>
          <fields>
            <field>
              <name>PERRIF</name>
              <description>SRAM Parity Check Error Flag\nThis bit indicates the System SRAM byte 0 parity error occurred.\nNote 1: Write 1 to clear this bit to 0.\nNote 2: The default value depends on the content of SRAM. It is better to check this value before use it. If the default value is 1, it shall be cleared first.\nNote 3: This bit is not retained when D0 power is turned off.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No System SRAM parity error</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>System SRAM parity error occured</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>B0PERRIF</name>
              <description>SRAM Byte 0 Parity Check Error Flag (Read Only)\nThis bit indicates the System SRAM byte 0 parity error occurred.\nNote 1: Write 1 to PERRIF for clear this bit to 0..\nNote 2: The default value depends on the content of SRAM. It is better to check this value before use it. If the default value is 1, it shall be cleared first.\nNote 3: This bit is not retained when D0 power is turned off.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No System SRAM byte 0 parity error</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>System SRAM byte 0 parity error occured</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>B1PERRIF</name>
              <description>SRAM Byte 1 Parity Check Error Flag (Read Only)\nThis bit indicates the System SRAM byte 1 parity error occurred.\nNote 1: Write 1 to PERRIF for clear this bit to 0.\nNote 2: The default value depends on the content of SRAM. It is better to check this value before use it. If the default value is 1, it shall be cleared first.\nNote 3: This bit is not retained when D0 power is turned off.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No System SRAM byte 1 parity error</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>System SRAM byte 1 parity error occured</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>B2PERRIF</name>
              <description>SRAM Byte 2 Parity Check Error Flag (Read Only)\nThis bit indicates the System SRAM byte 2 parity error occurred.\nNote 1: Write 1 to PERRIF for clear this bit to 0.\nNote 2: The default value depends on the content of SRAM. It is better to check this value before use it. If the default value is 1, it shall be cleared first.\nNote 3: This bit is not retained when D0 power is turned off.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No System SRAM byte 2 parity error</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>System SRAM byte 2 parity error occured</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>B3PERRIF</name>
              <description>SRAM Byte 3 Parity Check Error Flag (Read Only)\nThis bit indicates the System SRAM byte 3 parity error occurred.\nNote 1: Write 1 to PERRIF for clear this bit to 0.\nNote 2: The default value depends on the content of SRAM. It is better to check this value before use it. If the default value is 1, it shall be cleared first.\nNote 3: This bit is not retained when D0 power is turned off.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No System SRAM byte 3 parity error</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>System SRAM byte 3 parity error occured</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>B4PERRIF</name>
              <description>SRAM Byte 4 Parity Check Error Flag (Read Only)\nThis bit indicates the System SRAM byte 4 parity error occurred.\nNote 1: Write 1 to PERRIF for clear this bit to 0.\nNote 2: The default value depends on the content of SRAM. It is better to check this value before use it. If the default value is 1, it shall be cleared first.\nNote 3: This bit is not retained when D0 power is turned off.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No System SRAM byte 4 parity error</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>System SRAM byte 4 parity error occured</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>B5PERRIF</name>
              <description>SRAM Byte 5 Parity Check Error Flag (Read Only)\nThis bit indicates the System SRAM byte 5 parity error occurred.\nNote 1: Write 1 to PERRIF for clear this bit to 0.\nNote 2: The default value depends on the content of SRAM. It is better to check this value before use it. If the default value is 1, it shall be cleared first.\nNote 3: This bit is not retained when D0 power is turned off.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No System SRAM byte 5 parity error</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>System SRAM byte 5 parity error occured</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>B6PERRIF</name>
              <description>SRAM Byte 6 Parity Check Error Flag (Read Only)\nThis bit indicates the System SRAM byte 6 parity error occurred.\nNote 1: Write 1 to PERRIF for clear this bit to 0.\nNote 2: The default value depends on the content of SRAM. It is better to check this value before use it. If the default value is 1, it shall be cleared first.\nNote 3: This bit is not retained when D0 power is turned off.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No System SRAM byte 6 parity error</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>System SRAM byte 6 parity error occured</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>B7PERRIF</name>
              <description>SRAM Byte 7 Parity Check Error Flag (Read Only)\nThis bit indicates the System SRAM byte 7 parity error occurred.\nNote 1: Write 1 to PERRIF for clear this bit to 0.\nNote 2: The default value depends on the content of SRAM. It is better to check this value before use it. If the default value is 1, it shall be cleared first.\nNote 3: This bit is not retained when D0 power is turned off.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No System SRAM byte 7 parity error</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>System SRAM byte 7 parity error occured</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>SYS_SRAMEADR</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SYS_SRAMEADR</displayName>
          <description>System SRAM Parity Error Address Register</description>
          <addressOffset>0x18</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ERRADDR</name>
              <description>System SRAM Parity Error Address (Read Only)\nThis register shows system SRAM parity error byte offset.\nNote: These bits are not retained when D0 power is turned off.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
