wosayttn/sdk-bsp-numaker-m55m1/Debug/svd/M55M1.svd
       <register>
          <name>SYS_VREFCTL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SYS_VREFCTL</displayName>
          <description>VREF Control Register</description>
          <addressOffset>0x2C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VREFCTL</name>
              <description>VREF Control Bits (Write Protect)\nNote 1: These bits are write protected. Refer to the SYS_REGLCTL register.\nNote 2: Write operation is ignored when WRBUSY is high.\nNote 3: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>VREF is from external pin</description>
                    <value>#00000</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>VREF is internal 1.6V</description>
                    <value>#00011</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>7</name>
                    <description>VREF is internal 2.048V</description>
                    <value>#00111</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>11</name>
                    <description>VREF is internal 2.500V</description>
                    <value>#01011</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>15</name>
                    <description>VREF is internal 3.072V</description>
                    <value>#01111</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>PRELOADSEL</name>
              <description>Pre-load Timing Selection (Write Protect)\nNote 1: These bits are write protected. Refer to the SYS_REGLCTL register.\nNote 2: Write operation is ignored when WRBUSY is high.\nNote 3: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>pre-load time is 480us for 1uF Capacitor, initial = 0v</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>pre-load time is 2ms for 4.7uF Capacitor, initial = 0v</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>pre-load time is 3ms for 1uF Capacitor, initial = 3.6v</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>pre-load time is 15ms for 4.7uF Capacitor, initial = 3.6v</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SCPTEST</name>
              <description>Short Circuit Protection Test Pin (Write Protect)\nNote 1: This bit is write protected. Refer to the SYS_REGLCTL register.\nNote 2: Write operation is ignored when WRBUSY is high.\nNote 3: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Short circuit protection Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Short circuit protection Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SCPFINISH</name>
              <description>Short Circuit Protection Result (Read Only)\nShort circuit protection finish.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WRBUSY</name>
              <description>Write Busy Flag (Read Only)\nIf SYS_VREFCTL is written, this bit is asserted automatically by hardware, and is de-asserted when write procedure is finished.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>SYS_VREFCTL register is ready for write operation</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>SYS_VREFCTL register is busy on the last write operation. Other write operations are ignored</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>SYS_IVSCTL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SYS_IVSCTL</displayName>
          <description>Internal Voltage Source Control Register</description>
          <addressOffset>0x30</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VTEMPEN</name>
              <description>Temperature Sensor Enable Bit\nThis bit is used to enable/disable temperature sensor function.\nNote 1: After this bit is set to 1, the value of temperature sensor output can be obtained from ADC conversion result. Please refer to ADC chapter for details.\nNote 2: This bit is not retained when D0 power is turned off.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Temperature sensor function Disabled (default)</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Temperature sensor function Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>VBATUGEN</name>
              <description>VBAT Unity Gain Buffer Enable Bit\nThis bit is used to enable/disable VBAT unity gain buffer function.\nNote: After this bit is set to 1, the value of VBAT unity gain buffer output voltage can be obtained from ADC conversion result.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>VBAT unity gain buffer function Disabled (default)</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>VBAT unity gain buffer function Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>AVDDDIV4EN</name>
              <description>AVDD divide 4 Enable Bit\nThis bit is used to enable/disable AVDD divide 4 function.\nNote 1: After this bit is set to 1, the value of AVDD divide 4 output voltage can be obtained from ADC conversion result\nNote 2: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>AVDD divide 4 function Disabled (default)</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>AVDD divide 4 function Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>VTEMPSEL</name>
              <description>Temperature Sensor Slope Select Bit\nThis bit is used to select temperature sensor slope trend.\nNote 2: These bits are not retained when D0 power is turned off.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Temperature sensor CTAT slope</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Temperature sensor PTAT slope</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>SYS_USBPHY</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SYS_USBPHY</displayName>
          <description>USB PHY Control Register</description>
          <addressOffset>0x34</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000003</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USBROLE</name>
              <description>USB Role Option (Write Protect)\nThese two bits are used to select the role of USB.\nNote 1: These bits are write protected. Refer to the SYS_REGLCTL register.\nNote 2: These bits are not retained when D1 power is turned off.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Standard USB Device mode</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Standard USB Host mode</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>ID dependent mode</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>On-The-Go device mode</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>OTGPHYEN</name>
              <description>USB OTG PHY Enable (Write Protect)\nThis bit is used to enable/disable OTG PHY function.\nNote: This bit is not retained when D1 power is turned off.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>OTG PHY function Disabled (default)</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>OTG PHY function Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>HSUSBROLE</name>
              <description>HSUSB Role Option (Write Protect)\nThese two bits are used to select the role of HSUSB.\nNote 1: These bits are write protected. Refer to the SYS_REGLCTL register.\nNote 2: These bits are not retained when D1 power is turned off.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Standard HSUSB Device mode</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Standard HSUSB Host mode</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>ID dependent mode</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>On-The-Go device mode</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>HSOTGPHYEN</name>
              <description>HSUSB OTG PHY Enable (Write Protect)\nThis bit is used to enable/disable HSOTG PHY function.\nNote 1: This bit is write protected. Refer to the SYS_REGLCTL register.\nNote 2: This bit is not retained when D1 power is turned off.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>HSUSB OTG PHY function Disabled (default)</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>HSUSB OTG PHY function Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>HSUSBACT</name>
              <description>HSOTG PHY Active Control\nThis bit is used to control HSOTG PHY at reset state or active state.\nNote: After setting HSOTGPHYEN (SYS_USBPHY[24]) to enable HSOTG PHY, user should keep HSOTG PHY at reset mode at lease 10us before changing to active mode.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>HSOTG PHY at reset state</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>HSOTG PHY at active state</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>SYS_UTCPDCTL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SYS_UTCPDCTL</displayName>
          <description>UTCPD Control Register</description>
          <addressOffset>0x38</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IOMODE</name>
              <description>UTCPD0 as I/O mode\nThis bit is used to define UTCPD0 CCx and CCDBx function\nNote: This bit is not retained when D4 power is turned off.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Pin as UTCPD0 CCx and CCDBx function</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Pin as general I/O function</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>POREN0</name>
              <description>UTCPD0 Power-on Enable Bit\nNote 1: user should set POREN0 to 1 after IOMODE is setting down.\nNote 2: This bit is not retained when D4 power is turned off.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>UTCPD0 PHY in reset mode</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>UTCPD0 PHY in normal mode</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>PD0VBDSS</name>
              <description>UTCPD0 VBUS Detect Source Select\nUTCPD0 controller need a VBUS detect result to note if VBUS is connected. For NPD0~2 usage, ACMP can be another voltage detect method to detect VBUS pulg in or out. This bit field is used to select UTCPD0 VBUS detect source. And the selected result is VBDETSW0\nNote 1: Before use UTCPD0 function, UDVBDETS should be set and cannot change during UTCPD0 operating.\nNote 2: This bit is not retained when D3 power is turned off.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>UTCPD0 VBUS detect source from UTCPD0 PHY</description>
                    <value>#000</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>UTCPD0 VBUS detect source from ACMP0 output</description>
                    <value>#001</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>UTCPD0 VBUS detect source from ACMP1 output</description>
                    <value>#010</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>UTCPD0 VBUS detect source from ACMP2 output</description>
                    <value>#011</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>UDVBDETS</name>
              <description>UDC11 VBUS Detect Source Select\nNote 1: Before use UDC11 function, UDVBDETS should be set and cannot change during UDC11 operating.\nNote 2: This bit is not retained when D3 power is turned off.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>UDC11 VBUS detect source from OTGPHY</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>UDC11 VBUS detect source from VBDETSW0</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>SYS_DBUSCTL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SYS_DBUSCTL</displayName>
          <description>Data Bus Control Register</description>
          <addressOffset>0x40</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>H2XBSTEN</name>
              <description>Burst AHB2AXI Bridge access Enable Bit (Write Protect)\nNote 1: These bits are write protected. Refer to the SYS_REGLCTL register.\nNote 2: This bit is not retained when D0 power is turned off.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Normal operating</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Force the attribute of all access from AHB to AXI modifiable</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
