wosayttn/sdk-bsp-numaker-m55m1/Debug/svd/M55M1.svd
       <register>
          <name>SYS_GPJ_MFOS</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SYS_GPJ_MFOS</displayName>
          <description>GPIOJ Multiple Function Output Select Register</description>
          <addressOffset>0xA4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MFOS0</name>
              <description>GPIOJ Pin[x] Multiple Function Pin Output Mode Select\nThis bit used to select multiple function pin output mode type for PJ.x pin.\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Multiple function pin output mode type is Push-pull mode</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Multiple function pin output mode type is Open-drain mode</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>MFOS1</name>
              <description>GPIOJ Pin[x] Multiple Function Pin Output Mode Select\nThis bit used to select multiple function pin output mode type for PJ.x pin.\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Multiple function pin output mode type is Push-pull mode</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Multiple function pin output mode type is Open-drain mode</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>MFOS2</name>
              <description>GPIOJ Pin[x] Multiple Function Pin Output Mode Select\nThis bit used to select multiple function pin output mode type for PJ.x pin.\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Multiple function pin output mode type is Push-pull mode</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Multiple function pin output mode type is Open-drain mode</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>MFOS3</name>
              <description>GPIOJ Pin[x] Multiple Function Pin Output Mode Select\nThis bit used to select multiple function pin output mode type for PJ.x pin.\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Multiple function pin output mode type is Push-pull mode</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Multiple function pin output mode type is Open-drain mode</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>MFOS4</name>
              <description>GPIOJ Pin[x] Multiple Function Pin Output Mode Select\nThis bit used to select multiple function pin output mode type for PJ.x pin.\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Multiple function pin output mode type is Push-pull mode</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Multiple function pin output mode type is Open-drain mode</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>MFOS5</name>
              <description>GPIOJ Pin[x] Multiple Function Pin Output Mode Select\nThis bit used to select multiple function pin output mode type for PJ.x pin.\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Multiple function pin output mode type is Push-pull mode</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Multiple function pin output mode type is Open-drain mode</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>MFOS6</name>
              <description>GPIOJ Pin[x] Multiple Function Pin Output Mode Select\nThis bit used to select multiple function pin output mode type for PJ.x pin.\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Multiple function pin output mode type is Push-pull mode</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Multiple function pin output mode type is Open-drain mode</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>MFOS7</name>
              <description>GPIOJ Pin[x] Multiple Function Pin Output Mode Select\nThis bit used to select multiple function pin output mode type for PJ.x pin.\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Multiple function pin output mode type is Push-pull mode</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Multiple function pin output mode type is Open-drain mode</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>MFOS8</name>
              <description>GPIOJ Pin[x] Multiple Function Pin Output Mode Select\nThis bit used to select multiple function pin output mode type for PJ.x pin.\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Multiple function pin output mode type is Push-pull mode</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Multiple function pin output mode type is Open-drain mode</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>MFOS9</name>
              <description>GPIOJ Pin[x] Multiple Function Pin Output Mode Select\nThis bit used to select multiple function pin output mode type for PJ.x pin.\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Multiple function pin output mode type is Push-pull mode</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Multiple function pin output mode type is Open-drain mode</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>MFOS10</name>
              <description>GPIOJ Pin[x] Multiple Function Pin Output Mode Select\nThis bit used to select multiple function pin output mode type for PJ.x pin.\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Multiple function pin output mode type is Push-pull mode</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Multiple function pin output mode type is Open-drain mode</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>MFOS11</name>
              <description>GPIOJ Pin[x] Multiple Function Pin Output Mode Select\nThis bit used to select multiple function pin output mode type for PJ.x pin.\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Multiple function pin output mode type is Push-pull mode</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Multiple function pin output mode type is Open-drain mode</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>MFOS12</name>
              <description>GPIOJ Pin[x] Multiple Function Pin Output Mode Select\nThis bit used to select multiple function pin output mode type for PJ.x pin.\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Multiple function pin output mode type is Push-pull mode</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Multiple function pin output mode type is Open-drain mode</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>MFOS13</name>
              <description>GPIOJ Pin[x] Multiple Function Pin Output Mode Select\nThis bit used to select multiple function pin output mode type for PJ.x pin.\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Multiple function pin output mode type is Push-pull mode</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Multiple function pin output mode type is Open-drain mode</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>SYS_REGLCTL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SYS_REGLCTL</displayName>
          <description>Register Lock Control Register</description>
          <addressOffset>0x100</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REGLCTL</name>
              <description>Register Lock Control Code \nSome registers have write-protection function. Writing these registers have to disable the protected function by writing the sequence value '59h', '16h', '88h' to this field. After this sequence is completed, the REGLCTL bit will be set to 1 and write-protection registers can be normal write.\nREGLCTL[0]\nRegister Lock Control Disable Index\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Write-protection Enabled for writing protected registers. Any write to the protected register is ignored</description>
                    <value>0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Write-protection Disabled for writing protected registers</description>
                    <value>1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
