wosayttn/sdk-bsp-numaker-m55m1/Debug/svd/M55M1.svd
       <register>
          <name>SYS_I3CRST</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SYS_I3CRST</displayName>
          <description>I3C Reset Control Register</description>
          <addressOffset>0x25C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>I3C0RST</name>
              <description>I3Cx Controller Reset (Write Protect)\nSetting this bit to 1 will generate a reset signal to the I3Cx. User needs to set this bit to 0 to release from reset state.\nNote 1: This bit is write protected. Refer to the SYS_REGLCTL register.\nNote 2: This bit is not retained when D0 power is turned off.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>I3Cx controller normal operation</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>I3Cx controller reset</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>SYS_KDFRST</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SYS_KDFRST</displayName>
          <description>KDF Reset Control Register</description>
          <addressOffset>0x260</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>KDF0RST</name>
              <description>KDFx Controller Reset (Write Protect)\nSetting this bit to 1 will generate a reset signal to the KDFx. User needs to set this bit to 0 to release from reset state.\nNote 1: This bit is write protected. Refer to the SYS_REGLCTL register.\nNote 2: This bit is not retained when D0 power is turned off.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>KDFx controller normal operation</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>KDFx controller reset</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>SYS_KPIRST</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SYS_KPIRST</displayName>
          <description>KPI Reset Control Register</description>
          <addressOffset>0x264</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>KPI0RST</name>
              <description>KPIx Controller Reset (Write Protect)\nSetting this bit to 1 will generate a reset signal to the KPIx. User needs to set this bit to 0 to release from reset state.\nNote 1: This bit is write protected. Refer to the SYS_REGLCTL register.\nNote 2: This bit is not retained when D0 power is turned off.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>KPIx controller normal operation</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>KPIx controller reset</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>SYS_KSRST</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SYS_KSRST</displayName>
          <description>KS Reset Control Register</description>
          <addressOffset>0x268</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>KS0RST</name>
              <description>KSx Controller Reset (Write Protect)\nSetting this bit to 1 will generate a reset signal to the KSx. User needs to set this bit to 0 to release from reset state.\nNote 1: This bit is write protected. Refer to the SYS_REGLCTL register.\nNote 2: This bit is not retained when D0 power is turned off.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>KSx controller normal operation</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>KSx controller reset</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>SYS_LPADCRST</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SYS_LPADCRST</displayName>
          <description>Low Power ADC Reset Control Register</description>
          <addressOffset>0x26C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LPADC0RST</name>
              <description>LPADCx Controller Reset (Write Protect)\nSetting this bit to 1 will generate a reset signal to the LPADCx. User needs to set this bit to 0 to release from reset state.\nNote 1: This bit is write protected. Refer to the SYS_REGLCTL register.\nNote 2: This bit is not retained when D0 power is turned off.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>LPADCx controller normal operation</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>LPADCx controller reset</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>SYS_LPPDMARST</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SYS_LPPDMARST</displayName>
          <description>Low Power PDMA Reset Control Register</description>
          <addressOffset>0x270</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LPPDMA0RST</name>
              <description>LPPDMAx Controller Reset (Write Protect)\nSetting this bit to 1 will generate a reset signal to the LPPDMAx. User needs to set this bit to 0 to release from reset state.\nNote 1: This bit is write protected. Refer to the SYS_REGLCTL register.\nNote 2: This bit is not retained when D0 power is turned off.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>LPPDMAx controller normal operation</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>LPPDMAx controller reset</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>SYS_LPGPIORST</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SYS_LPGPIORST</displayName>
          <description>Low Power GPIO Reset Control Register</description>
          <addressOffset>0x274</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LPGPIO0RST</name>
              <description>LPGPIOx Controller Reset (Write Protect)\nSetting this bit to 1 will generate a reset signal to the LPGPIOx. User needs to set this bit to 0 to release from reset state.\nNote 1: This bit is write protected. Refer to the SYS_REGLCTL register.\nNote 2: This bit is not retained when D0 power is turned off.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>LPGPIOx controller normal operation</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>LPGPIOx controller reset</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>SYS_LPI2CRST</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SYS_LPI2CRST</displayName>
          <description>Low Power I2C Reset Control Register</description>
          <addressOffset>0x278</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LPI2C0RST</name>
              <description>LPI2Cx Controller Reset (Write Protect)\nSetting this bit to 1 will generate a reset signal to the LPI2Cx. User needs to set this bit to 0 to release from reset state.\nNote 1: This bit is write protected. Refer to the SYS_REGLCTL register.\nNote 2: This bit is not retained when D0 power is turned off.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>LPI2Cx controller normal operation</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>LPI2Cx controller reset</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>SYS_LPSPIRST</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SYS_LPSPIRST</displayName>
          <description>Low Power SPI Reset Control Register</description>
          <addressOffset>0x27C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LPSPI0RST</name>
              <description>LPSPIx Controller Reset (Write Protect)\nSetting this bit to 1 will generate a reset signal to the LPSPIx. User needs to set this bit to 0 to release from reset state.\nNote 1: This bit is write protected. Refer to the SYS_REGLCTL register.\nNote 2: This bit is not retained when D0 power is turned off.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>LPSPIx controller normal operation</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>LPSPIx controller reset</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>SYS_LPTMRRST</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SYS_LPTMRRST</displayName>
          <description>Low Power TMR Reset Control Register</description>
          <addressOffset>0x280</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LPTMR0RST</name>
              <description>LPTMRx Controller Reset (Write Protect)\nSetting this bit to 1 will generate a reset signal to the LPTMRx. User needs to set this bit to 0 to release from reset state.\nNote 1: This bit is write protected. Refer to the SYS_REGLCTL register.\nNote 2: This bit is not retained when D0 power is turned off.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>LPTMRx controller normal operation</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>LPTMRx controller reset</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>LPTMR1RST</name>
              <description>LPTMRx Controller Reset (Write Protect)\nSetting this bit to 1 will generate a reset signal to the LPTMRx. User needs to set this bit to 0 to release from reset state.\nNote 1: This bit is write protected. Refer to the SYS_REGLCTL register.\nNote 2: This bit is not retained when D0 power is turned off.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>LPTMRx controller normal operation</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>LPTMRx controller reset</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>SYS_LPUARTRST</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SYS_LPUARTRST</displayName>
          <description>Low Power UART Reset Control Register</description>
          <addressOffset>0x284</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LPUART0RST</name>
              <description>LPUARTx Controller Reset (Write Protect)\nSetting this bit to 1 will generate a reset signal to the LPUARTx. User needs to set this bit to 0 to release from reset state.\nNote 1: This bit is write protected. Refer to the SYS_REGLCTL register.\nNote 2: This bit is not retained when D0 power is turned off.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>LPUARTx controller normal operation</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>LPUARTx controller reset</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>SYS_OTFCRST</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SYS_OTFCRST</displayName>
          <description>OTFC Reset Control Register</description>
          <addressOffset>0x288</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OTFC0RST</name>
              <description>OTFCx Controller Reset (Write Protect)\nSetting this bit to 1 will generate a reset signal to the OTFCx. User needs to set this bit to 0 to release from reset state.\nNote 1: This bit is write protected. Refer to the SYS_REGLCTL register.\nNote 2: This bit is not retained when D0 power is turned off.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>OTFCx controller normal operation</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>OTFCx controller reset</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>SYS_OTGRST</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SYS_OTGRST</displayName>
          <description>OTG Reset Control Register</description>
          <addressOffset>0x28C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OTG0RST</name>
              <description>OTGx Controller Reset (Write Protect)\nSetting this bit to 1 will generate a reset signal to the OTGx. User needs to set this bit to 0 to release from reset state.\nNote 1: This bit is write protected. Refer to the SYS_REGLCTL register.\nNote 2: This bit is not retained when D0 power is turned off.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>OTGx controller normal operation</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>OTGx controller reset</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>SYS_PDMARST</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SYS_PDMARST</displayName>
          <description>PDMA Reset Control Register</description>
          <addressOffset>0x290</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PDMA0RST</name>
              <description>PDMAx Controller Reset (Write Protect)\nSetting this bit to 1 will generate a reset signal to the PDMAx. User needs to set this bit to 0 to release from reset state.\nNote 1: This bit is write protected. Refer to the SYS_REGLCTL register.\nNote 2: This bit is not retained when D0 power is turned off.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>PDMAx controller normal operation</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>PDMAx controller reset</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>PDMA1RST</name>
              <description>PDMAx Controller Reset (Write Protect)\nSetting this bit to 1 will generate a reset signal to the PDMAx. User needs to set this bit to 0 to release from reset state.\nNote 1: This bit is write protected. Refer to the SYS_REGLCTL register.\nNote 2: This bit is not retained when D0 power is turned off.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>PDMAx controller normal operation</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>PDMAx controller reset</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
