wosayttn/sdk-bsp-numaker-m55m1/Debug/svd/M55M1.svd
       <register>
          <name>SYS_TRNGRST</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SYS_TRNGRST</displayName>
          <description>TRNG Reset Control Register</description>
          <addressOffset>0x2C4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TRNG0RST</name>
              <description>TRNGx Controller Reset (Write Protect)\nSetting this bit to 1 will generate a reset signal to the TRNGx. User needs to set this bit to 0 to release from reset state.\nNote 1: This bit is write protected. Refer to the SYS_REGLCTL register.\nNote 2: This bit is not retained when D0 power is turned off.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>TRNGx controller normal operation</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>TRNGx controller reset</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>SYS_TTMRRST</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SYS_TTMRRST</displayName>
          <description>Tick Timer Reset Control Register</description>
          <addressOffset>0x2C8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TTMR0RST</name>
              <description>TTMRx Controller Reset (Write Protect)\nSetting this bit to 1 will generate a reset signal to the TTMRx. User needs to set this bit to 0 to release from reset state.\nNote 1: This bit is write protected. Refer to the SYS_REGLCTL register.\nNote 2: This bit is not retained when D0 power is turned off.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>TTMRx controller normal operation</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>TTMRx controller reset</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>TTMR1RST</name>
              <description>TTMRx Controller Reset (Write Protect)\nSetting this bit to 1 will generate a reset signal to the TTMRx. User needs to set this bit to 0 to release from reset state.\nNote 1: This bit is write protected. Refer to the SYS_REGLCTL register.\nNote 2: This bit is not retained when D0 power is turned off.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>TTMRx controller normal operation</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>TTMRx controller reset</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>SYS_UARTRST</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SYS_UARTRST</displayName>
          <description>UART Reset Control Register</description>
          <addressOffset>0x2CC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>UART0RST</name>
              <description>UARTx Controller Reset (Write Protect)\nSetting this bit to 1 will generate a reset signal to the UARTx. User needs to set this bit to 0 to release from reset state.\nNote 1: This bit is write protected. Refer to the SYS_REGLCTL register.\nNote 2: This bit is not retained when D0 power is turned off.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>UARTx controller normal operation</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>UARTx controller reset</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>UART1RST</name>
              <description>UARTx Controller Reset (Write Protect)\nSetting this bit to 1 will generate a reset signal to the UARTx. User needs to set this bit to 0 to release from reset state.\nNote 1: This bit is write protected. Refer to the SYS_REGLCTL register.\nNote 2: This bit is not retained when D0 power is turned off.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>UARTx controller normal operation</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>UARTx controller reset</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>UART2RST</name>
              <description>UARTx Controller Reset (Write Protect)\nSetting this bit to 1 will generate a reset signal to the UARTx. User needs to set this bit to 0 to release from reset state.\nNote 1: This bit is write protected. Refer to the SYS_REGLCTL register.\nNote 2: This bit is not retained when D0 power is turned off.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>UARTx controller normal operation</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>UARTx controller reset</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>UART3RST</name>
              <description>UARTx Controller Reset (Write Protect)\nSetting this bit to 1 will generate a reset signal to the UARTx. User needs to set this bit to 0 to release from reset state.\nNote 1: This bit is write protected. Refer to the SYS_REGLCTL register.\nNote 2: This bit is not retained when D0 power is turned off.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>UARTx controller normal operation</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>UARTx controller reset</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>UART4RST</name>
              <description>UARTx Controller Reset (Write Protect)\nSetting this bit to 1 will generate a reset signal to the UARTx. User needs to set this bit to 0 to release from reset state.\nNote 1: This bit is write protected. Refer to the SYS_REGLCTL register.\nNote 2: This bit is not retained when D0 power is turned off.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>UARTx controller normal operation</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>UARTx controller reset</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>UART5RST</name>
              <description>UARTx Controller Reset (Write Protect)\nSetting this bit to 1 will generate a reset signal to the UARTx. User needs to set this bit to 0 to release from reset state.\nNote 1: This bit is write protected. Refer to the SYS_REGLCTL register.\nNote 2: This bit is not retained when D0 power is turned off.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>UARTx controller normal operation</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>UARTx controller reset</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>UART6RST</name>
              <description>UARTx Controller Reset (Write Protect)\nSetting this bit to 1 will generate a reset signal to the UARTx. User needs to set this bit to 0 to release from reset state.\nNote 1: This bit is write protected. Refer to the SYS_REGLCTL register.\nNote 2: This bit is not retained when D0 power is turned off.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>UARTx controller normal operation</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>UARTx controller reset</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>UART7RST</name>
              <description>UARTx Controller Reset (Write Protect)\nSetting this bit to 1 will generate a reset signal to the UARTx. User needs to set this bit to 0 to release from reset state.\nNote 1: This bit is write protected. Refer to the SYS_REGLCTL register.\nNote 2: This bit is not retained when D0 power is turned off.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>UARTx controller normal operation</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>UARTx controller reset</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>UART8RST</name>
              <description>UARTx Controller Reset (Write Protect)\nSetting this bit to 1 will generate a reset signal to the UARTx. User needs to set this bit to 0 to release from reset state.\nNote 1: This bit is write protected. Refer to the SYS_REGLCTL register.\nNote 2: This bit is not retained when D0 power is turned off.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>UARTx controller normal operation</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>UARTx controller reset</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>UART9RST</name>
              <description>UARTx Controller Reset (Write Protect)\nSetting this bit to 1 will generate a reset signal to the UARTx. User needs to set this bit to 0 to release from reset state.\nNote 1: This bit is write protected. Refer to the SYS_REGLCTL register.\nNote 2: This bit is not retained when D0 power is turned off.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>UARTx controller normal operation</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>UARTx controller reset</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>SYS_USBDRST</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SYS_USBDRST</displayName>
          <description>USB Device Reset Control Register</description>
          <addressOffset>0x2D0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USBD0RST</name>
              <description>USBDx Controller Reset (Write Protect)\nSetting this bit to 1 will generate a reset signal to the USBDx. User needs to set this bit to 0 to release from reset state.\nNote 1: This bit is write protected. Refer to the SYS_REGLCTL register.\nNote 2: This bit is not retained when D0 power is turned off.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>USBDx controller normal operation</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>USBDx controller reset</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>SYS_USBHRST</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SYS_USBHRST</displayName>
          <description>USB Host Reset Control Register</description>
          <addressOffset>0x2D4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USBH0RST</name>
              <description>USBHx Controller Reset (Write Protect)\nSetting this bit to 1 will generate a reset signal to the USBHx. User needs to set this bit to 0 to release from reset state.\nNote 1: This bit is write protected. Refer to the SYS_REGLCTL register.\nNote 2: This bit is not retained when D0 power is turned off.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>USBHx controller normal operation</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>USBHx controller reset</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>SYS_USCIRST</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SYS_USCIRST</displayName>
          <description>USCI Reset Control Register</description>
          <addressOffset>0x2D8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USCI0RST</name>
              <description>USCIx Controller Reset (Write Protect)\nSetting this bit to 1 will generate a reset signal to the USCIx. User needs to set this bit to 0 to release from reset state.\nNote 1: This bit is write protected. Refer to the SYS_REGLCTL register.\nNote 2: This bit is not retained when D0 power is turned off.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>USCIx controller normal operation</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>USCIx controller reset</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>SYS_UTCPDRST</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SYS_UTCPDRST</displayName>
          <description>UTCPD Reset Control Register</description>
          <addressOffset>0x2DC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>UTCPD0RST</name>
              <description>UTCPDx Controller Reset (Write Protect)\nSetting this bit to 1 will generate a reset signal to the UTCPDx. User needs to set this bit to 0 to release from reset state.\nNote 1: This bit is write protected. Refer to the SYS_REGLCTL register.\nNote 2: This bit is not retained when D0 power is turned off.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>UTCPDx controller normal operation</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>UTCPDx controller reset</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>SYS_WWDTRST</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SYS_WWDTRST</displayName>
          <description>WWDT Reset Control Register</description>
          <addressOffset>0x2E0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WWDT0RST</name>
              <description>WWDTx Controller Reset (Write Protect)\nSetting this bit to 1 will generate a reset signal to the WWDTx. User needs to set this bit to 0 to release from reset state.\nNote 1: This bit is write protected. Refer to the SYS_REGLCTL register.\nNote 2: This bit is not retained when D0 power is turned off.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>WWDTx controller normal operation</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>WWDTx controller reset</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>WWDT1RST</name>
              <description>WWDTx Controller Reset (Write Protect)\nSetting this bit to 1 will generate a reset signal to the WWDTx. User needs to set this bit to 0 to release from reset state.\nNote 1: This bit is write protected. Refer to the SYS_REGLCTL register.\nNote 2: This bit is not retained when D0 power is turned off.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>WWDTx controller normal operation</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>WWDTx controller reset</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
