wosayttn/sdk-bsp-numaker-m55m1/Debug/svd/M55M1.svd
       <register>
          <name>SYS_GPD_MFP1</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SYS_GPD_MFP1</displayName>
          <description>GPIOD Multiple Function Control Register 1</description>
          <addressOffset>0x334</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PD4MFP</name>
              <description>PD.4 Multi-function Pin Selection\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD5MFP</name>
              <description>PD.5 Multi-function Pin Selection\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD6MFP</name>
              <description>PD.6 Multi-function Pin Selection\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD7MFP</name>
              <description>PD.7 Multi-function Pin Selection\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>SYS_GPD_MFP2</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SYS_GPD_MFP2</displayName>
          <description>GPIOD Multiple Function Control Register 2</description>
          <addressOffset>0x338</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PD8MFP</name>
              <description>PD.8 Multi-function Pin Selection\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD9MFP</name>
              <description>PD.9 Multi-function Pin Selection\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD10MFP</name>
              <description>PD.10 Multi-function Pin Selection\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD11MFP</name>
              <description>PD.11 Multi-function Pin Selection\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>SYS_GPD_MFP3</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SYS_GPD_MFP3</displayName>
          <description>GPIOD Multiple Function Control Register 3</description>
          <addressOffset>0x33C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PD12MFP</name>
              <description>PD.12 Multi-function Pin Selection\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD13MFP</name>
              <description>PD.13 Multi-function Pin Selection\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD14MFP</name>
              <description>PD.14 Multi-function Pin Selection\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>SYS_GPE_MFP0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SYS_GPE_MFP0</displayName>
          <description>GPIOE Multiple Function Control Register 0</description>
          <addressOffset>0x340</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PE0MFP</name>
              <description>PE.0 Multi-function Pin Selection\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PE1MFP</name>
              <description>PE.1 Multi-function Pin Selection\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PE2MFP</name>
              <description>PE.2 Multi-function Pin Selection\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PE3MFP</name>
              <description>PE.3 Multi-function Pin Selection\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>SYS_GPE_MFP1</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SYS_GPE_MFP1</displayName>
          <description>GPIOE Multiple Function Control Register 1</description>
          <addressOffset>0x344</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PE4MFP</name>
              <description>PE.4 Multi-function Pin Selection\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PE5MFP</name>
              <description>PE.5 Multi-function Pin Selection\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PE6MFP</name>
              <description>PE.6 Multi-function Pin Selection\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PE7MFP</name>
              <description>PE.7 Multi-function Pin Selection\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>SYS_GPE_MFP2</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SYS_GPE_MFP2</displayName>
          <description>GPIOE Multiple Function Control Register 2</description>
          <addressOffset>0x348</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PE8MFP</name>
              <description>PE.8 Multi-function Pin Selection\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PE9MFP</name>
              <description>PE.9 Multi-function Pin Selection\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PE10MFP</name>
              <description>PE.10 Multi-function Pin Selection\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PE11MFP</name>
              <description>PE.11 Multi-function Pin Selection\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>SYS_GPE_MFP3</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SYS_GPE_MFP3</displayName>
          <description>GPIOE Multiple Function Control Register 3</description>
          <addressOffset>0x34C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PE12MFP</name>
              <description>PE.12 Multi-function Pin Selection\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PE13MFP</name>
              <description>PE.13 Multi-function Pin Selection\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PE14MFP</name>
              <description>PE.14 Multi-function Pin Selection\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PE15MFP</name>
              <description>PE.15 Multi-function Pin Selection\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>SYS_GPF_MFP0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SYS_GPF_MFP0</displayName>
          <description>GPIOF Multiple Function Control Register 0</description>
          <addressOffset>0x350</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000E0E</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PF0MFP</name>
              <description>PF.0 Multi-function Pin Selection\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PF1MFP</name>
              <description>PF.1 Multi-function Pin Selection\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PF2MFP</name>
              <description>PF.2 Multi-function Pin Selection\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PF3MFP</name>
              <description>PF.3 Multi-function Pin Selection\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>SYS_GPF_MFP1</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SYS_GPF_MFP1</displayName>
          <description>GPIOF Multiple Function Control Register 1</description>
          <addressOffset>0x354</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PF4MFP</name>
              <description>PF.4 Multi-function Pin Selection\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PF5MFP</name>
              <description>PF.5 Multi-function Pin Selection\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PF6MFP</name>
              <description>PF.6 Multi-function Pin Selection\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PF7MFP</name>
              <description>PF.7 Multi-function Pin Selection\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>SYS_GPF_MFP2</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SYS_GPF_MFP2</displayName>
          <description>GPIOF Multiple Function Control Register 2</description>
          <addressOffset>0x358</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PF8MFP</name>
              <description>PF.8 Multi-function Pin Selection\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PF9MFP</name>
              <description>PF.9 Multi-function Pin Selection\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PF10MFP</name>
              <description>PF.10 Multi-function Pin Selection\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PF11MFP</name>
              <description>PF.11 Multi-function Pin Selection\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>SYS_GPG_MFP0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SYS_GPG_MFP0</displayName>
          <description>GPIOG Multiple Function Control Register 0</description>
          <addressOffset>0x360</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PG0MFP</name>
              <description>PG.0 Multi-function Pin Selection\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PG1MFP</name>
              <description>PG.1 Multi-function Pin Selection\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PG2MFP</name>
              <description>PG.2 Multi-function Pin Selection\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PG3MFP</name>
              <description>PG.3 Multi-function Pin Selection\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>SYS_GPG_MFP1</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SYS_GPG_MFP1</displayName>
          <description>GPIOG Multiple Function Control Register 1</description>
          <addressOffset>0x364</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PG4MFP</name>
              <description>PG.4 Multi-function Pin Selection\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PG5MFP</name>
              <description>PG.5 Multi-function Pin Selection\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PG6MFP</name>
              <description>PG.6 Multi-function Pin Selection\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PG7MFP</name>
              <description>PG.7 Multi-function Pin Selection\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>SYS_GPG_MFP2</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SYS_GPG_MFP2</displayName>
          <description>GPIOG Multiple Function Control Register 2</description>
          <addressOffset>0x368</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PG8MFP</name>
              <description>PG.8 Multi-function Pin Selection\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PG9MFP</name>
              <description>PG.9 Multi-function Pin Selection\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PG10MFP</name>
              <description>PG.10 Multi-function Pin Selection\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PG11MFP</name>
              <description>PG.11 Multi-function Pin Selection\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
