wosayttn/sdk-bsp-numaker-m55m1/Debug/svd/M55M1.svd
       <register>
          <name>SYS_GPG_MFP3</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SYS_GPG_MFP3</displayName>
          <description>GPIOG Multiple Function Control Register 3</description>
          <addressOffset>0x36C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PG12MFP</name>
              <description>PG.12 Multi-function Pin Selection\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PG13MFP</name>
              <description>PG.13 Multi-function Pin Selection\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PG14MFP</name>
              <description>PG.14 Multi-function Pin Selection\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PG15MFP</name>
              <description>PG.15 Multi-function Pin Selection\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>SYS_GPH_MFP0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SYS_GPH_MFP0</displayName>
          <description>GPIOH Multiple Function Control Register 0</description>
          <addressOffset>0x370</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PH0MFP</name>
              <description>PH.0 Multi-function Pin Selection\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PH1MFP</name>
              <description>PH.1 Multi-function Pin Selection\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PH2MFP</name>
              <description>PH.2 Multi-function Pin Selection\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PH3MFP</name>
              <description>PH.3 Multi-function Pin Selection\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>SYS_GPH_MFP1</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SYS_GPH_MFP1</displayName>
          <description>GPIOH Multiple Function Control Register 1</description>
          <addressOffset>0x374</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PH4MFP</name>
              <description>PH.4 Multi-function Pin Selection\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PH5MFP</name>
              <description>PH.5 Multi-function Pin Selection\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PH6MFP</name>
              <description>PH.6 Multi-function Pin Selection\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PH7MFP</name>
              <description>PH.7 Multi-function Pin Selection\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>SYS_GPH_MFP2</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SYS_GPH_MFP2</displayName>
          <description>GPIOH Multiple Function Control Register 2</description>
          <addressOffset>0x378</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PH8MFP</name>
              <description>PH.8 Multi-function Pin Selection\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PH9MFP</name>
              <description>PH.9 Multi-function Pin Selection\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PH10MFP</name>
              <description>PH.10 Multi-function Pin Selection\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PH11MFP</name>
              <description>PH.11 Multi-function Pin Selection\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>SYS_GPH_MFP3</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SYS_GPH_MFP3</displayName>
          <description>GPIOH Multiple Function Control Register 3</description>
          <addressOffset>0x37C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PH12MFP</name>
              <description>PH.12 Multi-function Pin Selection\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PH13MFP</name>
              <description>PH.13 Multi-function Pin Selection\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PH14MFP</name>
              <description>PH.14 Multi-function Pin Selection\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PH15MFP</name>
              <description>PH.15 Multi-function Pin Selection\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>SYS_GPI_MFP1</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SYS_GPI_MFP1</displayName>
          <description>GPIOI Multiple Function Control Register 1</description>
          <addressOffset>0x384</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PI6MFP</name>
              <description>PI.6 Multi-function Pin Selection\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PI7MFP</name>
              <description>PI.7 Multi-function Pin Selection\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>SYS_GPI_MFP2</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SYS_GPI_MFP2</displayName>
          <description>GPIOI Multiple Function Control Register 2</description>
          <addressOffset>0x388</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PI8MFP</name>
              <description>PI.8 Multi-function Pin Selection\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PI9MFP</name>
              <description>PI.9 Multi-function Pin Selection\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PI10MFP</name>
              <description>PI.10 Multi-function Pin Selection\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PI11MFP</name>
              <description>PI.11 Multi-function Pin Selection\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>SYS_GPI_MFP3</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SYS_GPI_MFP3</displayName>
          <description>GPIOI Multiple Function Control Register 3</description>
          <addressOffset>0x38C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PI12MFP</name>
              <description>PI.12 Multi-function Pin Selection\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PI13MFP</name>
              <description>PI.13 Multi-function Pin Selection\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PI14MFP</name>
              <description>PI.14 Multi-function Pin Selection\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PI15MFP</name>
              <description>PI.15 Multi-function Pin Selection\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>SYS_GPJ_MFP0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SYS_GPJ_MFP0</displayName>
          <description>GPIOJ Multiple Function Control Register 0</description>
          <addressOffset>0x390</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PJ0MFP</name>
              <description>PJ.0 Multi-function Pin Selection\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PJ1MFP</name>
              <description>PJ.1 Multi-function Pin Selection\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PJ2MFP</name>
              <description>PJ.2 Multi-function Pin Selection\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PJ3MFP</name>
              <description>PJ.3 Multi-function Pin Selection\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>SYS_GPJ_MFP1</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SYS_GPJ_MFP1</displayName>
          <description>GPIOJ Multiple Function Control Register 1</description>
          <addressOffset>0x394</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PJ4MFP</name>
              <description>PJ.4 Multi-function Pin Selection\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PJ5MFP</name>
              <description>PJ.5 Multi-function Pin Selection\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PJ6MFP</name>
              <description>PJ.6 Multi-function Pin Selection\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PJ7MFP</name>
              <description>PJ.7 Multi-function Pin Selection\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>SYS_GPJ_MFP2</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SYS_GPJ_MFP2</displayName>
          <description>GPIOJ Multiple Function Control Register 2</description>
          <addressOffset>0x398</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PJ8MFP</name>
              <description>PJ.8 Multi-function Pin Selection\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PJ9MFP</name>
              <description>PJ.9 Multi-function Pin Selection\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PJ10MFP</name>
              <description>PJ.10 Multi-function Pin Selection\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PJ11MFP</name>
              <description>PJ.11 Multi-function Pin Selection\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>SYS_GPJ_MFP3</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SYS_GPJ_MFP3</displayName>
          <description>GPIOJ Multiple Function Control Register 3</description>
          <addressOffset>0x39C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PJ12MFP</name>
              <description>PJ.12 Multi-function Pin Selection\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PJ13MFP</name>
              <description>PJ.13 Multi-function Pin Selection\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
