wosayttn/sdk-bsp-numaker-m55m1/Debug/svd/M55M1.svd
       <register>
          <name>SYS_SRAMBFF</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SYS_SRAMBFF</displayName>
          <description>System SRAM BIST Finish Flag Register</description>
          <addressOffset>0xE94</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SR0BFF</name>
              <description>System SRAM 0 BIST Finish Flag (Read Only)\nNote 1: This bit will be clear to 0 when SR0BIST(SYS_SRAMBCTL[0]) set to 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>System SRAM 0 BIST is active</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>System SRAM 0 BIST test finish</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>SR1BFF</name>
              <description>System SRAM 1 BIST Finish Flag (Read Only)\nNote 1: This bit will be clear to 0 when SR1BIST(SYS_SRAMBCTL[1]) set to 0.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>System SRAM 1 BIST is active</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>System SRAM 1 BIST test finish</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>SR2BFF</name>
              <description>System SRAM 2 BIST Finish Flag (Read Only)\nNote 1: This bit will be clear to 0 when SR2BIST(SYS_SRAMBCTL[2]) set to 0.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>System SRAM 2 BIST is active</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>System SRAM 2 BIST test finish</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>SR3BFF</name>
              <description>System SRAM 3 BIST Finish Flag (Read Only)\nNote 1: This bit will be clear to 0 when SR3BIST(SYS_SRAMBCTL[3]) set to 0.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>System SRAM 3 BIST is active</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>System SRAM 3 BIST test finish</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>LPSRBFF</name>
              <description>Low Power System SRAM BIST Finish Flag (Read Only)\nNote 1: This bit will be clear to 0 when LPSRBIST(SYS_SRAMBCTL[4]) set to 0.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Low Power System SRAM BIST is active</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Low Power System SRAM BIST test finish</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>CAN0BFF</name>
              <description>CAN0 SRAM BIST Finish Flag (Read Only)\nNote 1: This bit will be clear to 0 when CAN0BIST(SYS_SRAMBCTL[8]) set to 0.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>CAN0 SRAM BIST is active</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>CAN0 SRAM BIST test finish</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>CAN1BFF</name>
              <description>CAN1 SRAM BIST Finish Flag (Read Only)\nNote 1: This bit will be clear to 0 when CAN1BIST(SYS_SRAMBCTL[9]) set to 0.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>CAN1 SRAM BIST is active</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>CAN1 SRAM BIST test finish</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>SPIM0BFF</name>
              <description>SPIM0 SRAM BIST Finish Flag (Read Only)\nNote 1: This bit will be clear to 0 when SPIM0BIST(SYS_SRAMBCTL[10]) set to 0.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>SPIM0 SRAM BIST is active</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>SPIM0 SRAM BIST test finish</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>CCAPBFF</name>
              <description>CCAP SRAM BIST Finish Flag (Read Only)\nNote 1: This bit will be clear to 0 when CCAPBIST(SYS_SRAMBCTL[12]) set to 0.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>CCAP SRAM BIST is active</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>CCAP SRAM BIST test finish</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>I3CBFF</name>
              <description>I3C SRAM BIST Finish Flag (Read Only)\nNote 1: This bit will be clear to 0 when I3CBIST(SYS_SRAMBCTL[13]) set to 0.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>I3C SRAM BIST is active</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>I3C SRAM BIST test finish</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>KSBFF</name>
              <description>KS SRAM BIST Finish Flag (Read Only)\nNote 1: This bit will be clear to 0 when KSBIST(SYS_SRAMBCTL[14]) set to 0.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>KS SRAM BIST is active</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>KS SRAM BIST test finish</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>RSABFF</name>
              <description>RSA SRAM BIST Finish Flag (Read Only)\nNote 1: This bit will be clear to 0 when RSABIST(SYS_SRAMBCTL[15]) set to 0.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>RSA SRAM BIST is active</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>RSA SRAM BIST test finish</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>DMICBFF</name>
              <description>DMIC SRAM BIST Finish Flag (Read Only)\nNote 1: This bit will be clear to 0 when DMICBIST(SYS_SRAMBCTL[16]) set to 0.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>DMIC SRAM BIST is active</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>DMIC SRAM BIST test finish</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>EMACBFF</name>
              <description>EMAC SRAM BIST Finish Flag (Read Only)\nNote 1: This bit will be clear to 0 when EMACBIST(SYS_SRAMBCTL[17]) set to 0.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>EMAC SRAM BIST is active</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>EMAC SRAM BIST test finish</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>NPUBFF</name>
              <description>NPU SRAM BIST Finish Flag (Read Only)\nNote 1: This bit will be clear to 0 when NPUBIST(SYS_SRAMBCTL[18]) set to 0.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>NPU SRAM BIST is active</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>NPU SRAM BIST test finish</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>USBDBFF</name>
              <description>USBD SRAM BIST Finish Flag (Read Only)\nNote 1: This bit will be clear to 0 when USBDBIST(SYS_SRAMBCTL[24]) set to 0.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>USBD SRAM BIST is active</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>USBD SRAM BIST test finish</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>HSUSBDBFF</name>
              <description>HSUSBD SRAM BIST Finish Flag (Read Only)\nNote 1: This bit will be clear to 0 when HSUSBDBIST(SYS_SRAMBCTL[25]) set to 0.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>HSUSBD SRAM BIST is active</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>HSUSBD SRAM BIST test finish</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>HSUSBHBFF</name>
              <description>HSUSBH SRAM BIST Finish Flag (Read Only)\nNote 1: This bit will be clear to 0 when HSUSBHBIST(SYS_SRAMBCTL[26]) set to 0.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>HSUSBH SRAM BIST is active</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>HSUSBH SRAM BIST test finish</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
          </fields>
       </register>
