wosayttn/sdk-bsp-numaker-m55m1/Debug/svd/M55M1.svd
       <register>
          <name>CLK_APLL0CTL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CLK_APLL0CTL</displayName>
          <description>APLL0 Control Register</description>
          <addressOffset>0x18</addressOffset>
          <access>read-write</access>
          <resetValue>0x80008422</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FBDIV</name>
              <description>APLL0 Feedback Divider Control (Write Protect)\nRefer to the formulas below the table.\nNote 1: These bits are write protected. Refer to the SYS_REGLCTL register.\nNote 2: These bits are not retained when D2 power is turned off.\nNote 3: These bits are write ignore when APLL0EN(CLK_SRCCTL[6]) is set to enable.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INDIV</name>
              <description>APLL0 Input Divider Control (Write Protect)\nRefer to the formulas below the table.\nNote 1: These bits are write protected. Refer to the SYS_REGLCTL register.\nNote 2: These bits are not retained when D2 power is turned off.\nNote 3: These bits are write ignore when APLL0EN(CLK_SRCCTL[6]) is set to enable.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTDIV</name>
              <description>APLL0 Output Divider Control (Write Protect)\nRefer to the formulas below the table.\nNote 1: These bits are write protected. Refer to the SYS_REGLCTL register.\nNote 2: These bits are not retained when D2 power is turned off.\nNote 3: These bits are write ignore when APLL0EN(CLK_SRCCTL[6]) is set to enable.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FRDIV</name>
              <description>APLL0 Fractional Divider Control (Write Protect)\nRefer to the formulas below the table.\nNote 1: These bits are write protected. Refer to the SYS_REGLCTL register.\nNote 2: These bits are not retained when D2 power is turned off.\nNote 3: These bits are write ignore when APLL0EN(CLK_SRCCTL[6]) is set to enable.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBSEL</name>
              <description>APLL0 Stable Counter Selection (Write Protect)\nNote 1: These bits are write protected. Refer to the SYS_REGLCTL register.\nNote 2: These bits are not retained when D2 power is turned off.\nNote 3: These bits are write ignore when APLL0EN(CLK_SRCCTL[6]) is set to enable.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>APLL0 stable time is 820 APLL0 source clock (source clock is equal to 4M)</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>APLL0 stable time is 2460 APLL0 source clock (4 MHz  source clock &#8804;12 MHz)</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>APLL0 stable time is 4920 APLL0 source clock (12 MHz  source clock &#8804;24 MHz)</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Reserved.</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>BP</name>
              <description>APLL0 Bypass Control (Write Protect)\nNote 1: This bit is write protected. Refer to the SYS_REGLCTL register.\nNote 2: This bit is not retained when D2 power is turned off.\nNote 3: This bit is write ignore when APLL0EN(CLK_SRCCTL[6]) is set to enable.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>APLL0 is in normal mode (default)</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>APLL0 clock output is same as APLL0 input clock FIN</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>PLLFEN</name>
              <description>APLL0 Clock Filter Enable Bit\nNote 1: This bit is write protected. Refer to the SYS_REGLCTL register.\nNote 2: This bit is not retained when D2 power is turned off.\nNote 3: This bit is write ignore when APLL0EN(CLK_SRCCTL[6]) is set to enable.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>APLL0 Filter Disable</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>APLL0 Filter Enable</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CLK_APLL0SEL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CLK_APLL0SEL</displayName>
          <description>APLL0 Clock Source Select Control Register</description>
          <addressOffset>0x1C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>APLLSRC</name>
              <description>APLL0 Source Clock Selection (Write Protect)\nNote 1: These bits are write protected. Refer to the SYS_REGLCTL register.\nNote 2: These bits are not retained when D2 power is turned off.\nNote 3: These bits are write ignore when APLL0EN(CLK_SRCCTL[6]) is set to enable.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>APLL0 source clock from 4~24 MHz external high-speed crystal oscillator (HXT)</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>APLL0 source clock from 24~32 MHz external high-speed crystal oscillator (HXT/2)</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>APLL0 source clock from 12 MHz internal high-speed oscillator (HIRC)</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>APLL0 source clock from 48 MHz internal high-speed oscillator (HIRC48M/4)</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CLK_APLL1CTL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CLK_APLL1CTL</displayName>
          <description>APLL1 Control Register</description>
          <addressOffset>0x20</addressOffset>
          <access>read-write</access>
          <resetValue>0x80008422</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FBDIV</name>
              <description>APLL1 Feedback Divider Control (Write Protect)\nRefer to the formulas below the table.\nNote 1: These bits are write protected. Refer to the SYS_REGLCTL register.\nNote 2: These bits are not retained when D2 power is turned off.\nNote 3: These bits are write ignore when APLL1EN(CLK_SRCCTL[7]) is set to enable.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INDIV</name>
              <description>APLL1 Input Divider Control (Write Protect)\nRefer to the formulas below the table.\nNote 1: These bits are write protected. Refer to the SYS_REGLCTL register.\nNote 2: These bits are not retained when D2 power is turned off.\nNote 3: These bits are write ignore when APLL1EN(CLK_SRCCTL[7]) is set to enable.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTDIV</name>
              <description>APLL1 Output Divider Control (Write Protect)\nRefer to the formulas below the table.\nNote 1: These bits are write protected. Refer to the SYS_REGLCTL register.\nNote 2: These bits are not retained when D2 power is turned off.\nNote 3: These bits are write ignore when APLL1EN(CLK_SRCCTL[7]) is set to enable.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FRDIV</name>
              <description>APLL1 Fractional Divider Control (Write Protect)\nRefer to the formulas below the table.\nNote 1: These bits are write protected. Refer to the SYS_REGLCTL register.\nNote 2: These bits are not retained when D2 power is turned off.\nNote 3: These bits are write ignore when APLL1EN(CLK_SRCCTL[7]) is set to enable.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBSEL</name>
              <description>APLL1 Stable Counter Selection (Write Protect)\nNote 1: These bits are write protected. Refer to the SYS_REGLCTL register.\nNote 2: These bits are not retained when D2 power is turned off.\nNote 3: These bits are write ignore when APLL1EN(CLK_SRCCTL[7]) is set to enable.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>APLL1 stable time is 820 APLL1 source clock (source clock is equal to 4M)</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>APLL1 stable time is 2460 APLL1 source clock (4 MHz  source clock &#8804;12 MHz)</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>APLL1 stable time is 4920 APLL1 source clock (12 MHz  source clock &#8804;24 MHz)</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Reserved.</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>BP</name>
              <description>APLL1 Bypass Control (Write Protect)\nNote 1: This bit is write protected. Refer to the SYS_REGLCTL register.\nNote 2: This bit is not retained when D2 power is turned off.\nNote 3: This bit is write ignore when APLL1EN(CLK_SRCCTL[7]) is set to enable.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>APLL1 is in normal mode (default)</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>APLL1 clock output is same as APLL1 input clock FIN</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>PLLFEN</name>
              <description>APLL1 Clock Filter Enable Bit\nNote 1: This bit is write protected. Refer to the SYS_REGLCTL register.\nNote 2: This bit is not retained when D2 power is turned off.\nNote 3: This bit is write ignore when APLL1EN(CLK_SRCCTL[7]) is set to enable.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>APLL1 Filter Disable</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>APLL1 Filter Enable</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CLK_APLL1SEL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CLK_APLL1SEL</displayName>
          <description>APLL1 Clock Source Select Control Register</description>
          <addressOffset>0x24</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>APLLSRC</name>
              <description>APLL1 Source Clock Selection (Write Protect)\nNote 1: These bits are write protected. Refer to the SYS_REGLCTL register.\nNote 2: These bits are not retained when D2 power is turned off.\nNote 3: These bits are write ignore when APLL1EN(CLK_SRCCTL[7]) is set to enable.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>APLL1 source clock from 4~24 MHz external high-speed crystal oscillator (HXT)</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>APLL1 source clock from 24~32 MHz external high-speed crystal oscillator (HXT/2)</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>APLL1 source clock from 12 MHz internal high-speed oscillator (HIRC)</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>APLL1 source clock from 48 MHz internal high-speed oscillator (HIRC48M/4)</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CLK_CLKOCTL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CLK_CLKOCTL</displayName>
          <description>Clock Output Control Register</description>
          <addressOffset>0x28</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FREQSEL</name>
              <description>Clock Output Frequency Selection\nThe formula of output frequency is\nFin is the input clock frequency.\nFout is the frequency of divider output clock.\nN is the 4-bit value of FREQSEL[3:0].\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLKOEN</name>
              <description>Clock Output Enable Bit\nNote: This bit is not retained when D2 power is turned off.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Clock Output function Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Clock Output function Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>DIV1EN</name>
              <description>Clock Output Divide One Enable Bit\nNote: This bit is not retained when D2 power is turned off.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Clock Output will output clock with source frequency divided by FREQSEL</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Clock Output will output clock with source frequency</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK1HZEN</name>
              <description>Clock Output 1Hz Enable Bit\nNote: This bit is not retained when D2 power is turned off.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>1 Hz clock output for 32.768 kHz frequency compensation Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>1 Hz clock output for 32.768 kHz frequency compensation Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
