wosayttn/sdk-bsp-numaker-m55m1/Debug/svd/M55M1.svd
       <register>
          <name>CLK_WWDTSEL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CLK_WWDTSEL</displayName>
          <description>WWDT Clock Source Select Control Register</description>
          <addressOffset>0x47C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WWDT0SEL</name>
              <description>WWDT0 Clock Source Selection (Write Protect)\nNote 1: This bit is write protected. Refer to the SYS_REGLCTL register.\nNote 2: This bit is not retained when D0 power is turned off.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Clock source from LIRC</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Clock source from LXT</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>WWDT1SEL</name>
              <description>WWDT1 Clock Source Selection (Write Protect)\nNote 1: This bit is write protected. Refer to the SYS_REGLCTL register.\nNote 2: This bit is not retained when D0 power is turned off.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Clock source from LIRC</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Clock source from LXT</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CLK_SCLKDIV</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CLK_SCLKDIV</displayName>
          <description>SCLK Clock Divider Control Register</description>
          <addressOffset>0x500</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SCLKDIV</name>
              <description>SCLK Clock Divide Number from SCLK Clock Source\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CLK_HCLKDIV</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CLK_HCLKDIV</displayName>
          <description>HCLK Clock Divider Control Register</description>
          <addressOffset>0x508</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HCLK2DIV</name>
              <description>HCLK2 Clock Divide Number from HCLK2 Clock Source\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CLK_PCLKDIV</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CLK_PCLKDIV</displayName>
          <description>PCLK Clock Divider Control Register</description>
          <addressOffset>0x50C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PCLK0DIV</name>
              <description>PCLK0 Clock Divide Number from PCLK0 Clock Source\nNote: These bits are not retained when D1 power is turned off.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PCLK1DIV</name>
              <description>PCLK1 Clock Divide Number from PCLK1 Clock Source\nNote: These bits are not retained when D1 power is turned off.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PCLK2DIV</name>
              <description>PCLK2 Clock Divide Number from PCLK2 Clock Source\nNote: These bits are not retained when D1 power is turned off.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PCLK3DIV</name>
              <description>PCLK3 Clock Divide Number from PCLK3 Clock Source\nNote: These bits are not retained when D1 power is turned off.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PCLK4DIV</name>
              <description>PCLK4 Clock Divide Number from PCLK4 Clock Source\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CLK_CANFDDIV</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CLK_CANFDDIV</displayName>
          <description>CANFD Clock Divider Control Register</description>
          <addressOffset>0x510</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CANFD0DIV</name>
              <description>CANFD0 Clock Divide Number from CANFD0 Clock Source\nNote: These bits are not retained when D1 power is turned off.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CANFD1DIV</name>
              <description>CANFD1 Clock Divide Number from CANFD1 Clock Source\nNote: These bits are not retained when D1 power is turned off.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CLK_DMICDIV</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CLK_DMICDIV</displayName>
          <description>DMIC Clock Divider Control Register</description>
          <addressOffset>0x514</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DMIC0DIV</name>
              <description>DMIC0 Clock Divide Number from DMIC0 Clock Source\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CLK_EADCDIV</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CLK_EADCDIV</displayName>
          <description>EADC Clock Divider Control Register</description>
          <addressOffset>0x518</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EADC0DIV</name>
              <description>EADC0 Clock Divide Number from EADC0 Clock Source\nNote: These bits are not retained when D1 power is turned off.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CLK_I2SDIV</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CLK_I2SDIV</displayName>
          <description>I2S Clock Divider Control Register</description>
          <addressOffset>0x51C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>I2S0DIV</name>
              <description>I2S0 Clock Divide Number from I2S0 Clock Source\nNote: These bits are not retained when D1 power is turned off.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2S1DIV</name>
              <description>I2S1 Clock Divide Number from I2S1 Clock Source\nNote: These bits are not retained when D1 power is turned off.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CLK_KPIDIV</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CLK_KPIDIV</displayName>
          <description>KPI Clock Divider Control Register</description>
          <addressOffset>0x520</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>KPI0DIV</name>
              <description>KPI0 Clock Divide Number from KPI0 Clock Source\nNote: These bits are not retained when D1 power is turned off.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CLK_LPADCDIV</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CLK_LPADCDIV</displayName>
          <description>Low Power ADC Clock Divider Control Register</description>
          <addressOffset>0x524</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LPADC0DIV</name>
              <description>LPADC0 Clock Divide Number from LPADC0 Clock Source\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CLK_LPUARTDIV</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CLK_LPUARTDIV</displayName>
          <description>Low Power UART Clock Divider Control Register</description>
          <addressOffset>0x528</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LPUART0DIV</name>
              <description>LPUART0 Clock Divide Number from LPUART0 Clock Source\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CLK_PSIODIV</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CLK_PSIODIV</displayName>
          <description>PSIO Clock Divider Control Register</description>
          <addressOffset>0x52C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PSIO0DIV</name>
              <description>PSIO0 Clock Divide Number from PSIO0 Clock Source\nNote: These bits are not retained when D1 power is turned off.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CLK_SCDIV</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CLK_SCDIV</displayName>
          <description>SC Clock Divider Control Register</description>
          <addressOffset>0x530</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SC0DIV</name>
              <description>SC0 Clock Divide Number from SC0 Clock Source\nNote: These bits are not retained when D1 power is turned off.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SC1DIV</name>
              <description>SC1 Clock Divide Number from SC1 Clock Source\nNote: These bits are not retained when D1 power is turned off.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SC2DIV</name>
              <description>SC2 Clock Divide Number from SC2 Clock Source\nNote: These bits are not retained when D1 power is turned off.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CLK_SDHDIV</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CLK_SDHDIV</displayName>
          <description>SDH Clock Divider Control Register</description>
          <addressOffset>0x534</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SDH0DIV</name>
              <description>SDH0 Clock Divide Number from SDH0 Clock Source\nNote: These bits are not retained when D1 power is turned off.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SDH1DIV</name>
              <description>SDH1 Clock Divide Number from SDH1 Clock Source\nNote: These bits are not retained when D1 power is turned off.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CLK_STDIV</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CLK_STDIV</displayName>
          <description>System Tick Clock Divider Control Register</description>
          <addressOffset>0x538</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ST0DIV</name>
              <description>System Tick 0 Clock Divide Number from System Tick 0 Clock Source\nNote: These bits are not retained when D0 power is turned off.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CLK_UARTDIV0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CLK_UARTDIV0</displayName>
          <description>UART Clock Divider Control Register 0</description>
          <addressOffset>0x53C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>UART0DIV</name>
              <description>UART0 Clock Divide Number from UART0 Clock Source\nNote: These bits are not retained when D1 power is turned off.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UART1DIV</name>
              <description>UART1 Clock Divide Number from UART1 Clock Source\nNote: These bits are not retained when D1 power is turned off.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UART2DIV</name>
              <description>UART2 Clock Divide Number from UART2 Clock Source\nNote: These bits are not retained when D1 power is turned off.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UART3DIV</name>
              <description>UART3 Clock Divide Number from UART3 Clock Source\nNote: These bits are not retained when D1 power is turned off.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UART4DIV</name>
              <description>UART4 Clock Divide Number from UART4 Clock Source\nNote: These bits are not retained when D1 power is turned off.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UART5DIV</name>
              <description>UART5 Clock Divide Number from UART5 Clock Source\nNote: These bits are not retained when D1 power is turned off.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UART6DIV</name>
              <description>UART6 Clock Divide Number from UART6 Clock Source\nNote: These bits are not retained when D1 power is turned off.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UART7DIV</name>
              <description>UART7 Clock Divide Number from UART7 Clock Source\nNote: These bits are not retained when D1 power is turned off.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CLK_UARTDIV1</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CLK_UARTDIV1</displayName>
          <description>UART Clock Divider Control Register 1</description>
          <addressOffset>0x540</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>UART8DIV</name>
              <description>UART8 Clock Divide Number from UART8 Clock Source\nNote: These bits are not retained when D1 power is turned off.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UART9DIV</name>
              <description>UART9 Clock Divide Number from UART9 Clock Source\nNote: These bits are not retained when D1 power is turned off.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CLK_USBDIV</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CLK_USBDIV</displayName>
          <description>USB Clock Divider Control Register</description>
          <addressOffset>0x544</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USBDIV</name>
              <description>USB Clock Divide Number from USB Clock Source\nNote: These bits are not retained when D1 power is turned off.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CLK_VSENSEDIV</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CLK_VSENSEDIV</displayName>
          <description>Video Pixel Clock Divider Control Register</description>
          <addressOffset>0x548</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VSENSEDIV</name>
              <description>Video Pixel Clock Divide Number from Video Pixel Clock Source\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
