wosayttn/sdk-bsp-numaker-m55m1/Debug/svd/M55M1.svd
       <register>
          <name>DPM_NSCTL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>DPM_NSCTL</displayName>
          <description>Non-secure DPM Control Register</description>
          <addressOffset>0x50</addressOffset>
          <access>read-write</access>
          <resetValue>0xA5000000</resetValue>
          <resetMask>0xFFFFFFF0</resetMask>
          <fields>
            <field>
              <name>DBGDIS</name>
              <description>Set Non-secure DPM Debug Disable Bit\nWhen this bit is read as 0, it can be written to 1 to configure the Non-secure DPM DBGDIS bit (DBGDISNS).\nWhen written:\nNote: This bit can be set to 1 but cannot be cleared to 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No operation</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Trigger the process to set DBGDISNS configuration bit</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCK</name>
              <description>Set Non-secure DPM Debug Lock Bit\nWhen this bit is read as 0, it can be written to 1 to configure the Non-secure DPM LOCK bit (LOCKNS).\nWhen written:\nNote: This bit can be set to 1 but cannot be cleared to 0.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No operation</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Trigger the process to set LOCKNS configuration bit</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>PWCMP</name>
              <description>Non-secure DPM Password Compare Bit\nSet to enter the process of compare Non-secure DPM password.\nNote: This bit will be cleared after the comparison process is finished.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No operation</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Compare Non-secure DPM password</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>PWUPD</name>
              <description>Non-secure DPM Password Update Bit\nSet to enter the process of updating Non-secure DPM password.\nNote 1: This bit should be set with PWCMP equal to 0.\nNote 2: This bit will be cleared after the update process is finished.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No operation</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Update Non-secure DPM password</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>DACCWDIS</name>
              <description>Debug Write Access Disable Bit\nThis bit disables the ability of external debugger to set Non-secure DPM registers for debug authentication. </description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>External debugger can set Non-secure DPM registers</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>External debugger cannot set Non-secure DPM registers</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>RWVCODE</name>
              <description>Write Verify Code and Read Verify Code\nRead operation:</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>90</name>
                    <description>The write verify code, 0x5A, is needed to do a valid write to DPM_NSCTL</description>
                    <value>0x5a</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>165</name>
                    <description>The read access for DPM_NSCTL is correct</description>
                    <value>0xa5</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>DPM_NSSTS</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>DPM_NSSTS</displayName>
          <description>Non-secure DPM Status Register</description>
          <addressOffset>0x54</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFF0F0FF</resetMask>
          <fields>
            <field>
              <name>BUSY</name>
              <description>DPM Busy Flag (Read Only)\nThis bit indicates the DPM is busy.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>DPM is not busy and writing to any register is accepted</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>DPM is busy and other bits in DPM_NSSTS register are not valid and writing to any register is ignored</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>PWCERR</name>
              <description>Non-secure DPM Password Compared Error Flag\nThis bit indicates the result of Non-secure DPM password comparison.\nNote: This flag is write-one-clear.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>The result of Non-secure DPM password is correct</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The result of Non-secure DPM password is incorrect</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>PWUOK</name>
              <description>Non-secure DPM Password Updated Flag\nThis bit indicates Non-secure DPM password has been updated correctly.\nWhen read:\nNote: This flag is write-one-clear.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No successful updating process has happened</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>There is at least one successful updating process since last clearing of this bit</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>PWFMAX</name>
              <description>Non-secure DPM Password Fail Times Maximum Reached Flag (Read Only)\nThis bit indicates if the fail times of comparing Non-secure DPM password reached max times.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Max time has not reached and Non-secure DPM password comparison can be triggered</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Max time reached and Non-secure DPM password comparison cannot be processed anymore</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>PWUCNT</name>
              <description>Non-secure DPM Password Updated Times (Read Only)\nThis bit indicates how many times of non-secure password has been updated.\nThe max value is 7. If PWUCNT reached the max value, Non-secure DPM password cannot be updated anymore.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DBGDIS</name>
              <description>Non-secure Debug Disable Flag (Read Only)\nThis bit indicates the current value of DBGDISNS bit.\n{PWOK, LOCK, DBGDIS} bits define the current state of DPM.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>DEFAULT state.\nLOCKED state</description>
                    <value>#000</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>CLOSE state</description>
                    <value>#001</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>5</name>
                    <description>OPEN state</description>
                    <value>#101</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>LOCK</name>
              <description>Non-secure Debug Lock Flag (Read Only)\nThis bit indicates the current value of LOCKNS bit.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PWOK</name>
              <description>Non-secure Password OK Flag (Read Only)\nThis bit indicates the Non-secure DPM password has been checked and is correct.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>The Non-secure DPM password has not been checked pass, yet</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The Non-secure DPM password has been checked pass since last cold reset</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>DPM_NSPW0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>DPM_NSPW0</displayName>
          <description>Non-secure DPM Password 0</description>
          <addressOffset>0x60</addressOffset>
          <access>write-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PW</name>
              <description>Password\nWrite password[31:0] to this register to update or compare Non-secure DPM password. It is write-only and always read as 0xFFFFFFFF.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>DPM_NSPW1</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>DPM_NSPW1</displayName>
          <description>Non-secure DPM Password 1</description>
          <addressOffset>0x64</addressOffset>
          <access>write-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PW</name>
              <description>Password\nWrite password[63:32] to this register to update or compare Non-secure DPM password. It is write-only and always read as 0xFFFFFFFF.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>DPM_NSPW2</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>DPM_NSPW2</displayName>
          <description>Non-secure DPM Password 2</description>
          <addressOffset>0x68</addressOffset>
          <access>write-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PW</name>
              <description>Password\nWrite password[95:64] to this register to update or compare Non-secure DPM password. It is write-only and always read as 0xFFFFFFFF.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>DPM_NSPW3</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>DPM_NSPW3</displayName>
          <description>Non-secure DPM Password 3</description>
          <addressOffset>0x6C</addressOffset>
          <access>write-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PW</name>
              <description>Password\nWrite password[127:96] to this register to update or compare Non-secure DPM password. It is write-only and always read as 0xFFFFFFFF.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
       </register>
