wosayttn/sdk-bsp-numaker-m55m1/Debug/svd/M55M1.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>FVC</name>
      <description>SCU Register Map</description>
      <groupName>SCU</groupName>
      <baseAddress>0x40402500</baseAddress>
      <!-- d -> no access permission -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x8</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x10</offset>
        <size>0x8</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x20</offset>
        <size>0x8</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
       <register>
          <name>FVC_CTL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>FVC_CTL</displayName>
          <description>FVC Control Register</description>
          <addressOffset>0x0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFF0</resetMask>
          <fields>
            <field>
              <name>INIT</name>
              <description>FVC Init Bit\nSet to 1 to enable FVC\nThis bit is writable when FVC is at Reset state.\nNote: After set to 1, this bit is cleared to 0 automatically when FVC is back to Reset state.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MONOEN</name>
              <description>Monotonic Enable Bit\nSet to 1 to enable the monotonic mechanism of FVC.\nNote: This bit can be set to1 but cannot be cleared to 0.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WVCODE</name>
              <description>Verification Code\nWhen written, this field must be 0x7710</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>FVC_STS</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>FVC_STS</displayName>
          <description>FVC Status Register</description>
          <addressOffset>0x4</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFF0</resetMask>
          <fields>
            <field>
              <name>BUSY</name>
              <description>FVC Busy Bit\nIndicates the FVC is at busy state.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RDY</name>
              <description>FVC Ready Bit\nIndicates the FVC is ready after the initial process.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>FVC_NVC0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>FVC_NVC0</displayName>
          <description>Non-volatile Version Counter Control Register0</description>
          <addressOffset>0x10</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFF0000</resetMask>
          <fields>
            <field>
              <name>FWVER</name>
              <description>Firmware Version\nRead: Indicates the current firmware version of NVC0.\nWrite: Updates the firmware version of NVC0.\nThe maximum value of this field is 63.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WVCODE</name>
              <description>Verification Code\nWhen written, this field must be the current firmware version number of NVC0</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>FVC_NVC1</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>FVC_NVC1</displayName>
          <description>Non-volatile Version Counter Control Register1</description>
          <addressOffset>0x14</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFF0000</resetMask>
          <fields>
            <field>
              <name>FWVER</name>
              <description>Firmware Version\nRead: Indicates the current firmware version of NVC1.\nWrite: Updates the firmware version of NVC1.\nThe maximum value of this field is 63.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WVCODE</name>
              <description>Verification Code\nWhen written, this field must be the current firmware version number of NVC1</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>FVC_NVC4</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>FVC_NVC4</displayName>
          <description>Non-volatile Version Counter Control Register4</description>
          <addressOffset>0x20</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFF0000</resetMask>
          <fields>
            <field>
              <name>FWVER</name>
              <description>Firmware Version\nRead: Indicates the current firmware version of NVC4.\nWrite: Updates the firmware version of NVC4.\nThe maximum value of this field is 255.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WVCODE</name>
              <description>Verification Code\nWhen written, this field must be the current firmware version number of NVC4</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>FVC_NVC5</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>FVC_NVC5</displayName>
          <description>Non-volatile Version Counter Control Register5</description>
          <addressOffset>0x24</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFF0000</resetMask>
          <fields>
            <field>
              <name>FWVER</name>
              <description>Firmware Version\nRead: Indicates the current firmware version of NVC5.\nWrite: Updates the firmware version of NVC5.\nThe maximum value of this field is 255.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WVCODE</name>
              <description>Verification Code\nWhen written, this field must be the current firmware version number of NVC5</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
