wosayttn/sdk-bsp-numaker-m55m1/Debug/svd/M55M1.svd
       <register>
          <name>SCU_SVINTSTS1</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SCU_SVINTSTS1</displayName>
          <description>Security Violation Interrupt Status Register - Master peripherals (MSC)</description>
          <addressOffset>0x114</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GDMAIF</name>
              <description>GDMA Security Violation Interrupt Status\nNote: Write 1 to clear the interrupt flag.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No GDMA violation interrupt event</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>There is at least a GDMA violation interrupt event</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>PDMA0IF</name>
              <description>PDMA0 Security Violation Interrupt Status\nNote: Write 1 to clear the interrupt flag.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No PDMA0 violation interrupt event</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>There is at least a PDMA0 violation interrupt event</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>PDMA1IF</name>
              <description>PDMA1 Security Violation Interrupt Status\nNote: Write 1 to clear the interrupt flag.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No PDMA1 violation interrupt event</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>There is at least a PDMA1 violation interrupt event</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>USBH0IF</name>
              <description>USBH0 Security Violation Interrupt Status\nNote: Write 1 to clear the interrupt flag.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No USBH0 violation interrupt event</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>There is at least a USBH0 violation interrupt event</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>HSUSBHIF</name>
              <description>HSUSBH Security Violation Interrupt Status\nNote: Write 1 to clear the interrupt flag.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No HSUSBH violation interrupt event</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>There is at least a HSUSBH violation interrupt event</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>HSUSBDIF</name>
              <description>HSUSBD Security Violation Interrupt Status\nNote: Write 1 to clear the interrupt flag.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No HSUSBD violation interrupt event</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>There is at least a HSUSBD violation interrupt event</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SDH0IF</name>
              <description>SDH0 Security Violation Interrupt Status\nNote: Write 1 to clear the interrupt flag.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No SDH0 violation interrupt event</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>There is at least a SDH0 violation interrupt event</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SDH1IF</name>
              <description>SDH1 Security Violation Interrupt Status\nNote: Write 1 to clear the interrupt flag.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No SDH1 violation interrupt event</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>There is at least a SDH1 violation interrupt event</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>EMACIF</name>
              <description>EMAC Security Violation Interrupt Status\nNote: Write 1 to clear the interrupt flag.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No EMAC violation interrupt event</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>There is at least a EMAC violation interrupt event</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>CRYPTOIF</name>
              <description>CRYPTO Security Violation Interrupt Status\nNote: Write 1 to clear the interrupt flag.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No CRYPTO violation interrupt event</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>There is at least a CRYPTO violation interrupt event</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>CRCIF</name>
              <description>CRC Security Violation Interrupt Status\nNote: Write 1 to clear the interrupt flag.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No CRC violation interrupt event</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>There is at least a CRC violation interrupt event</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>LPDMAIF</name>
              <description>LPDMA Security Violation Interrupt Status\nNote: Write 1 to clear the interrupt flag.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No LPDMA violation interrupt event</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>There is at least a LPDMA violation interrupt event</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>CCAPIF</name>
              <description>CCAP Security Violation Interrupt Status\nNote: Write 1 to clear the interrupt flag.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No CCAP violation interrupt event</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>There is at least a CCAP violation interrupt event</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>NPUIF1</name>
              <description>NPU Interface 1 Security Violation Interrupt Status\nNote: Write 1 to clear the interrupt flag.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No NPU Interface 1 violation interrupt event</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>There is at least a NPU Interface 1 violation interrupt event</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>NPUIF0</name>
              <description>NPU Interface 0 Security Violation Interrupt Status\nNote: Write 1 to clear the interrupt flag.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No NPU Interface 0 violation interrupt event</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>There is at least a NPU Interface 0 violation interrupt event</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SPIM0IF</name>
              <description>SPIM0 Security Violation Interrupt Status\nNote: Write 1 to clear the interrupt flag.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No SPIM0 violation interrupt event</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>There is at least a SPIM0 violation interrupt event</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>SCU_SVINTSTS2</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SCU_SVINTSTS2</displayName>
          <description>Security Violation Interrupt Status Register - Memory peripherals (MPC)</description>
          <addressOffset>0x118</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SRAM0IF</name>
              <description>SRAM0 Security Violation Interrupt Status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No SRAM0 violation interrupt event</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>There is at least a SRAM0 violation interrupt event</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>SRAM1IF</name>
              <description>SRAM1 Security Violation Interrupt Status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No SRAM1 violation interrupt event</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>There is at least a SRAM1 violation interrupt event</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>SRAM2IF</name>
              <description>SRAM2 Security Violation Interrupt Status</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No SRAM2 violation interrupt event</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>There is at least a SRAM2 violation interrupt event</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>SRAM3IF</name>
              <description>SRAM3 Security Violation Interrupt Status</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No SRAM3 violation interrupt event</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>There is at least a SRAM3 violation interrupt event</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>LPSRAMIF</name>
              <description>LPSRAM Security Violation Interrupt Status</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No LPSRAM violation interrupt event</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>There is at least a LPSRAM violation interrupt event</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>SPIM0IF</name>
              <description>SPIM0 Security Violation Interrupt Status</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No SPIM0 violation interrupt event</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>There is at least a SPIM0 violation interrupt event</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>SCU_APB0PVSRC</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SCU_APB0PVSRC</displayName>
          <description>APB0 Security Policy Violation Source</description>
          <addressOffset>0x120</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFF00</resetMask>
          <fields>
            <field>
              <name>MASTER</name>
              <description>Master Violating Security Policy\nIndicate which master invokes the security violation.\nOthers are undefined.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Core processor</description>
                    <value>0x00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>PDMA0</description>
                    <value>0x01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>PDMA1</description>
                    <value>0x02</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>USBH0</description>
                    <value>0x03</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>5</name>
                    <description>HSUSBH</description>
                    <value>0x05</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>6</name>
                    <description>HSUSBD</description>
                    <value>0x06</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>7</name>
                    <description>SDH0</description>
                    <value>0x07</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>8</name>
                    <description>SDH1</description>
                    <value>0x08</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>9</name>
                    <description>EMAC</description>
                    <value>0x09</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>10</name>
                    <description>CRYPTO</description>
                    <value>0x0a</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>11</name>
                    <description>CRC</description>
                    <value>0x0b</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>12</name>
                    <description>GDMA</description>
                    <value>0x0c</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>13</name>
                    <description>NPU</description>
                    <value>0x0d</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>14</name>
                    <description>LPDMA</description>
                    <value>0x0e</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>15</name>
                    <description>CCAP</description>
                    <value>0x0f</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>16</name>
                    <description>SPIM0</description>
                    <value>0x10</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
          </fields>
       </register>
