wosayttn/sdk-bsp-numaker-m55m1/Debug/svd/M55M1.svd
       <register derivedFrom="SCU_APB0PVSRC">
          <name>SCU_APB1PVSRC</name>
          <displayName>SCU_APB1PVSRC</displayName>
          <description>APB1 Security Policy Violation Source</description>
          <addressOffset>0x124</addressOffset>
       </register>
       <register derivedFrom="SCU_APB0PVSRC">
          <name>SCU_APB2PVSRC</name>
          <displayName>SCU_APB2PVSRC</displayName>
          <description>APB2 Security Policy Violation Source</description>
          <addressOffset>0x128</addressOffset>
       </register>
       <register derivedFrom="SCU_APB0PVSRC">
          <name>SCU_APB3PVSRC</name>
          <displayName>SCU_APB3PVSRC</displayName>
          <description>APB3 Security Policy Violation Source</description>
          <addressOffset>0x12C</addressOffset>
       </register>
       <register derivedFrom="SCU_APB0PVSRC">
          <name>SCU_APB4PVSRC</name>
          <displayName>SCU_APB4PVSRC</displayName>
          <description>APB4 Security Policy Violation Source</description>
          <addressOffset>0x130</addressOffset>
       </register>
       <register derivedFrom="SCU_APB0PVSRC">
          <name>SCU_APB5PVSRC</name>
          <displayName>SCU_APB5PVSRC</displayName>
          <description>APB5 Security Policy Violation Source</description>
          <addressOffset>0x134</addressOffset>
       </register>
       <register derivedFrom="SCU_APB0PVSRC">
          <name>SCU_D0PPC0PVSRC</name>
          <displayName>SCU_D0PPC0PVSRC</displayName>
          <description>D0PPC0 Security Policy Violation Source</description>
          <addressOffset>0x140</addressOffset>
       </register>
       <register derivedFrom="SCU_APB0PVSRC">
          <name>SCU_D1PPC0PVSRC</name>
          <displayName>SCU_D1PPC0PVSRC</displayName>
          <description>D1PPC0 Security Policy Violation Source</description>
          <addressOffset>0x144</addressOffset>
       </register>
       <register derivedFrom="SCU_APB0PVSRC">
          <name>SCU_D1PPC1PVSRC</name>
          <displayName>SCU_D1PPC1PVSRC</displayName>
          <description>D1PPC1 Security Policy Violation Source</description>
          <addressOffset>0x148</addressOffset>
       </register>
       <register derivedFrom="SCU_APB0PVSRC">
          <name>SCU_D2PPC0PVSRC</name>
          <displayName>SCU_D2PPC0PVSRC</displayName>
          <description>D2PPC0 Security Policy Violation Source</description>
          <addressOffset>0x14C</addressOffset>
       </register>
       <register derivedFrom="SCU_APB0PVSRC">
          <name>SCU_EBIPVSRC</name>
          <displayName>SCU_EBIPVSRC</displayName>
          <description>EBI Security Policy Violation Source</description>
          <addressOffset>0x160</addressOffset>
       </register>
       <register derivedFrom="SCU_APB0PVSRC">
          <name>SCU_FLASHPVSRC</name>
          <displayName>SCU_FLASHPVSRC</displayName>
          <description>FLASH Security Policy Violation Source</description>
          <addressOffset>0x164</addressOffset>
       </register>
       <register>
          <name>SCU_APB0PVA</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SCU_APB0PVA</displayName>
          <description>APB0 Violation Address</description>
          <addressOffset>0x1A0</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>VIOADDR</name>
              <description>Violation Address\nIndicate the target address of the access, which invokes the security violation.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="SCU_APB0PVA">
          <name>SCU_APB1PVA</name>
          <displayName>SCU_APB1PVA</displayName>
          <description>APB1 Violation Address</description>
          <addressOffset>0x1A4</addressOffset>
       </register>
       <register derivedFrom="SCU_APB0PVA">
          <name>SCU_APB2PVA</name>
          <displayName>SCU_APB2PVA</displayName>
          <description>APB2 Violation Address</description>
          <addressOffset>0x1A8</addressOffset>
       </register>
       <register derivedFrom="SCU_APB0PVA">
          <name>SCU_APB3PVA</name>
          <displayName>SCU_APB3PVA</displayName>
          <description>APB3 Violation Address</description>
          <addressOffset>0x1AC</addressOffset>
       </register>
       <register derivedFrom="SCU_APB0PVA">
          <name>SCU_APB4PVA</name>
          <displayName>SCU_APB4PVA</displayName>
          <description>APB4 Violation Address</description>
          <addressOffset>0x1B0</addressOffset>
       </register>
       <register derivedFrom="SCU_APB0PVA">
          <name>SCU_APB5PVA</name>
          <displayName>SCU_APB5PVA</displayName>
          <description>APB5 Violation Address</description>
          <addressOffset>0x1B4</addressOffset>
       </register>
       <register derivedFrom="SCU_APB0PVA">
          <name>SCU_D0PPC0PVA</name>
          <displayName>SCU_D0PPC0PVA</displayName>
          <description>D0PPC0 Violation Address</description>
          <addressOffset>0x1C0</addressOffset>
       </register>
       <register derivedFrom="SCU_APB0PVA">
          <name>SCU_D1PPC0PVA</name>
          <displayName>SCU_D1PPC0PVA</displayName>
          <description>D1PPC0 Violation Address</description>
          <addressOffset>0x1C4</addressOffset>
       </register>
       <register derivedFrom="SCU_APB0PVA">
          <name>SCU_D1PPC1PVA</name>
          <displayName>SCU_D1PPC1PVA</displayName>
          <description>D1PPC1 Violation Address</description>
          <addressOffset>0x1C8</addressOffset>
       </register>
       <register derivedFrom="SCU_APB0PVA">
          <name>SCU_D2PPC0PVA</name>
          <displayName>SCU_D2PPC0PVA</displayName>
          <description>D2PPC0 Violation Address</description>
          <addressOffset>0x1CC</addressOffset>
       </register>
       <register derivedFrom="SCU_APB0PVA">
          <name>SCU_EBIPVA</name>
          <displayName>SCU_EBIPVA</displayName>
          <description>EBI Violation Address</description>
          <addressOffset>0x1E0</addressOffset>
       </register>
       <register derivedFrom="SCU_APB0PVA">
          <name>SCU_FLASHPVA</name>
          <displayName>SCU_FLASHPVA</displayName>
          <description>FLASH Violation Address</description>
          <addressOffset>0x1E4</addressOffset>
       </register>
       <register>
          <name>SCU_GDMAMVA</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SCU_GDMAMVA</displayName>
          <description>GDMA Violation Address</description>
          <addressOffset>0x220</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>VIOADDR</name>
              <description>Violation Address\nIndicate the target address of the access, which invokes the security violation.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
