wosayttn/sdk-bsp-numaker-m55m1/Debug/svd/M55M1.svd
       <register derivedFrom="SCU_GDMAMVA">
          <name>SCU_PDMA0MVA</name>
          <displayName>SCU_PDMA0MVA</displayName>
          <description>PDMA Violation Address</description>
          <addressOffset>0x224</addressOffset>
       </register>
       <register derivedFrom="SCU_GDMAMVA">
          <name>SCU_PDMA1MVA</name>
          <displayName>SCU_PDMA1MVA</displayName>
          <description>PDMA1 Violation Address</description>
          <addressOffset>0x228</addressOffset>
       </register>
       <register derivedFrom="SCU_GDMAMVA">
          <name>SCU_USBH0MVA</name>
          <displayName>SCU_USBH0MVA</displayName>
          <description>USBH0 Violation Address</description>
          <addressOffset>0x22C</addressOffset>
       </register>
       <register derivedFrom="SCU_GDMAMVA">
          <name>SCU_HSUSBHMVA</name>
          <displayName>SCU_HSUSBHMVA</displayName>
          <description>HSUSBH Violation Address</description>
          <addressOffset>0x234</addressOffset>
       </register>
       <register derivedFrom="SCU_GDMAMVA">
          <name>SCU_HSUSBDMVA</name>
          <displayName>SCU_HSUSBDMVA</displayName>
          <description>HSUSBD Violation Address</description>
          <addressOffset>0x238</addressOffset>
       </register>
       <register derivedFrom="SCU_GDMAMVA">
          <name>SCU_SDH0MVA</name>
          <displayName>SCU_SDH0MVA</displayName>
          <description>SDH Violation Address</description>
          <addressOffset>0x23C</addressOffset>
       </register>
       <register derivedFrom="SCU_GDMAMVA">
          <name>SCU_SDH1MVA</name>
          <displayName>SCU_SDH1MVA</displayName>
          <description>SDH1 Violation Address</description>
          <addressOffset>0x240</addressOffset>
       </register>
       <register derivedFrom="SCU_GDMAMVA">
          <name>SCU_EMACMVA</name>
          <displayName>SCU_EMACMVA</displayName>
          <description>EMAC Violation Address</description>
          <addressOffset>0x244</addressOffset>
       </register>
       <register derivedFrom="SCU_GDMAMVA">
          <name>SCU_CRYPTOMVA</name>
          <displayName>SCU_CRYPTOMVA</displayName>
          <description>CRYPTO Violation Address</description>
          <addressOffset>0x248</addressOffset>
       </register>
       <register derivedFrom="SCU_GDMAMVA">
          <name>SCU_CRCMVA</name>
          <displayName>SCU_CRCMVA</displayName>
          <description>CRC Violation Address</description>
          <addressOffset>0x24C</addressOffset>
       </register>
       <register derivedFrom="SCU_GDMAMVA">
          <name>SCU_LPDMAMVA</name>
          <displayName>SCU_LPDMAMVA</displayName>
          <description>LPDMA Violation Address</description>
          <addressOffset>0x250</addressOffset>
       </register>
       <register derivedFrom="SCU_GDMAMVA">
          <name>SCU_CCAPMVA</name>
          <displayName>SCU_CCAPMVA</displayName>
          <description>CCAP Violation Address</description>
          <addressOffset>0x254</addressOffset>
       </register>
       <register derivedFrom="SCU_GDMAMVA">
          <name>SCU_NPUIF1MVA</name>
          <displayName>SCU_NPUIF1MVA</displayName>
          <description>NPU Interface 1 Violation Address</description>
          <addressOffset>0x258</addressOffset>
       </register>
       <register derivedFrom="SCU_GDMAMVA">
          <name>SCU_NPUIF0MVA</name>
          <displayName>SCU_NPUIF0MVA</displayName>
          <description>NPU Interface 0 Violation Address</description>
          <addressOffset>0x25C</addressOffset>
       </register>
       <register derivedFrom="SCU_GDMAMVA">
          <name>SCU_SPIM0MVA</name>
          <displayName>SCU_SPIM0MVA</displayName>
          <description>SPIM 0 Master Violation Address</description>
          <addressOffset>0x260</addressOffset>
       </register>
       <register>
          <name>SCU_D0PNP0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SCU_D0PNP0</displayName>
          <description>Domain 0 Peripheral Privilege Attribution Set Register0 (0x4000_0000~0x4001_FFFF)</description>
          <addressOffset>0x2A0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>NPU</name>
              <description>Set NPU to Non-privileged State</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>NPU is a privileged module (default)</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>NPU is a non-privileged module</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SRAM0MPC</name>
              <description>Set SRAM0MPC to Non-privileged State</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>SRAM0MPC is a privileged module (default)</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>SRAM0MPC is a non-privileged module</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SRAM1MPC</name>
              <description>Set SRAM1MPC to Non-privileged State</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>SRAM1MPC is a privileged module (default)</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>SRAM1MPC is a non-privileged module</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SRAM2MPC</name>
              <description>Set SRAM2MPC to Non-privileged State</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>SRAM2MPC is a privileged module (default)</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>SRAM2MPC is a non-privileged module</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SRAM3MPC</name>
              <description>Set SRAM3MPC to Non-privileged State</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>SRAM3MPC is a privileged module (default)</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>SRAM3MPC is a non-privileged module</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SPIM0MPC</name>
              <description>Set SPIM0MPC to Non-privileged State</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>SPIM0MPC is a privileged module (default)</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>SPIM0MPC is a non-privileged module</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>SCU_D0PNP2</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SCU_D0PNP2</displayName>
          <description>Domain 0 Peripheral Privilege Attribution Set Register2 (0x4004_0000~0x4005_FFFF)</description>
          <addressOffset>0x2A8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OTFC0</name>
              <description>Set OTFC0 to Non-privileged State</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>OTFC0 is a privileged module (default)</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>OTFC0 is a non-privileged module</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SPIM0</name>
              <description>Set SPIM0 to Non-privileged State</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>SPIM0 is a privileged module (default)</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>SPIM0 is a non-privileged module</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>FMC</name>
              <description>Set FMC to Non-privileged State</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>FMC is a privileged module (default)</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>FMC is a non-privileged module</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>SCU_D1PNP0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SCU_D1PNP0</displayName>
          <description>Domain 1 Peripheral Privilege Attribution Set Register0 (0x4020_0000~0x4021_FFFF)</description>
          <addressOffset>0x2C0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PDMA0</name>
              <description>Set PDMA0 to Non-privileged State</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>PDMA0 is a privileged module (default)</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>PDMA0 is a non-privileged module</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>PDMA1</name>
              <description>Set PDMA1 to Non-privileged State</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>PDMA1 is a privileged module (default)</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>PDMA1 is a non-privileged module</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>USBH0</name>
              <description>Set USBH0 to Non-privileged State</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>USBH0 is a privileged module (default)</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>USBH0 is a non-privileged module</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>HSUSBH</name>
              <description>Set HSUSBH to Non-privileged State</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>HSUSBH is a privileged module (default)</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>HSUSBH is a non-privileged module</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>HSUSBD</name>
              <description>Set HSUSBD to Non-privileged State</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>HSUSBD is a privileged module (default)</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>HSUSBD is a non-privileged module</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SDH0</name>
              <description>Set SDH0 to Non-privileged State</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>SDH0 is a privileged module (default)</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>SDH0 is a non-privileged module</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SDH1</name>
              <description>Set SDH1 to Non-privileged State</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>SDH1 is a privileged module (default)</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>SDH1 is a non-privileged module</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC0</name>
              <description>Set EMAC0 to Non-privileged State</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>EMAC0 is a privileged module (default)</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>EMAC0 is a non-privileged module</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>CRYPTO</name>
              <description>Set CRYPTO to Non-privileged State</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>CRYPTO is a privileged module (default)</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>CRYPTO is a non-privileged module</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>CRC</name>
              <description>Set CRC to Non-privileged State</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>CRC is a privileged module (default)</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>CRC is a non-privileged module</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
