wosayttn/sdk-bsp-numaker-m55m1/Debug/svd/M55M1.svd
              <description>APROM Proect enable\nThis bit indicates which APROM region is protected.\nNote: APROM protect region is 0x0020_0000 + n*(0x8000) to 0x0020_7fff + n*(0x8000)</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>APROM region n is not protected</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>APROM region n is protected</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>APPROEN53</name>
              <description>APROM Proect enable\nThis bit indicates which APROM region is protected.\nNote: APROM protect region is 0x0020_0000 + n*(0x8000) to 0x0020_7fff + n*(0x8000)</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>APROM region n is not protected</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>APROM region n is protected</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>APPROEN54</name>
              <description>APROM Proect enable\nThis bit indicates which APROM region is protected.\nNote: APROM protect region is 0x0020_0000 + n*(0x8000) to 0x0020_7fff + n*(0x8000)</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>APROM region n is not protected</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>APROM region n is protected</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>APPROEN55</name>
              <description>APROM Proect enable\nThis bit indicates which APROM region is protected.\nNote: APROM protect region is 0x0020_0000 + n*(0x8000) to 0x0020_7fff + n*(0x8000)</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>APROM region n is not protected</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>APROM region n is protected</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>APPROEN56</name>
              <description>APROM Proect enable\nThis bit indicates which APROM region is protected.\nNote: APROM protect region is 0x0020_0000 + n*(0x8000) to 0x0020_7fff + n*(0x8000)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>APROM region n is not protected</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>APROM region n is protected</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>APPROEN57</name>
              <description>APROM Proect enable\nThis bit indicates which APROM region is protected.\nNote: APROM protect region is 0x0020_0000 + n*(0x8000) to 0x0020_7fff + n*(0x8000)</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>APROM region n is not protected</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>APROM region n is protected</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>APPROEN58</name>
              <description>APROM Proect enable\nThis bit indicates which APROM region is protected.\nNote: APROM protect region is 0x0020_0000 + n*(0x8000) to 0x0020_7fff + n*(0x8000)</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>APROM region n is not protected</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>APROM region n is protected</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>APPROEN59</name>
              <description>APROM Proect enable\nThis bit indicates which APROM region is protected.\nNote: APROM protect region is 0x0020_0000 + n*(0x8000) to 0x0020_7fff + n*(0x8000)</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>APROM region n is not protected</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>APROM region n is protected</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>APPROEN60</name>
              <description>APROM Proect enable\nThis bit indicates which APROM region is protected.\nNote: APROM protect region is 0x0020_0000 + n*(0x8000) to 0x0020_7fff + n*(0x8000)</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>APROM region n is not protected</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>APROM region n is protected</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>APPROEN61</name>
              <description>APROM Proect enable\nThis bit indicates which APROM region is protected.\nNote: APROM protect region is 0x0020_0000 + n*(0x8000) to 0x0020_7fff + n*(0x8000)</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>APROM region n is not protected</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>APROM region n is protected</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>APPROEN62</name>
              <description>APROM Proect enable\nThis bit indicates which APROM region is protected.\nNote: APROM protect region is 0x0020_0000 + n*(0x8000) to 0x0020_7fff + n*(0x8000)</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>APROM region n is not protected</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>APROM region n is protected</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>APPROEN63</name>
              <description>APROM Proect enable\nThis bit indicates which APROM region is protected.\nNote: APROM protect region is 0x0020_0000 + n*(0x8000) to 0x0020_7fff + n*(0x8000)</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>APROM region n is not protected</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>APROM region n is protected</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>FMC_APWPKEEP</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>FMC_APWPKEEP</displayName>
          <description>APROM Write Protect Keep Register</description>
          <addressOffset>0x118</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>APWPKEEP0</name>
              <description>APROM Write Protect Keep 0 </description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>21930</name>
                    <description>APWPROT0 register is be locked</description>
                    <value>0x55aa</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>APWPKEEP1</name>
              <description>APROM Write Protect Keep 1 </description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>21930</name>
                    <description>APWPROT1 register is be locked</description>
                    <value>0x55aa</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>FMC_SCACT</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>FMC_SCACT</displayName>
          <description>APROM Secure Conceal Active Register</description>
          <addressOffset>0x11C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SCACT</name>
              <description>Secure Conceal Function Active(Write Protect)\nNote: secure conceal function active will base on this bit and setting of CONFIG6 is all 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>secure conceal function inactive</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>secure conceal function active</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
