wosayttn/sdk-bsp-numaker-m55m1/Debug/svd/M55M1.svd
       <register>
          <name>NS_FMC_XOMSTS</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>NS_FMC_XOMSTS</displayName>
          <description>Non-secure XOM Status Register</description>
          <addressOffset>0xE0</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>XOMR0ON</name>
              <description>XOM Region 0 On\nXOM Region 0 active status.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Not active</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>XOM region 0 is active</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>XOMR1ON</name>
              <description>XOM Region 1 On\nXOM Region 1 active status.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Not active</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>XOM region 1 is active</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>XOMR2ON</name>
              <description>XOM Region 2 On\nXOM Region 2 active status.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Not active</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>XOM region 2 is active</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>XOMR3ON</name>
              <description>XOM Region 3 On\nXOM Region 3 active status.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Not active</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>XOM region 3 is active</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>XOMPEF</name>
              <description>XOM Page Erase Function Fail\nXOM page erase function status. If XOMPEF is set to 1, user needs to erase XOM region again.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Success</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Fail</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>NS_FMC_APWPROT0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>NS_FMC_APWPROT0</displayName>
          <description>APROM Write Protect Register0</description>
          <addressOffset>0x110</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>APPROEN0</name>
              <description>APROM Proect enable\nThis bit indicates which APROM region is protected.\nNote: APROM protect region is 0x1010_0000 + n*(0x8000) to 0x1010_7fff + n*(0x8000)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>APROM region n is not protected</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>APROM region n is protected</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>APPROEN1</name>
              <description>APROM Proect enable\nThis bit indicates which APROM region is protected.\nNote: APROM protect region is 0x1010_0000 + n*(0x8000) to 0x1010_7fff + n*(0x8000)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>APROM region n is not protected</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>APROM region n is protected</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>APPROEN2</name>
              <description>APROM Proect enable\nThis bit indicates which APROM region is protected.\nNote: APROM protect region is 0x1010_0000 + n*(0x8000) to 0x1010_7fff + n*(0x8000)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>APROM region n is not protected</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>APROM region n is protected</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>APPROEN3</name>
              <description>APROM Proect enable\nThis bit indicates which APROM region is protected.\nNote: APROM protect region is 0x1010_0000 + n*(0x8000) to 0x1010_7fff + n*(0x8000)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>APROM region n is not protected</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>APROM region n is protected</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>APPROEN4</name>
              <description>APROM Proect enable\nThis bit indicates which APROM region is protected.\nNote: APROM protect region is 0x1010_0000 + n*(0x8000) to 0x1010_7fff + n*(0x8000)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>APROM region n is not protected</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>APROM region n is protected</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>APPROEN5</name>
              <description>APROM Proect enable\nThis bit indicates which APROM region is protected.\nNote: APROM protect region is 0x1010_0000 + n*(0x8000) to 0x1010_7fff + n*(0x8000)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>APROM region n is not protected</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>APROM region n is protected</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>APPROEN6</name>
              <description>APROM Proect enable\nThis bit indicates which APROM region is protected.\nNote: APROM protect region is 0x1010_0000 + n*(0x8000) to 0x1010_7fff + n*(0x8000)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>APROM region n is not protected</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>APROM region n is protected</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>APPROEN7</name>
              <description>APROM Proect enable\nThis bit indicates which APROM region is protected.\nNote: APROM protect region is 0x1010_0000 + n*(0x8000) to 0x1010_7fff + n*(0x8000)</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>APROM region n is not protected</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>APROM region n is protected</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>APPROEN8</name>
              <description>APROM Proect enable\nThis bit indicates which APROM region is protected.\nNote: APROM protect region is 0x1010_0000 + n*(0x8000) to 0x1010_7fff + n*(0x8000)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>APROM region n is not protected</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>APROM region n is protected</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>APPROEN9</name>
              <description>APROM Proect enable\nThis bit indicates which APROM region is protected.\nNote: APROM protect region is 0x1010_0000 + n*(0x8000) to 0x1010_7fff + n*(0x8000)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>APROM region n is not protected</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>APROM region n is protected</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>APPROEN10</name>
              <description>APROM Proect enable\nThis bit indicates which APROM region is protected.\nNote: APROM protect region is 0x1010_0000 + n*(0x8000) to 0x1010_7fff + n*(0x8000)</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>APROM region n is not protected</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>APROM region n is protected</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>APPROEN11</name>
              <description>APROM Proect enable\nThis bit indicates which APROM region is protected.\nNote: APROM protect region is 0x1010_0000 + n*(0x8000) to 0x1010_7fff + n*(0x8000)</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>APROM region n is not protected</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>APROM region n is protected</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>APPROEN12</name>
              <description>APROM Proect enable\nThis bit indicates which APROM region is protected.\nNote: APROM protect region is 0x1010_0000 + n*(0x8000) to 0x1010_7fff + n*(0x8000)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>APROM region n is not protected</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>APROM region n is protected</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>APPROEN13</name>
              <description>APROM Proect enable\nThis bit indicates which APROM region is protected.\nNote: APROM protect region is 0x1010_0000 + n*(0x8000) to 0x1010_7fff + n*(0x8000)</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>APROM region n is not protected</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>APROM region n is protected</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>APPROEN14</name>
              <description>APROM Proect enable\nThis bit indicates which APROM region is protected.\nNote: APROM protect region is 0x1010_0000 + n*(0x8000) to 0x1010_7fff + n*(0x8000)</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>APROM region n is not protected</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>APROM region n is protected</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>APPROEN15</name>
              <description>APROM Proect enable\nThis bit indicates which APROM region is protected.\nNote: APROM protect region is 0x1010_0000 + n*(0x8000) to 0x1010_7fff + n*(0x8000)</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>APROM region n is not protected</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>APROM region n is protected</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>APPROEN16</name>
              <description>APROM Proect enable\nThis bit indicates which APROM region is protected.\nNote: APROM protect region is 0x1010_0000 + n*(0x8000) to 0x1010_7fff + n*(0x8000)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>APROM region n is not protected</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>APROM region n is protected</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>APPROEN17</name>
              <description>APROM Proect enable\nThis bit indicates which APROM region is protected.\nNote: APROM protect region is 0x1010_0000 + n*(0x8000) to 0x1010_7fff + n*(0x8000)</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>APROM region n is not protected</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>APROM region n is protected</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>APPROEN18</name>
              <description>APROM Proect enable\nThis bit indicates which APROM region is protected.\nNote: APROM protect region is 0x1010_0000 + n*(0x8000) to 0x1010_7fff + n*(0x8000)</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>APROM region n is not protected</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>APROM region n is protected</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>APPROEN19</name>
              <description>APROM Proect enable\nThis bit indicates which APROM region is protected.\nNote: APROM protect region is 0x1010_0000 + n*(0x8000) to 0x1010_7fff + n*(0x8000)</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>APROM region n is not protected</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>APROM region n is protected</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>APPROEN20</name>
              <description>APROM Proect enable\nThis bit indicates which APROM region is protected.\nNote: APROM protect region is 0x1010_0000 + n*(0x8000) to 0x1010_7fff + n*(0x8000)</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>APROM region n is not protected</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>APROM region n is protected</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>APPROEN21</name>
              <description>APROM Proect enable\nThis bit indicates which APROM region is protected.\nNote: APROM protect region is 0x1010_0000 + n*(0x8000) to 0x1010_7fff + n*(0x8000)</description>
