wosayttn/sdk-bsp-numaker-m55m1/Debug/svd/M55M1.svd
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>APROM region n is not protected</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>APROM region n is protected</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>APPROEN22</name>
              <description>APROM Proect enable\nThis bit indicates which APROM region is protected.\nNote: APROM protect region is 0x1010_0000 + n*(0x8000) to 0x1010_7fff + n*(0x8000)</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>APROM region n is not protected</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>APROM region n is protected</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>APPROEN23</name>
              <description>APROM Proect enable\nThis bit indicates which APROM region is protected.\nNote: APROM protect region is 0x1010_0000 + n*(0x8000) to 0x1010_7fff + n*(0x8000)</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>APROM region n is not protected</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>APROM region n is protected</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>APPROEN24</name>
              <description>APROM Proect enable\nThis bit indicates which APROM region is protected.\nNote: APROM protect region is 0x1010_0000 + n*(0x8000) to 0x1010_7fff + n*(0x8000)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>APROM region n is not protected</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>APROM region n is protected</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>APPROEN25</name>
              <description>APROM Proect enable\nThis bit indicates which APROM region is protected.\nNote: APROM protect region is 0x1010_0000 + n*(0x8000) to 0x1010_7fff + n*(0x8000)</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>APROM region n is not protected</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>APROM region n is protected</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>APPROEN26</name>
              <description>APROM Proect enable\nThis bit indicates which APROM region is protected.\nNote: APROM protect region is 0x1010_0000 + n*(0x8000) to 0x1010_7fff + n*(0x8000)</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>APROM region n is not protected</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>APROM region n is protected</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>APPROEN27</name>
              <description>APROM Proect enable\nThis bit indicates which APROM region is protected.\nNote: APROM protect region is 0x1010_0000 + n*(0x8000) to 0x1010_7fff + n*(0x8000)</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>APROM region n is not protected</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>APROM region n is protected</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>APPROEN28</name>
              <description>APROM Proect enable\nThis bit indicates which APROM region is protected.\nNote: APROM protect region is 0x1010_0000 + n*(0x8000) to 0x1010_7fff + n*(0x8000)</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>APROM region n is not protected</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>APROM region n is protected</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>APPROEN29</name>
              <description>APROM Proect enable\nThis bit indicates which APROM region is protected.\nNote: APROM protect region is 0x1010_0000 + n*(0x8000) to 0x1010_7fff + n*(0x8000)</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>APROM region n is not protected</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>APROM region n is protected</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>APPROEN30</name>
              <description>APROM Proect enable\nThis bit indicates which APROM region is protected.\nNote: APROM protect region is 0x1010_0000 + n*(0x8000) to 0x1010_7fff + n*(0x8000)</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>APROM region n is not protected</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>APROM region n is protected</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>APPROEN31</name>
              <description>APROM Proect enable\nThis bit indicates which APROM region is protected.\nNote: APROM protect region is 0x1010_0000 + n*(0x8000) to 0x1010_7fff + n*(0x8000)</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>APROM region n is not protected</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>APROM region n is protected</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
          </fields>
       </register>
