wosayttn/sdk-bsp-numaker-m55m1/Debug/svd/M55M1.svd
       <register>
          <name>NS_FMC_APWPROT1</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>NS_FMC_APWPROT1</displayName>
          <description>APROM Write Protect Register1</description>
          <addressOffset>0x114</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>APPROEN32</name>
              <description>APROM Proect enable\nThis bit indicates which APROM region is protected.\nNote: APROM protect region is 0x1020_0000 + n*(0x8000) to 0x1020_7fff + n*(0x8000)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>APROM region n is not protected</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>APROM region n is protected</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>APPROEN33</name>
              <description>APROM Proect enable\nThis bit indicates which APROM region is protected.\nNote: APROM protect region is 0x1020_0000 + n*(0x8000) to 0x1020_7fff + n*(0x8000)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>APROM region n is not protected</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>APROM region n is protected</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>APPROEN34</name>
              <description>APROM Proect enable\nThis bit indicates which APROM region is protected.\nNote: APROM protect region is 0x1020_0000 + n*(0x8000) to 0x1020_7fff + n*(0x8000)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>APROM region n is not protected</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>APROM region n is protected</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>APPROEN35</name>
              <description>APROM Proect enable\nThis bit indicates which APROM region is protected.\nNote: APROM protect region is 0x1020_0000 + n*(0x8000) to 0x1020_7fff + n*(0x8000)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>APROM region n is not protected</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>APROM region n is protected</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>APPROEN36</name>
              <description>APROM Proect enable\nThis bit indicates which APROM region is protected.\nNote: APROM protect region is 0x1020_0000 + n*(0x8000) to 0x1020_7fff + n*(0x8000)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>APROM region n is not protected</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>APROM region n is protected</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>APPROEN37</name>
              <description>APROM Proect enable\nThis bit indicates which APROM region is protected.\nNote: APROM protect region is 0x1020_0000 + n*(0x8000) to 0x1020_7fff + n*(0x8000)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>APROM region n is not protected</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>APROM region n is protected</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>APPROEN38</name>
              <description>APROM Proect enable\nThis bit indicates which APROM region is protected.\nNote: APROM protect region is 0x1020_0000 + n*(0x8000) to 0x1020_7fff + n*(0x8000)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>APROM region n is not protected</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>APROM region n is protected</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>APPROEN39</name>
              <description>APROM Proect enable\nThis bit indicates which APROM region is protected.\nNote: APROM protect region is 0x1020_0000 + n*(0x8000) to 0x1020_7fff + n*(0x8000)</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>APROM region n is not protected</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>APROM region n is protected</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>APPROEN40</name>
              <description>APROM Proect enable\nThis bit indicates which APROM region is protected.\nNote: APROM protect region is 0x1020_0000 + n*(0x8000) to 0x1020_7fff + n*(0x8000)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>APROM region n is not protected</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>APROM region n is protected</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>APPROEN41</name>
              <description>APROM Proect enable\nThis bit indicates which APROM region is protected.\nNote: APROM protect region is 0x1020_0000 + n*(0x8000) to 0x1020_7fff + n*(0x8000)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>APROM region n is not protected</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>APROM region n is protected</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>APPROEN42</name>
              <description>APROM Proect enable\nThis bit indicates which APROM region is protected.\nNote: APROM protect region is 0x1020_0000 + n*(0x8000) to 0x1020_7fff + n*(0x8000)</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>APROM region n is not protected</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>APROM region n is protected</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>APPROEN43</name>
              <description>APROM Proect enable\nThis bit indicates which APROM region is protected.\nNote: APROM protect region is 0x1020_0000 + n*(0x8000) to 0x1020_7fff + n*(0x8000)</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>APROM region n is not protected</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>APROM region n is protected</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>APPROEN44</name>
              <description>APROM Proect enable\nThis bit indicates which APROM region is protected.\nNote: APROM protect region is 0x1020_0000 + n*(0x8000) to 0x1020_7fff + n*(0x8000)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>APROM region n is not protected</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>APROM region n is protected</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>APPROEN45</name>
              <description>APROM Proect enable\nThis bit indicates which APROM region is protected.\nNote: APROM protect region is 0x1020_0000 + n*(0x8000) to 0x1020_7fff + n*(0x8000)</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>APROM region n is not protected</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>APROM region n is protected</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>APPROEN46</name>
              <description>APROM Proect enable\nThis bit indicates which APROM region is protected.\nNote: APROM protect region is 0x1020_0000 + n*(0x8000) to 0x1020_7fff + n*(0x8000)</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>APROM region n is not protected</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>APROM region n is protected</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>APPROEN47</name>
              <description>APROM Proect enable\nThis bit indicates which APROM region is protected.\nNote: APROM protect region is 0x1020_0000 + n*(0x8000) to 0x1020_7fff + n*(0x8000)</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>APROM region n is not protected</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>APROM region n is protected</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>APPROEN48</name>
              <description>APROM Proect enable\nThis bit indicates which APROM region is protected.\nNote: APROM protect region is 0x1020_0000 + n*(0x8000) to 0x1020_7fff + n*(0x8000)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>APROM region n is not protected</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>APROM region n is protected</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>APPROEN49</name>
              <description>APROM Proect enable\nThis bit indicates which APROM region is protected.\nNote: APROM protect region is 0x1020_0000 + n*(0x8000) to 0x1020_7fff + n*(0x8000)</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>APROM region n is not protected</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>APROM region n is protected</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>APPROEN50</name>
              <description>APROM Proect enable\nThis bit indicates which APROM region is protected.\nNote: APROM protect region is 0x1020_0000 + n*(0x8000) to 0x1020_7fff + n*(0x8000)</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>APROM region n is not protected</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>APROM region n is protected</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>APPROEN51</name>
              <description>APROM Proect enable\nThis bit indicates which APROM region is protected.\nNote: APROM protect region is 0x1020_0000 + n*(0x8000) to 0x1020_7fff + n*(0x8000)</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>APROM region n is not protected</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>APROM region n is protected</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>APPROEN52</name>
              <description>APROM Proect enable\nThis bit indicates which APROM region is protected.\nNote: APROM protect region is 0x1020_0000 + n*(0x8000) to 0x1020_7fff + n*(0x8000)</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>APROM region n is not protected</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>APROM region n is protected</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>APPROEN53</name>
              <description>APROM Proect enable\nThis bit indicates which APROM region is protected.\nNote: APROM protect region is 0x1020_0000 + n*(0x8000) to 0x1020_7fff + n*(0x8000)</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>APROM region n is not protected</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>APROM region n is protected</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>APPROEN54</name>
              <description>APROM Proect enable\nThis bit indicates which APROM region is protected.\nNote: APROM protect region is 0x1020_0000 + n*(0x8000) to 0x1020_7fff + n*(0x8000)</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>APROM region n is not protected</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>APROM region n is protected</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>APPROEN55</name>
              <description>APROM Proect enable\nThis bit indicates which APROM region is protected.\nNote: APROM protect region is 0x1020_0000 + n*(0x8000) to 0x1020_7fff + n*(0x8000)</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>APROM region n is not protected</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>APROM region n is protected</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>APPROEN56</name>
              <description>APROM Proect enable\nThis bit indicates which APROM region is protected.\nNote: APROM protect region is 0x1020_0000 + n*(0x8000) to 0x1020_7fff + n*(0x8000)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>APROM region n is not protected</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>APROM region n is protected</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>APPROEN57</name>
              <description>APROM Proect enable\nThis bit indicates which APROM region is protected.\nNote: APROM protect region is 0x1020_0000 + n*(0x8000) to 0x1020_7fff + n*(0x8000)</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>APROM region n is not protected</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>APROM region n is protected</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>APPROEN58</name>
