wosayttn/sdk-bsp-numaker-m55m1/Debug/svd/M55M1.svd
       <register derivedFrom="PA_DOUT">
          <name>PH_DOUT</name>
          <displayName>PH_DOUT</displayName>
          <description>PH Data Output Value</description>
          <addressOffset>0x1C8</addressOffset>
       </register>
       <register derivedFrom="PA_DATMSK">
          <name>PH_DATMSK</name>
          <displayName>PH_DATMSK</displayName>
          <description>PH Data Output Write Mask</description>
          <addressOffset>0x1CC</addressOffset>
       </register>
       <register derivedFrom="PA_PIN">
          <name>PH_PIN</name>
          <displayName>PH_PIN</displayName>
          <description>PH Pin Value</description>
          <addressOffset>0x1D0</addressOffset>
       </register>
       <register derivedFrom="PA_DBEN">
          <name>PH_DBEN</name>
          <displayName>PH_DBEN</displayName>
          <description>PH De-bounce Enable Control Register</description>
          <addressOffset>0x1D4</addressOffset>
       </register>
       <register derivedFrom="PA_INTTYPE">
          <name>PH_INTTYPE</name>
          <displayName>PH_INTTYPE</displayName>
          <description>PH Interrupt Trigger Type Control</description>
          <addressOffset>0x1D8</addressOffset>
       </register>
       <register derivedFrom="PA_INTEN">
          <name>PH_INTEN</name>
          <displayName>PH_INTEN</displayName>
          <description>PH Interrupt Enable Control Register</description>
          <addressOffset>0x1DC</addressOffset>
       </register>
       <register derivedFrom="PA_INTSRC">
          <name>PH_INTSRC</name>
          <displayName>PH_INTSRC</displayName>
          <description>PH Interrupt Source Flag</description>
          <addressOffset>0x1E0</addressOffset>
       </register>
       <register derivedFrom="PA_SMTEN">
          <name>PH_SMTEN</name>
          <displayName>PH_SMTEN</displayName>
          <description>PH Input Schmitt Trigger Enable Register</description>
          <addressOffset>0x1E4</addressOffset>
       </register>
       <register derivedFrom="PA_SLEWCTL">
          <name>PH_SLEWCTL</name>
          <displayName>PH_SLEWCTL</displayName>
          <description>PH High Slew Rate Control Register</description>
          <addressOffset>0x1E8</addressOffset>
       </register>
       <register derivedFrom="PA_PUSEL">
          <name>PH_PUSEL</name>
          <displayName>PH_PUSEL</displayName>
          <description>PH Pull-up and Pull-down Selection Register</description>
          <addressOffset>0x1F0</addressOffset>
       </register>
       <register derivedFrom="PA_DBCTL">
          <name>PH_DBCTL</name>
          <displayName>PH_DBCTL</displayName>
          <description>PH Interrupt De-bounce Control Register</description>
          <addressOffset>0x1F4</addressOffset>
       </register>
       <register derivedFrom="PA_MODE">
          <name>PI_MODE</name>
          <displayName>PI_MODE</displayName>
          <description>PI I/O Mode Control</description>
          <addressOffset>0x200</addressOffset>
       </register>
       <register derivedFrom="PA_DINOFF">
          <name>PI_DINOFF</name>
          <displayName>PI_DINOFF</displayName>
          <description>PI Digital Input Path Disable Control</description>
          <addressOffset>0x204</addressOffset>
       </register>
       <register derivedFrom="PA_DOUT">
          <name>PI_DOUT</name>
          <displayName>PI_DOUT</displayName>
          <description>PI Data Output Value</description>
          <addressOffset>0x208</addressOffset>
       </register>
       <register derivedFrom="PA_DATMSK">
          <name>PI_DATMSK</name>
          <displayName>PI_DATMSK</displayName>
          <description>PI Data Output Write Mask</description>
          <addressOffset>0x20C</addressOffset>
       </register>
       <register derivedFrom="PA_PIN">
          <name>PI_PIN</name>
          <displayName>PI_PIN</displayName>
          <description>PI Pin Value</description>
          <addressOffset>0x210</addressOffset>
       </register>
       <register derivedFrom="PA_DBEN">
          <name>PI_DBEN</name>
          <displayName>PI_DBEN</displayName>
          <description>PI De-bounce Enable Control Register</description>
          <addressOffset>0x214</addressOffset>
       </register>
       <register derivedFrom="PA_INTTYPE">
          <name>PI_INTTYPE</name>
          <displayName>PI_INTTYPE</displayName>
          <description>PI Interrupt Trigger Type Control</description>
          <addressOffset>0x218</addressOffset>
       </register>
       <register derivedFrom="PA_INTEN">
          <name>PI_INTEN</name>
          <displayName>PI_INTEN</displayName>
          <description>PI Interrupt Enable Control Register</description>
          <addressOffset>0x21C</addressOffset>
       </register>
       <register derivedFrom="PA_INTSRC">
          <name>PI_INTSRC</name>
          <displayName>PI_INTSRC</displayName>
          <description>PI Interrupt Source Flag</description>
          <addressOffset>0x220</addressOffset>
       </register>
       <register derivedFrom="PA_SMTEN">
          <name>PI_SMTEN</name>
          <displayName>PI_SMTEN</displayName>
          <description>PI Input Schmitt Trigger Enable Register</description>
          <addressOffset>0x224</addressOffset>
       </register>
       <register derivedFrom="PA_SLEWCTL">
          <name>PI_SLEWCTL</name>
          <displayName>PI_SLEWCTL</displayName>
          <description>PI High Slew Rate Control Register</description>
          <addressOffset>0x228</addressOffset>
       </register>
       <register derivedFrom="PA_PUSEL">
          <name>PI_PUSEL</name>
          <displayName>PI_PUSEL</displayName>
          <description>PI Pull-up and Pull-down Selection Register</description>
          <addressOffset>0x230</addressOffset>
       </register>
       <register derivedFrom="PA_DBCTL">
          <name>PI_DBCTL</name>
          <displayName>PI_DBCTL</displayName>
          <description>PI Interrupt De-bounce Control Register</description>
          <addressOffset>0x234</addressOffset>
       </register>
       <register derivedFrom="PA_MODE">
          <name>PJ_MODE</name>
          <displayName>PJ_MODE</displayName>
          <description>PJ I/O Mode Control</description>
          <addressOffset>0x240</addressOffset>
       </register>
       <register derivedFrom="PA_DINOFF">
          <name>PJ_DINOFF</name>
          <displayName>PJ_DINOFF</displayName>
          <description>PJ Digital Input Path Disable Control</description>
          <addressOffset>0x244</addressOffset>
       </register>
