wosayttn/sdk-bsp-numaker-m55m1/Debug/svd/M55M1.svd
       <register>
          <name>LPGPIO_DRST</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>LPGPIO_DRST</displayName>
          <description>LPIOn Data Output Reset Control</description>
          <addressOffset>0x10</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DRESET0</name>
              <description>LPIOn Data Ouput Reset Control (Write Only)\nWriting 1 to each bit can reset LPIOn pin output data to 0.\nNote 1: This bit field is write only, reading this field will response with 0.\nNote 2: Writing 1 to DRESET[n] will make DOUT[n] reflect the reset value.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No action</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Reset LPIOn to 0</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>write-only</access>
            </field>
            <field>
              <name>DRESET1</name>
              <description>LPIOn Data Ouput Reset Control (Write Only)\nWriting 1 to each bit can reset LPIOn pin output data to 0.\nNote 1: This bit field is write only, reading this field will response with 0.\nNote 2: Writing 1 to DRESET[n] will make DOUT[n] reflect the reset value.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No action</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Reset LPIOn to 0</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>write-only</access>
            </field>
            <field>
              <name>DRESET2</name>
              <description>LPIOn Data Ouput Reset Control (Write Only)\nWriting 1 to each bit can reset LPIOn pin output data to 0.\nNote 1: This bit field is write only, reading this field will response with 0.\nNote 2: Writing 1 to DRESET[n] will make DOUT[n] reflect the reset value.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No action</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Reset LPIOn to 0</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>write-only</access>
            </field>
            <field>
              <name>DRESET3</name>
              <description>LPIOn Data Ouput Reset Control (Write Only)\nWriting 1 to each bit can reset LPIOn pin output data to 0.\nNote 1: This bit field is write only, reading this field will response with 0.\nNote 2: Writing 1 to DRESET[n] will make DOUT[n] reflect the reset value.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No action</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Reset LPIOn to 0</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>write-only</access>
            </field>
            <field>
              <name>DRESET4</name>
              <description>LPIOn Data Ouput Reset Control (Write Only)\nWriting 1 to each bit can reset LPIOn pin output data to 0.\nNote 1: This bit field is write only, reading this field will response with 0.\nNote 2: Writing 1 to DRESET[n] will make DOUT[n] reflect the reset value.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No action</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Reset LPIOn to 0</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>write-only</access>
            </field>
            <field>
              <name>DRESET5</name>
              <description>LPIOn Data Ouput Reset Control (Write Only)\nWriting 1 to each bit can reset LPIOn pin output data to 0.\nNote 1: This bit field is write only, reading this field will response with 0.\nNote 2: Writing 1 to DRESET[n] will make DOUT[n] reflect the reset value.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No action</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Reset LPIOn to 0</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>write-only</access>
            </field>
            <field>
              <name>DRESET6</name>
              <description>LPIOn Data Ouput Reset Control (Write Only)\nWriting 1 to each bit can reset LPIOn pin output data to 0.\nNote 1: This bit field is write only, reading this field will response with 0.\nNote 2: Writing 1 to DRESET[n] will make DOUT[n] reflect the reset value.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No action</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Reset LPIOn to 0</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>write-only</access>
            </field>
            <field>
              <name>DRESET7</name>
              <description>LPIOn Data Ouput Reset Control (Write Only)\nWriting 1 to each bit can reset LPIOn pin output data to 0.\nNote 1: This bit field is write only, reading this field will response with 0.\nNote 2: Writing 1 to DRESET[n] will make DOUT[n] reflect the reset value.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No action</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Reset LPIOn to 0</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>write-only</access>
            </field>
          </fields>
       </register>
