wosayttn/sdk-bsp-numaker-m55m1/Debug/svd/M55M1.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>GDMA</name>
      <description>GDMA Register Map</description>
      <groupName>GDMA</groupName>
      <baseAddress>0x4004000</baseAddress>
      <!-- d -> no access permission -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x8</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x28</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x40</offset>
        <size>0x8</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x100</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x108</offset>
        <size>0x8</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x114</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x1F0</offset>
        <size>0x14</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x208</offset>
        <size>0x8</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x214</offset>
        <size>0x8</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2F0</offset>
        <size>0x10</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xFB0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xFB8</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xFC8</offset>
        <size>0xC</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xFE0</offset>
        <size>0x34</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x1018</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x1020</offset>
        <size>0x2C</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x1070</offset>
        <size>0xC</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x1088</offset>
        <size>0xC</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x10C8</offset>
        <size>0x8</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x10E8</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x10F8</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x1100</offset>
        <size>0x14</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x1118</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x1120</offset>
        <size>0x2C</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x1170</offset>
        <size>0xC</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x1188</offset>
        <size>0xC</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x11C8</offset>
        <size>0x8</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x11E8</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x11F8</offset>
        <size>0x8</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
       <register>
          <name>GDMA_SCFG_CHSEC0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>GDMA_SCFG_CHSEC0</displayName>
          <description>GDMA Secure Configuration Channel Security Mapping Register 0</description>
          <addressOffset>0x0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SCFGCHSEC0</name>
              <description>Secure Configuration Channel Security Mapping for Channel 0 to 31\nWhen [i] set to '1', CH is Non-secure world, else Secure world. The NUM_CHANNELS parameter limits this field, unused bits are RAZWI.\nValue for bit[i] can only be changed if the selected channel is not enabled, so reading back the register content is needed to check the success of the change.\nNote:The field is RAZ/WI when the following condition is False: SECEXT_PRESENT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>GDMA_SCFG_TRIGINSEC0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>GDMA_SCFG_TRIGINSEC0</displayName>
          <description>GDMA Secure Configuration Trigger Input Security Mapping Register 0</description>
          <addressOffset>0x8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SCFGTRIGINSEC0</name>
              <description>Secure Configuration Channel Security Mapping for Channel 0 to 31\nWhen [i] set to '1', CH is Non-secure world, else Secure world. The NUM_CHANNELS parameter limits this field, unused bits are RAZWI.\nValue for bit[i] can only be changed if the selected channel is not enabled, so reading back the register content is needed to check the success of the change.\nNote:The field is RAZ/WI when the following condition is False: SECEXT_PRESENT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>GDMA_SCFG_TRIGOUTSEC0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>GDMA_SCFG_TRIGOUTSEC0</displayName>
          <description>GDMA Secure Configuration Trigger Output Security Mapping Register 0</description>
          <addressOffset>0x28</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SCFGTRIGOUTSEC0</name>
              <description>Secure Configuration Tigger Output Security Mapping\nWhen [i] set to '1', Trigger Output is Non-secure world, else Secure world. The NUM_TRIGGER_OUT parameter limits this field, unused bits are RAZWI. Value for bit[i] can only be changed if the trigger output port is not in use, so reading back the register content is needed to check the success of the change. The field is RAZ/WI when the following condition is False: SECEXT_PRESENT  (1)  (NUM_TRIGGER_OUT  0)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>GDMA_SCFG_CTRL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>GDMA_SCFG_CTRL</displayName>
          <description>GDMA Secure Configuration Control</description>
          <addressOffset>0x40</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INTREN_SECACCVIO</name>
              <description>Secure Access Violation Interrupt Enable\nNote: The field is RAZ/WI when the following condition is False: SECEXT_PRESENT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No interrupt</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Interrupt raised for security violation</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>RSPTYPE_SECACCVIO</name>
              <description>Secure Access Violation response type configuration\nNote: The field is RAZ/WI when the following condition is False: SECEXT_PRESENT</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>RAZWI</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Bus error</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC_CFG_LCK</name>
              <description>Security Configuration Lock\nWhen set to '1', only SCFG.STAT_SECACCVIO can be cleared, all other register fields in this block become read-only. Once set to '1', this field can only be set back to '0' by reset. The field is RAZ/WI when the following condition is False: SECEXT_PRESENT</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>GDMA_INTRSTATUS</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>GDMA_INTRSTATUS</displayName>
          <description>GDMA Secure Configuration Interrupt Status</description>
          <addressOffset>0x44</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INTR_SECACCVIO</name>
              <description>Secure Access Violation Interrupt Status\nNote: The field is RAZ/WI when the following condition is False: SECEXT_PRESENT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Cleared automatically when STAT_SECACCVIO is cleared</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>When SCFG.STAT_SECACCVIO is asserted and SCFG.INTREN_SECACCVIO = 1</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>STA_SECACCVIO</name>
              <description>Secure Access Violation Status\nSet to '1' when a security violation occurred. Write '1' to clear.\nNote: The field is RAZ/WI when the following condition is False: SECEXT_PRESENT</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>GDMA_SEC_CHINTRSTATUS0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>GDMA_SEC_CHINTRSTATUS0</displayName>
          <description>GDMA Secure Channel Interrupt Status Register 0</description>
          <addressOffset>0x100</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CHINTRSTATUS0</name>
              <description>Secure Channel Interrupt flags for Channel 0 to 31\nCollated Secure Channel Interrupt flags for channel 0 to Channel 31. Limited by NUM_CHANNELS, all unimplemented bits are reserved. The field is RAZ/WI when the following condition is False: SECEXT_PRESENT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>GDMA_SEC_STATUS</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>GDMA_SEC_STATUS</displayName>
          <description>GDMA Secure Status Register</description>
          <addressOffset>0x108</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INTR_ANYCHINTR</name>
              <description>Combined Secure Channel Interrupt Flag\nNote: The field is RAZ/WI when the following condition is False: SECEXT_PRESEN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Cleared automatically when the source of the channel interrupt is cleared</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>When any Secure channel has an interrupt request in CHINTRSTATUS0 and SECCTRL.INTREN_ANYCHINTR = 1</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>INTR_ALLCHIDLE</name>
              <description>All Secure Channel Idle Interrupt Status\nNote: The field is RAZ/WI when the following condition is False: SECEXT_PRESENT</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Cleared automatically when STAT_ALLCHIDLE is cleared</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>When SECCTRL.STAT_ALLCHIDLE is asserted and SECCTRL.INTREN_ALLCHIDLE = 1</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>INTR_ALLCHSTOPPED</name>
              <description>All Secure Channel Stopped Interrupt Status\nNote: The field is RAZ/WI when the following condition is False: SECEXT_PRESENT</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Cleared automatically when STAT_ALLCHSTOPPED is cleared</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>When SECCTRL.STAT_ALLCHSTOPPED is asserted and SECCTRL.INTREN_ALLCHSTOPPED = 1</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>INTR_ALLCHPAUSED</name>
              <description>All Secure Channel Paused Interrupt Status\nNote: The field is RAZ/WI when the following condition is False: SECEXT_PRESENT</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Cleared automatically when STAT_ALLCHPAUSED is cleared</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>When SECCTRL.STAT_ALLCHPAUSED is asserted and SECCTRL.INTREN_ALLCHPAUSED = 1</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>STAT_ALLCHIDLE</name>
              <description>All Secure Channel Idle Status\nNote: The field is RAZ/WI when the following condition is False: SECEXT_PRESEN</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Cleared by writing '1' to this bit</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Whenever all Secure DMA channel is in idle state after at least one channel was running</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>STAT_ALLCHSTOPPED</name>
              <description>All Secure Channel Stopped Status\nNote: The field is RAZ/WI when the following condition is False: SECEXT_PRESENT</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Cleared by writing '1' to this bit. The ALLCHSTOP request is also cleared when this bit is cleared</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Whenever all Secure DMA channels are in stopped or inactive state and the ALLCHSTOP request is active. Not set when channels reach the stopped state for other reasons. All Secure channels are forced to an immediate stopped state until ALLCHSTOP request is asserted even if they were enabled after the request</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>STAT_ALLCHPAUSED</name>
              <description>All Secure Channel Paused Status\nNote: The field is RAZ/WI when the following condition is False: SECEXT_PRESEN</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Cleared by writing '1' to this bit which results in all secure channels to resume their operation. The ALLCHPAUSE request is also cleared when this bit is cleared</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Whenever all Secure DMA channel is in paused or inactive state and the ALLCHPAUSE request is active. Not set when channels reach the paused state for other reasons. All Secure channels are forced to an immediate pause until ALLCHPAUSE request is asserted even if they were enabled after the request</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
