wosayttn/sdk-bsp-numaker-m55m1/Debug/svd/M55M1.svd
       <register>
          <name>GDMA_SEC_CTRL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>GDMA_SEC_CTRL</displayName>
          <description>GDMA Secure Control Register</description>
          <addressOffset>0x10C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INTREN_ANYCHINTR</name>
              <description>Combined Secure Channel Interrupt Enable\nThe field is RAZ/WI when the following condition is False: SECEXT_PRESENT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTREN_ALLCHIDLE</name>
              <description>All Secure Channel Idle Interrupt Enable\nThe field is RAZ/WI when the following condition is False: SECEXT_PRESENT</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTREN_ALLCHSTOPPED</name>
              <description>All Secure Channels Stopped Interrupt Enable\nThe field is RAZ/WI when the following condition is False: SECEXT_PRESENT</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTREN_ALLCHPAUSED</name>
              <description>All Secure Channel Paused Interrupt Enable\nThe field is RAZ/WI when the following condition is False: SECEXT_PRESENT</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ALLCHSTOP</name>
              <description>Secure All Channel Stop Request\nNote: The field is RAZ/ WI when the following condition is False: SECEXT_PRESENT</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Cleared automatically when the STAT_ALLCHSTOPPED status flag is cleared</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>All Secure channels get a stop request. Stays asserted until the STAT_ALLCHSTOPPED status flag is set</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>ALLCHPAUSE</name>
              <description>Secure All Channel Pause Request\nNote: The field is RAZ/WI when the following condition is False: SECEXT_PRESENT</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Cleared automatically when the STAT_ALLCHPAUSED status flag is cleared</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>All Secure channels get a pause request. Stays asserted until the channels are paused and the STAT_ALLCHPAUSED status flag is set</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>DBGHALTNSRO</name>
              <description>Debug Halt Enable Non-Secure Read Only\nNote: The field is RAZ/WI when the following condition is False: SECEXT_PRESENT</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>NSEC_CTRL.DBGHALTEN has read-write access. This register allows the secure SW to limit the non-secure SW adjusting the common DBGHALTEN register bit</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The NSEC_CTRL.DBGHALTEN register becomes read-only</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>DBGHALTEN</name>
              <description>Debug Halt Enabled\nNote: The field is RAZ/WI when the following condition is False: SECEXT_PRESENT</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>The DMA ignores the halt request from an external debugger. Clearing this bit while halt is ongoing results in continuing the operation</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The debugger request to halt the DMA is allowed for all channels. This field is common for non-secure and secure side of the DMA, but control can be limited by the SEC_CTRL.DBGHALTNSRO register field</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>IDLERETEN</name>
              <description>Idle Channel Retention Enable\nAllows retention for Secure channels that are enabled and waiting for an event in IDLE state.\nNote: The field is RAZ/WI when the following condition is False: SECEXT_PRESENT  (1)</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>DISMINPWR</name>
              <description>Minimum Power state of the DMAC when at least one secure channel is present\nNote: The field is RAZ/WI when the following condition is False: SECEXT_PRESEN</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>OFF</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Retention</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>ON</description>
                    <value>#10</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>GDMA_SEC_CHPTR</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>GDMA_SEC_CHPTR</displayName>
          <description>GDMA Secure Channel Pointer</description>
          <addressOffset>0x114</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CHPTR</name>
              <description>Secure Channel Pointer\nSelects which channel settings can be adjusted by the following registers. The field is RAZ/WI when the following condition is False: SECEXT_PRESENT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>GDMA_SEC_STATUSPTR</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>GDMA_SEC_STATUSPTR</displayName>
          <description>GDMA Secure Unit Status Pointer Register</description>
          <addressOffset>0x1F0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SECSTATUSPTR</name>
              <description>Secure DMA Unit Status Pointer\nSecure DMA Unit status pointer used to select which status value to view using STATUSVALUE register. Pointer values are:\nNote: The field is RAZ/WI when the following condition is False: SECEXT_PRESENT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Channel Enabled Status for channel numbers [31:0]</description>
                    <value>0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Reserved.</description>
                    <value>1</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>Channel Stopped Status for channel numbers [31:0]</description>
                    <value>2</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Reserved.</description>
                    <value>3</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>4</name>
                    <description>Channel Paused Status for channel numbers [31:0]</description>
                    <value>4</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>GDMA_SEC_STATUSVAL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>GDMA_SEC_STATUSVAL</displayName>
          <description>GDMA Secure Unit Status Value Register</description>
          <addressOffset>0x1F4</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SECSTATUSVAL</name>
              <description>Secure DMA Unit status value\nCan be used for reading internal status values of the DMA Unit for debug purposes. Values shown here are dependent on STATUSPTR. Note that inputs are masked by security mapping before being presented here. This means that only status values mapped to Secure world are visible as non-Zero values. All unimplemented bits are RAZWI. The field is RAZ/WI when the following condition is False: SECEXT_PRESENT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>GDMA_SEC_SIGNALPTR</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>GDMA_SEC_SIGNALPTR</displayName>
          <description>GDMA Secure Unit Signal Pointer</description>
          <addressOffset>0x1F8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SECSIGNALPTR</name>
              <description>Secure DMA Unit Signal Pointer\nSecure DMA Unit signal pointer used to select which inputs to view using SIGNALVAL register. Pointer values, x, are:\nNote: The field is RAZ/WI when the following condition is False: SECEXT_PRESENT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>GDMA_SEC_SIGNALVAL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>GDMA_SEC_SIGNALVAL</displayName>
          <description>GDMA Secure Unit Signal Value Register</description>
          <addressOffset>0x1FC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SECSIGNALVAL</name>
              <description>Secure DMA Unit signal status\nCan be used for reading signal values of triggers and GPOs for debug. Values shown here are dependent on SIGNALPTR. Note that inputs are masked by security mapping before being presented here. This means that only signal values mapped to Secure world are visible as non-zero values. Writing to this register has the following effect:\nWriting '1' to a Trigger Input Request that are not selected by any DMA channel will cause a deny response for it. This can attempt to clear an unwanted trigger input.\nWriting '1' to any Trigger Output Acknowledges status, GPO value and all Trigger Input Request selected by any DMA channel is ignored. All unimplemented bits are RAZWI.\nNote: The field is RAZ/WI when the following condition is False: SECEXT_PRESENT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>GDMA_NSEC_CHINTRSTATUS0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>GDMA_NSEC_CHINTRSTATUS0</displayName>
          <description>GDMA Non-Secure Channel Interrupt Status Register 0</description>
          <addressOffset>0x200</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CHINTRSTATUS0</name>
              <description>Channel Interrupt Status\nCollated Non-Secure Channel Interrupt flags for channel 0 to channel 31. Limited by NUM_CHANNELS, all unimplemented bits are reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>GDMA_NSEC_STATUS</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>GDMA_NSEC_STATUS</displayName>
          <description>GDMA Non-Secure Status Register</description>
          <addressOffset>0x208</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INTR_ANYCHINTR</name>
              <description>Combined Non-Secure Channel Interrupt Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Cleared automatically when the source of the channel interrupt is cleared</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>When any Non-secure channel has an interrupt request in CHINTRSTATUS0 and NSECCTRL.INTREN_ANYCHINTR = 1</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>INTR_ALLCHIDLE</name>
              <description>All Non-Secure Channel Idle Interrupt Status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Cleared automatically when STAT_ALLCHIDLE is cleared</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>When NSECCTRL.STAT_ALLCHIDLE is asserted and NSECCTRL.INTREN_ALLCHIDLE = 1</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>INTR_ALLCHSTOPPED</name>
              <description>All Non-Secure Channel Stopped Interrupt Status</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Cleared automatically when STAT_ALLCHSTOPPED is cleared</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>When NSECCTRL.STAT_ALLCHSTOPPED is asserted and NSECCTRL.INTREN_ALLCHSTOPPED = 1</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>INTR_ALLCHPAUSED</name>
              <description>All Non-Secure Channel Paused Interrupt Status</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Cleared automatically when STAT_ALLCHPAUSED is cleared</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>When NSECCTRL.STAT_ALLCHPAUSED is asserted and NSECCTRL.INTREN_ALLCHPAUSED = 1</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>STAT_ALLCHIDLE</name>
              <description>All Non-Secure Channel Idle Status</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Cleared by writing '1' to this bit</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Whenever all Non-secure DMA channel is in idle state after at least one channel was running</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>STAT_ALLCHSTOPPED</name>
              <description>All Non-Secure Channel Stopped Status</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>The ALLCHSTOP request is also cleared when this bit is cleared</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Whenever all Non-secure DMA channels are in stopped or inactive state and the ALLCHSTOP request is active. Not set when channels reach the stopped state for other reasons. All Non-secure channels are forced to an immediate stopped state until ALLCHSTOP request is asserted even if they were enabled after the request. Cleared by writing '1' to this bit</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>STAT_ALLCHPAUSED</name>
              <description>All Non-Secure Channel Paused Status</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>The ALLCHPAUSE request is also cleared when this bit is cleared</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Whenever all Non-secure DMA channel is in paused or inactive state and the ALLCHPAUSE request is active. Not set when channels reach the paused state for other reasons. All Non-secure channels are forced to an immediate pause until ALLCHPAUSE request is asserted even if they were enabled after the request. Cleared by writing '1' to this bit which results in all Nonsecure channels to resume their operation</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
