wosayttn/sdk-bsp-numaker-m55m1/Debug/svd/M55M1.svd
       <register>
          <name>GDMA_NSEC_CTRL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>GDMA_NSEC_CTRL</displayName>
          <description>GDMA Non-Secure Control Register</description>
          <addressOffset>0x20C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INTREN_ANYCHINTR</name>
              <description>Combined Non-Secure Channel Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTREN_ALLCHIDLE</name>
              <description>All Non-Secure Channel Idle Interrupt Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTREN_ALLCHSTOPPED</name>
              <description>All Non-Secure Channels Stopped Interrupt Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTREN_ALLCHPAUSED</name>
              <description>All Non-Secure Channel Paused Interrupt Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ALLCHSTOP</name>
              <description>Non-Secure All Channel Stop Request</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Cleared automatically when the STAT_ALLCHSTOPPED status flag is cleared</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>All Non-secure channels get a stop request. Stays asserted until the STAT_ALLCHSTOPPED status flag is set</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>ALLCHPAUSE</name>
              <description>Non-Secure All Channel Pause Request</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Cleared automatically when the STAT_ALLCHPAUSED status flag is cleared</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>All Non-secure channels get a pause request. Stays asserted until the channels are paused and the STAT_ALLCHPAUSED status flag is set</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>DBGHALTNSRO</name>
              <description>Debug Halt Enable Non-Secure Read Only\nNote: This register is read-only for the non-secure SW</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>NSEC_CTRL.DBGHALTEN has read-write access</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The NSEC_CTRL.DBGHALTEN register becomes read-only</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>DBGHALTEN</name>
              <description>Debug Halt Enabled</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>The DMA ignores the halt request from an external debugger. Clearing this bit while halt is ongoing results in continuing the operation</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The debugger request to halt the DMA is allowed. This field is common for non-secure and secure side of the DMA, but access to this register is limited by the DBGHALTNSRO register field</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>IDLERETEN</name>
              <description>Idle Channel Retention Enable\nAllows retention for non-secure channels that are enabled and waiting for an event in IDLE state.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>DISMINPWR</name>
              <description>Minimum Power state of the DMAC when at least one non-secure channel is present</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>OFF</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Retention</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>ON</description>
                    <value>#10</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>GDMA_NSEC_CHPTR</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>GDMA_NSEC_CHPTR</displayName>
          <description>GDMA Non-Secure Channel Pointer</description>
          <addressOffset>0x214</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CHPTR</name>
              <description>Non-Secure Channel Pointer\nSelects which channel settings can be adjusted by the following registers</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>GDMA_NSEC_CHCFG</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>GDMA_NSEC_CHCFG</displayName>
          <description>GDMA Non-Secure Channel Configuration Register</description>
          <addressOffset>0x218</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CHID</name>
              <description>Non-Secure Channel ID value\nNSECCHPTR selects the channel ID value to be read or written via this register. CHID_WIDTH limits this field, unused bits are RAZWI. The field is RAZ/WI when the following condition is False: CHID_WIDTH  0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CHIDVLD</name>
              <description>Non-Secure Channel ID valid\nNSECCHPTR selects the channel. Set to '1' to drive the channel ID value in CHID for all the transfers by the selected channel. The field is RAZ/WI when the following condition is False: CHID_WIDTH  0</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CHPRIV</name>
              <description>Non-Secure Channel Privilege Enable\nNSECCHPTR selects the channel.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>The channel is only allowed to send unprivileged transfers and the channel registers can be accessed by both privileged and unprivileged register accesses</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>It allows the channel to send transfers marked as Privileged only. The configuration registers of the selected channel are also given privileged only access rights</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>GDMA_NSEC_STATUSPTR</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>GDMA_NSEC_STATUSPTR</displayName>
          <description>GDMA Non-Secure Unit Status Pointer Register</description>
          <addressOffset>0x2F0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>NSECSTATUSPTR</name>
              <description>Non-Secure DMA Unit status pointer\nUsed to select which status value to view using STATUSVALUE register. Pointer values are:</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Channel Enabled Status for channel numbers [31:0]</description>
                    <value>0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Reserved.</description>
                    <value>1</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>Channel Stopped Status for channel numbers [31:0]</description>
                    <value>2</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Reserved.</description>
                    <value>3</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>4</name>
                    <description>Channel Paused Status for channel numbers [31:0]</description>
                    <value>4</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>GDMA_NSEC_STATUSVAL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>GDMA_NSEC_STATUSVAL</displayName>
          <description>GDMA Non-Secure Unit Status Value Register</description>
          <addressOffset>0x2F4</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>NSECSTATUSVAL</name>
              <description>Non-Secure DMA Unit status value\nCan be used for reading internal status values of the DMA Unit for debug purposes. Values shown here are dependent on STATUSPTR. Note that inputs are masked by security mapping before being presented here. This means that only status values mapped to Non-secure world are visible as non-Zero values. All unimplemented bits are RAZWI.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>GDMA_NSEC_SIGNALPTR</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>GDMA_NSEC_SIGNALPTR</displayName>
          <description>GDMA Non-Secure Unit Signal Pointer</description>
          <addressOffset>0x2F8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>NSECSINGALPTR</name>
              <description>Non-Secure DMA Unit signal pointer\nUsed to select which inputs or outputs to view using SIGNALVAL register. Pointer values, x, are:</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Trigger Input Requests [31+32x : 32x]</description>
                    <value>0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Trigger Input Requests [31+32x : 32x]</description>
                    <value>1</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>Trigger Input Requests [31+32x : 32x]</description>
                    <value>2</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Trigger Input Requests [31+32x : 32x]</description>
                    <value>3</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>4</name>
                    <description>Trigger Input Requests [31+32x : 32x]</description>
                    <value>4</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>5</name>
                    <description>Trigger Input Requests [31+32x : 32x]</description>
                    <value>5</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>6</name>
                    <description>Trigger Input Requests [31+32x : 32x]</description>
                    <value>6</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>7</name>
                    <description>Trigger Input Requests [31+32x : 32x]</description>
                    <value>7</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>8</name>
                    <description>Trigger output Acknowledges [31+32(x-8) : 32(x-8)]</description>
                    <value>8</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>9</name>
                    <description>Trigger output Acknowledges [31+32(x-8) : 32(x-8)]</description>
                    <value>9</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>10</name>
                    <description>GPO output value [31+32(x-10) : 32(x-10)], only present when HAS_GPOSEL is set</description>
                    <value>10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>11</name>
                    <description>GPO output value [31+32(x-10) : 32(x-10)], only present when HAS_GPOSEL is set</description>
                    <value>11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>GDMA_NSEC_SIGNALVAL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>GDMA_NSEC_SIGNALVAL</displayName>
          <description>GDMA Non-Secure Unit Signal Value Register</description>
          <addressOffset>0x2FC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>NSECSIGNALVAL</name>
              <description>Non-Secure DMA Unit signal status\nCan be used for reading signal values of triggers and GPOs for debug. Values shown here are dependent on SIGNALPTR. Note that inputs are masked by security mapping before being presented here. This means that only signals mapped to Non-secure world are visible as non-zero values. Writing to this register has the following effect:\nWriting '1' to a Non-secure Trigger Input Request that are not selected by any DMA channel will cause a deny response for it. This can attempt to clear an unwanted trigger input.\nWriting '1' to any Trigger Output Acknowledges status, GPO status and all Trigger Input Request already selected by any DMA channel is ignored. All unimplemented bits are RAZWI.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>GDMA_DMA_BUILDCFG0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>GDMA_DMA_BUILDCFG0</displayName>
          <description>GDMA DMA Build Configuration Register 0</description>
          <addressOffset>0xFB0</addressOffset>
          <access>read-only</access>
          <resetValue>0x00037C10</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FRAMETYPE</name>
              <description>Register Frame Type\nNote: Each frame replicates the Information fields.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Combined Frame</description>
                    <value>#000</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Security Configuration Frame</description>
                    <value>#001</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>Secure Control Frame, or if TrustZone not implemented, Control Frame</description>
                    <value>#010</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Non-Secure Control Frame</description>
                    <value>#011</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>4</name>
                    <description>DMA Channel Frame</description>
                    <value>#100</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>NUM_CHANNELS</name>
              <description>Number of Channels \nNumber of Channels + 1 supported by the DMAC</description>
              <bitOffset>4</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ADDR_WIDTH</name>
              <description>Address Width </description>
              <bitOffset>10</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DATA_WIDTH</name>
              <description>Data Width</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>8-bit</description>
                    <value>#000</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>16-bit</description>
                    <value>#001</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>32-bit</description>
                    <value>#010</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>64-bit</description>
                    <value>#011</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>4</name>
                    <description>128-bit</description>
                    <value>#100</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>5</name>
                    <description>256-bit</description>
                    <value>#101</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>6</name>
                    <description>512-bit</description>
                    <value>#110</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>7</name>
                    <description>1024-bit</description>
                    <value>#111</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>CHID_WIDTH</name>
              <description>Channel ID Width</description>
              <bitOffset>20</bitOffset>
              <bitWidth>5</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>means CHID is not present</description>
                    <value>0</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
          </fields>
       </register>
