wosayttn/sdk-bsp-numaker-m55m1/Debug/svd/M55M1.svd
       <register derivedFrom="GDMA_CH0_INTREN">
          <name>GDMA_CH1_INTREN</name>
          <displayName>GDMA_CH1_INTREN</displayName>
          <description>GDMA Channel Interrupt Enable Register</description>
          <addressOffset>0x1108</addressOffset>
       </register>
       <register>
          <name>GDMA_CH0_CTRL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>GDMA_CH0_CTRL</displayName>
          <description>GDMA Channel Control  Register</description>
          <addressOffset>0x100C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00200200</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TRANSIZE</name>
              <description>Transfer Entity Size\nNote that DATA_WIDTH limits this field. Address will be aligned to TRANSIZE by the DMAC by ignoring the lower bits.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Byte</description>
                    <value>#000</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Halfworld</description>
                    <value>#001</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>Word</description>
                    <value>#010</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Doubleword</description>
                    <value>#011</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>4</name>
                    <description>128-bits</description>
                    <value>#100</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>5</name>
                    <description>256-bits</description>
                    <value>#101</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>6</name>
                    <description>512-bits</description>
                    <value>#110</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>7</name>
                    <description>1024-bits</description>
                    <value>#111</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>CHPRIO</name>
              <description>Channel Priority</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Lowest Priority</description>
                    <value>0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>15</name>
                    <description>Highest Priority</description>
                    <value>15</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>XTYPE</name>
              <description>Operation type for X direction</description>
              <bitOffset>9</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>'disable' - No data transfer will take place for this command. This mode can be used to create empty commands that wait for an event or set GPOs</description>
                    <value>#000</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>'continue' - Copy data in a continuous manner from source to the destination</description>
                    <value>#001</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>'wrap' - Wrap source data within a destination line when the end of the source line is reached. Read starts again from the beginning of the source line and copied to the remainder of the destination line</description>
                    <value>#010</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>'fill' - Fill the remainder of the destination line with FILLVAL when the end of the source line is reached. If the DESXSIZE is smaller than SRCXSIZE then the behavior is UNPREDICTABLE. Not supported when HAS_WRAP is 0 in HW</description>
                    <value>#011</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>YTYPE</name>
              <description>Operation type for Y direction\nNote: The field is RAZ/WI when the following condition is False: CH_EXT_FEAT_EN</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>'disable' - Only do 1D transfers. When HAS_2D is 0, meaning 2D capability is not supported in HW, the YTYPE is always '000'</description>
                    <value>#000</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>'continue' - Copy 2D data in a continuous manner from source area to the destination area by using the YSIZE registers. The copy stops when the source runs out of data or the destination runs out of space. Not supported when HAS_2D is 0 in HW</description>
                    <value>#001</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>'wrap' - Wrap the 2D source area within the destination 2D area by starting to copy data from the beginning of the first source line to the remaining space in the destination area. If the destination area is smaller than the source area then the behavior is UNPREDICTABLE. Not supported when HAS_WRAP or HAS_2D is 0 in HW</description>
                    <value>#010</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Fill the remainder of the destination area with FILLVAL when the source area runs out of data. If the destination area is smaller than the source area then the behavior is UNPREDICTABLE. Not supported when HAS_WRAP or HAS_2D is 0 in HW</description>
                    <value>#011</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>REGRELOADTYPE</name>
              <description>Automatic register reload type\nDefines how the DMA command reloads initial values at the end of a DMA command before autorestarting, ending or linking to a new DMA command: - 000: Reload Disabled.\nNote: When CLEARCMD is set, the reloaded registers will also be cleared</description>
              <bitOffset>18</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Reload source and destination size registers only</description>
                    <value>#001</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Reload source address only and all source and destination size registers</description>
                    <value>#011</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>5</name>
                    <description>Reload destination address only and all source and destination size registers</description>
                    <value>#101</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>7</name>
                    <description>Reload source and destination address and all source and destination size registers</description>
                    <value>#111</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>DONETYPE</name>
              <description>Done type selection\nThis field defines when the STAT_DONE status flag is asserted during the command operation.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>STAT_DONE flag is not asserted for this command</description>
                    <value>#000</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>End of a command, before jumping to the next linked command. (default)</description>
                    <value>#001</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>End of an autorestart cycle, before starting the next cycle</description>
                    <value>#011</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>DONEPAUSEEN</name>
              <description>Done pause enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>The assertion of the STAT_DONE does not pause the progress of the command and the next operation of the channel will be started immediately after the STAT_DONE flag is set</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The assertion of the STAT_DONE flag results in an automatic pause request for the current DMA operation. When the paused state is reached the STAT_RESUMEWAIT flag is also set</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>USESRCTRIGIN</name>
              <description>Enable Source Trigger Input use for this command</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Disable</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Enable</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>USEDESTRIGIN</name>
              <description>Enable Destination Trigger Input use for this command</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Disable</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Enable</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>USETRIGOUT</name>
              <description>Enable Trigger Output use for this command</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Disable</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Enable</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>USEGPO</name>
              <description>Enable GPO use for this command\n (CH_GPO_EN * GPO_WIDTH)  0</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Disable</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Enable the field is RAZ/WI when the following condition is False:</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>USESTREAM</name>
              <description>Enable Stream Interface use for this command</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Disable</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Enable the field is RAZ/WI when the following condition is False: CH_STREAM_EN</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="GDMA_CH0_CTRL">
          <name>GDMA_CH1_CTRL</name>
          <displayName>GDMA_CH1_CTRL</displayName>
          <description>GDMA Channel Control  Register</description>
          <addressOffset>0x110C</addressOffset>
       </register>
       <register>
          <name>GDMA_CH0_SRCADDR</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>GDMA_CH0_SRCADDR</displayName>
          <description>GDMA Channel Source Address Register</description>
          <addressOffset>0x1010</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SRCADDR</name>
              <description>Source Address[31:0]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="GDMA_CH0_SRCADDR">
          <name>GDMA_CH1_SRCADDR</name>
          <displayName>GDMA_CH1_SRCADDR</displayName>
          <description>GDMA Channel Source Address Register</description>
          <addressOffset>0x1110</addressOffset>
       </register>
       <register>
          <name>GDMA_CH0_DESADDR</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>GDMA_CH0_DESADDR</displayName>
          <description>GDMA Channel Destination Address Register</description>
          <addressOffset>0x1018</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DESADDR</name>
              <description>Destination Address[31:0]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="GDMA_CH0_DESADDR">
          <name>GDMA_CH1_DESADDR</name>
          <displayName>GDMA_CH1_DESADDR</displayName>
          <description>GDMA Channel Destination Address Register</description>
          <addressOffset>0x1118</addressOffset>
       </register>
       <register>
          <name>GDMA_CH0_XSIZE</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>GDMA_CH0_XSIZE</displayName>
          <description>GDMA Channel X Dimension Size Register, Lower Bits [15:0]</description>
          <addressOffset>0x1020</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SRCXSIZE</name>
              <description>Source Number of Transfers in the X Dimension lower bits [15:0]\nThis register along with SRCXSIZEHI defines the source data block size of the DMA operation for any 1D operation, and defines the X dimension of the 2D source block for 2D operation.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DESXSIZE</name>
              <description>Destination Number of Transfers in the X Dimension lower bits [15:0]\nThis register along with DESXSIZEHI defines the destination data block size of the DMA operation for or any 1D operation, and defines the X dimension of the 2D destination block for a 2D operation. HAS_WRAP or HAS_STREAM configuration needs to be set to allow writes to this register, otherwise it is read-only and writing to SRCXSIZE will also update the value of this register</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="GDMA_CH0_XSIZE">
          <name>GDMA_CH1_XSIZE</name>
          <displayName>GDMA_CH1_XSIZE</displayName>
          <description>GDMA Channel X Dimension Size Register, Lower Bits [15:0]</description>
          <addressOffset>0x1120</addressOffset>
       </register>
       <register>
          <name>GDMA_CH0_XSIZEHI</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>GDMA_CH0_XSIZEHI</displayName>
          <description>GDMA Channel X Dimension Size Register, High Bits [31:16]</description>
          <addressOffset>0x1024</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SRCXSIZEHI</name>
              <description>Source Number of Transfers in the X Dimension high bits [31:16]\nThis register along with SRCXSIZE defines the source data block size of the DMA operation for any 1D operation, and defines the X dimension of the 2D source block for 2D operation.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DESXSIZEHI</name>
              <description>Destination Number of Transfers in the X Dimension high bits [31:16]\nThis register along with DESXSIZE defines the destination data block size of the DMA operation for or any 1D operation, and defines the X dimension of the 2D destination block for a 2D operation. HAS_WRAP or HAS_STREAM configuration needs to be set to allow writes to this register, otherwise it is readonly and writing to SRCXSIZEHI will also update the value of this register.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="GDMA_CH0_XSIZEHI">
          <name>GDMA_CH1_XSIZEHI</name>
          <displayName>GDMA_CH1_XSIZEHI</displayName>
          <description>GDMA Channel X Dimension Size Register, High Bits [31:16]</description>
          <addressOffset>0x1124</addressOffset>
       </register>
