wosayttn/sdk-bsp-numaker-m55m1/Debug/svd/M55M1.svd
       <register derivedFrom="GDMA_CH0_SRCTRANSCFG">
          <name>GDMA_CH1_SRCTRANSCFG</name>
          <displayName>GDMA_CH1_SRCTRANSCFG</displayName>
          <description>GDMA Channel Source Transfer Configuration Register</description>
          <addressOffset>0x1128</addressOffset>
       </register>
       <register>
          <name>GDMA_CH0_DESTRANSCFG</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>GDMA_CH0_DESTRANSCFG</displayName>
          <description>GDMA Channel Destination Transfer Configuration Register</description>
          <addressOffset>0x102C</addressOffset>
          <access>read-write</access>
          <resetValue>0x000F0400</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DESMEMATTRLO</name>
              <description>Destination Transfer Memory Attribute field [3:0]\nWhen DESMEMATTRHI is Device type (0000) then this field means:</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Device-nGnRnE.\nReserved</description>
                    <value>#0000</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Normal memory, Inner Write allocate, Inner Write-through transient</description>
                    <value>#0001</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>Normal memory, Inner Read allocate, Inner Write-through transient</description>
                    <value>#0010</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Normal memory, Inner Read/Write allocate, Inner Write-through transient</description>
                    <value>#0011</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>4</name>
                    <description>Device-nGnRE.\nNormal memory, Inner non-cacheable</description>
                    <value>#0100</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>5</name>
                    <description>Normal memory, Inner Write allocate, Inner Write-back transient</description>
                    <value>#0101</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>6</name>
                    <description>Normal memory, Inner Read allocate, Inner Write-back transient</description>
                    <value>#0110</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>7</name>
                    <description>Normal memory, Inner Read/Write allocate, Inner Write-back transient</description>
                    <value>#0111</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>8</name>
                    <description>Device-nGRE.\nNormal memory, Inner Write-through non-transient</description>
                    <value>#1000</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>9</name>
                    <description>Normal memory, Inner Write allocate, Inner Write-through non-transient</description>
                    <value>#1001</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>10</name>
                    <description>Normal memory, Inner Read allocate, Inner Write-through non-transient</description>
                    <value>#1010</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>11</name>
                    <description>Normal memory, Inner Read/Write allocate, Inner Write-through non-transient</description>
                    <value>#1011</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>12</name>
                    <description>Device-GRE.\nNormal memory, Inner Write-back non-transient</description>
                    <value>#1100</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>13</name>
                    <description>Normal memory, Inner Write allocate, Inner Write-back non-transient</description>
                    <value>#1101</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>14</name>
                    <description>Normal memory, Inner Read allocate, Inner Write-back non-transient</description>
                    <value>#1110</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>15</name>
                    <description>Normal memory, Inner Read/Write allocate, Inner Write-back non-transient</description>
                    <value>#1111</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>DESMEMATTRHI</name>
              <description>Destination Transfer Memory Attribute field [7:4]</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Device memory</description>
                    <value>#0000</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Normal memory, Outer Write allocate, Outer Write-through transient</description>
                    <value>#0001</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>Normal memory, Outer Read allocate, Outer Write-through transient</description>
                    <value>#0010</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Normal memory, Outer Read/Write allocate, Outer Write-through transient</description>
                    <value>#0011</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>4</name>
                    <description>Normal memory, Outer non-cacheable</description>
                    <value>#0100</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>5</name>
                    <description>Normal memory, Outer Write allocate, Outer Write-back transient</description>
                    <value>#0101</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>6</name>
                    <description>Normal memory, Outer Read allocate, Outer Write-back transient</description>
                    <value>#0110</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>7</name>
                    <description>Normal memory, Outer Read/Write allocate, Outer Write-back transient</description>
                    <value>#0111</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>8</name>
                    <description>Normal memory, Outer Write-through non-transient</description>
                    <value>#1000</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>9</name>
                    <description>Normal memory, Outer Write allocate, Outer Write-through non-transient</description>
                    <value>#1001</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>10</name>
                    <description>Normal memory, Outer Read allocate, Outer Write-through non-transient</description>
                    <value>#1010</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>11</name>
                    <description>Normal memory, Outer Read/Write allocate, Outer Write-through non-transient</description>
                    <value>#1011</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>12</name>
                    <description>Normal memory, Outer Write-back non-transient</description>
                    <value>#1100</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>13</name>
                    <description>Normal memory, Outer Write allocate, Outer Write-back non-transient</description>
                    <value>#1101</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>14</name>
                    <description>Normal memory, Outer Read allocate, Outer Write-back non-transient</description>
                    <value>#1110</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>15</name>
                    <description>Normal memory, Outer Read/Write allocate, Outer Write-back non-transient</description>
                    <value>#1111</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>DESSHAREATTR</name>
              <description>Destination Transfer Shareability Attribute</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Non-shareable</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Reserved.</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>Outer shareable</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Inner shareable</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>DESNONSECATTR</name>
              <description>Destination Transfer Non-secure Attribute</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Secure</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Non-secure When a channel is Non-secure this bit is tied to 1</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>DESPRIVATTR</name>
              <description>Destination Transfer Privilege Attribute</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Unprivileged</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Privileged When a channel is unprivileged this bit is tied to 0</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>DESMAXBURSTLEN</name>
              <description>Destination Max Burst Length\nHint for the DMA on what is the maximum allowed burst size it can use for write transfers. The maximum number of beats sent by the DMA for a write burst is equal to DESMAXBURSTLEN + 1. Default value is 16 beats, which allows the DMA to set all burst sizes. Note: Limited by the DATA_BUFF_SIZE so larger settings may not always result in larger bursts.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="GDMA_CH0_DESTRANSCFG">
          <name>GDMA_CH1_DESTRANSCFG</name>
          <displayName>GDMA_CH1_DESTRANSCFG</displayName>
          <description>GDMA Channel Destination Transfer Configuration Register</description>
          <addressOffset>0x112C</addressOffset>
       </register>
       <register>
          <name>GDMA_CH0_XADDRINC</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>GDMA_CH0_XADDRINC</displayName>
          <description>GDMA Channel X Dimension Address Increment Register</description>
          <addressOffset>0x1030</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SRCXADDRINC</name>
              <description>Source X dimension Address Increment</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DESXADDRINC</name>
              <description>Destination X dimension Address Increment</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="GDMA_CH0_XADDRINC">
          <name>GDMA_CH1_XADDRINC</name>
          <displayName>GDMA_CH1_XADDRINC</displayName>
          <description>GDMA Channel X Dimension Address Increment Register</description>
          <addressOffset>0x1130</addressOffset>
       </register>
       <register>
          <name>GDMA_CH0_YADDRSTRIDE</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>GDMA_CH0_YADDRSTRIDE</displayName>
          <description>GDMA Channel Y Dimension Address Stride Register</description>
          <addressOffset>0x1034</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SRCYADDRSTRIDE</name>
              <description>Source Address Stride between lines</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DESYADDRSTRIDE</name>
              <description>Destination Address Stride between lines</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="GDMA_CH0_YADDRSTRIDE">
          <name>GDMA_CH1_YADDRSTRIDE</name>
          <displayName>GDMA_CH1_YADDRSTRIDE</displayName>
          <description>GDMA Channel Y Dimension Address Stride Register</description>
          <addressOffset>0x1134</addressOffset>
       </register>
       <register>
          <name>GDMA_CH0_FILLVAL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>GDMA_CH0_FILLVAL</displayName>
          <description>GDMA Channel Fill Pattern Value Register</description>
          <addressOffset>0x1038</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FILLVAL</name>
              <description>Fill pattern value\nWhen XTYPE or YTYPE is set to fill mode, then this register value is used on the write data bus when the command starts to fill the memory area. The TRANSIZE defines the width of the FILLVAL used for the command. For byte transfers the FILLVAL[7:0] is used, other bits are ignored. For halfword transfers the FILLVAL[15:0] is used, other bits are ignored. For 64-bit and wider transfers the FILLVAL[31:0] pattern is repeated on the full width of the data bus. Not present when HAS_WRAP is 0.\nThe field is RAZ/WI when the following condition is False:\nCH_EXT_FEAT_EN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="GDMA_CH0_FILLVAL">
          <name>GDMA_CH1_FILLVAL</name>
          <displayName>GDMA_CH1_FILLVAL</displayName>
          <description>GDMA Channel Fill Pattern Value Register</description>
          <addressOffset>0x1138</addressOffset>
       </register>
       <register>
          <name>GDMA_CH0_YSIZE</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>GDMA_CH0_YSIZE</displayName>
          <description>GDMA Channel Y Dimensions Size Register</description>
          <addressOffset>0x103C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SRCYSIZE</name>
              <description>Source Y dimension or number of lines\nNot present when HAS_2D is 0. The field is RAZ/WI when the following condition is False: CH_EXT_FEAT_EN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DESYSIZE</name>
              <description>Destination Y dimension or number of lines\nNot present when HAS_2D is 0. HAS_WRAP or HAS_STREAM configuration needs to be set to allow writes to this register, otherwise it is read-only. The field is RAZ/WI when the following condition is False: CH_EXT_FEAT_EN</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="GDMA_CH0_YSIZE">
          <name>GDMA_CH1_YSIZE</name>
          <displayName>GDMA_CH1_YSIZE</displayName>
          <description>GDMA Channel Y Dimensions Size Register</description>
          <addressOffset>0x113C</addressOffset>
       </register>
       <register>
          <name>GDMA_CH0_TMPLTCFG</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>GDMA_CH0_TMPLTCFG</displayName>
          <description>GDMA Channel Template Configuration Register</description>
          <addressOffset>0x1040</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SRCTMPLTSIZE</name>
              <description>Source Template Size in number of transfers plus one</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Source template is disabled</description>
                    <value>0</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>DESTMPLTSIZE</name>
              <description>Destination Template Size in number of transfers plus one</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Destination template is disabled</description>
                    <value>0</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="GDMA_CH0_TMPLTCFG">
          <name>GDMA_CH1_TMPLTCFG</name>
          <displayName>GDMA_CH1_TMPLTCFG</displayName>
          <description>GDMA Channel Template Configuration Register</description>
          <addressOffset>0x1140</addressOffset>
       </register>
       <register>
          <name>GDMA_CH0_SRCTMPLT</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>GDMA_CH0_SRCTMPLT</displayName>
          <description>GDMA Channel 0 Source Template Pattern Register</description>
          <addressOffset>0x1044</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SRCTMPLTLSB</name>
              <description>Source Packing Template Least Significant Bit\nThis bit of the template is read only and always set to 1 as template patterns can only start from the base address of the transfer. Not present when HAS_TMPLT is 0. The field is RAZ/WI when the following condition is False: CH_EXT_FEAT_EN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SRCTMPLT</name>
              <description>Source Packing Template\nBit[0] is read only and always set to 1 as template patterns can only start from the base address of the transfer. Not present when HAS_TMPLT is 0. The field is RAZ/WI when the following condition is False: CH_EXT_FEAT_EN</description>
              <bitOffset>1</bitOffset>
              <bitWidth>31</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
