wosayttn/sdk-bsp-numaker-m55m1/Debug/svd/M55M1.svd
       <register>
          <name>GDMA_CH0_DESTMPLT</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>GDMA_CH0_DESTMPLT</displayName>
          <description>GDMA Channel 0 Destination Template Pattern Register</description>
          <addressOffset>0x1048</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DESTMPLTLSB</name>
              <description>Destination Packing Template Least Significant Bit\nThis bit of the template is read only and always set to 1 as template patterns can only start from the base address of the transfer. Not present when HAS_TMPLT is 0. The field is RAZ/WI when the following condition is False: CH_EXT_FEAT_EN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DESTMPLT</name>
              <description>Destination Packing Template\nBit[0] is read only and always set to 1 as template patterns can only start from the base address of the transfer. Not present when HAS_TMPLT is 0. The field is RAZ/WI when the following condition is False: CH_EXT_FEAT_EN</description>
              <bitOffset>1</bitOffset>
              <bitWidth>31</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>GDMA_CH0_LINKATTR</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>GDMA_CH0_LINKATTR</displayName>
          <description>GDMA Channel Link Address Memory Attributes Register</description>
          <addressOffset>0x1070</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LINKMEMATTRLO</name>
              <description>Link Address Read Transfer Memory Attribute field [3:0]\nWhen LINKMEMATTRHI is Device type (0000) then this field means:</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Device-nGnRnE.\nReserved</description>
                    <value>#0000</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Normal memory, Inner Write allocate, Inner Write-through transient</description>
                    <value>#0001</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>Normal memory, Inner Read allocate, Inner Write-through transient</description>
                    <value>#0010</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Normal memory, Inner Read/Write allocate, Inner Write-through transient</description>
                    <value>#0011</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>4</name>
                    <description>Device-nGnRE.\nNormal memory, Inner non-cacheable</description>
                    <value>#0100</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>5</name>
                    <description>Normal memory, Inner Write allocate, Inner Write-back transient</description>
                    <value>#0101</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>6</name>
                    <description>Normal memory, Inner Read allocate, Inner Write-back transient</description>
                    <value>#0110</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>7</name>
                    <description>Normal memory, Inner Read/Write allocate, Inner Write-back transient</description>
                    <value>#0111</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>8</name>
                    <description>Device-nGRE.\nNormal memory, Inner Write-through non-transient</description>
                    <value>#1000</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>9</name>
                    <description>Normal memory, Inner Write allocate, Inner Write-through non-transient</description>
                    <value>#1001</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>10</name>
                    <description>Normal memory, Inner Read allocate, Inner Write-through non-transient</description>
                    <value>#1010</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>11</name>
                    <description>Normal memory, Inner Read/Write allocate, Inner Write-through non-transient</description>
                    <value>#1011</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>12</name>
                    <description>Device-GRE.\nNormal memory, Inner Write-back non-transient</description>
                    <value>#1100</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>13</name>
                    <description>Normal memory, Inner Write allocate, Inner Write-back non-transient</description>
                    <value>#1101</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>14</name>
                    <description>Normal memory, Inner Read allocate, Inner Write-back non-transient</description>
                    <value>#1110</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>15</name>
                    <description>Normal memory, Inner Read/Write allocate, Inner Write-back non-transient</description>
                    <value>#1111</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>LINKMEMATTRHI</name>
              <description>Link Address Read Transfer Memory Attribute field [7:4]</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Device memory</description>
                    <value>#0000</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Normal memory, Outer Write allocate, Outer Write-through transient</description>
                    <value>#0001</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>Normal memory, Outer Read allocate, Outer Write-through transient</description>
                    <value>#0010</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Normal memory, Outer Read/Write allocate, Outer Write-through transient</description>
                    <value>#0011</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>4</name>
                    <description>Normal memory, Outer non-cacheable</description>
                    <value>#0100</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>5</name>
                    <description>Normal memory, Outer Write allocate, Outer Write-back transient</description>
                    <value>#0101</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>6</name>
                    <description>Normal memory, Outer Read allocate, Outer Write-back transient</description>
                    <value>#0110</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>7</name>
                    <description>Normal memory, Outer Read/Write allocate, Outer Write-back transient</description>
                    <value>#0111</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>8</name>
                    <description>Normal memory, Outer Write-through non-transient</description>
                    <value>#1000</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>9</name>
                    <description>Normal memory, Outer Write allocate, Outer Write-through non-transient</description>
                    <value>#1001</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>10</name>
                    <description>Normal memory, Outer Read allocate, Outer Write-through non-transient</description>
                    <value>#1010</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>11</name>
                    <description>Normal memory, Outer Read/Write allocate, Outer Write-through non-transient</description>
                    <value>#1011</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>12</name>
                    <description>Normal memory, Outer Write-back non-transient</description>
                    <value>#1100</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>13</name>
                    <description>Normal memory, Outer Write allocate, Outer Write-back non-transient</description>
                    <value>#1101</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>14</name>
                    <description>Normal memory, Outer Read allocate, Outer Write-back non-transient</description>
                    <value>#1110</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>15</name>
                    <description>Normal memory, Outer Read/Write allocate, Outer Write-back non-transien</description>
                    <value>#1111</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>LINKSHAREATTR</name>
              <description>Link Address Transfer Shareability Attribute</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Non-shareable</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Reserved.</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>Outer shareable</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Inner shareable</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
