wosayttn/sdk-bsp-numaker-m55m1/Debug/svd/M55M1.svd
       <register derivedFrom="GDMA_CH0_LINKATTR">
          <name>GDMA_CH1_LINKATTR</name>
          <displayName>GDMA_CH1_LINKATTR</displayName>
          <description>GDMA Channel Link Address Memory Attributes Register</description>
          <addressOffset>0x1170</addressOffset>
       </register>
       <register>
          <name>GDMA_CH0_AUTOCFG</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>GDMA_CH0_AUTOCFG</displayName>
          <description>GDMA Channel Automatic Command Restart Configuration Register</description>
          <addressOffset>0x1074</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CMDRESTARTCNT</name>
              <description>Automatic Command Restart Counter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMDRESTARTINFEN</name>
              <description>Enable Infinite Automatic Command Restart\nWhen set, CMDRESTARTCNT is ignored and the command is always restarted after it is completed, including output triggering if enabled and autoreloading the registers but it will not perform a link to the next command. This means that the infinite loop of automatic restarts can only be broken by DISABLECMD or STOPCMD. When CMDRESTARTINFEN is set to '0', then the autorestarting of a command depends on CMDRESTARTCNT and when that counter is set to 0 the autorestarting is finished. In this case the next linked command is read or the command is complete</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="GDMA_CH0_AUTOCFG">
          <name>GDMA_CH1_AUTOCFG</name>
          <displayName>GDMA_CH1_AUTOCFG</displayName>
          <description>GDMA Channel Automatic Command Restart Configuration Register</description>
          <addressOffset>0x1174</addressOffset>
       </register>
       <register>
          <name>GDMA_CH0_LINKADDR</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>GDMA_CH0_LINKADDR</displayName>
          <description>GDMA Channel Link Address Register</description>
          <addressOffset>0x1078</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LINKADDRREN</name>
              <description>Enable Link Address\nNote: the linked command fetched by the DMAC needs to clear this field to mark the end of the command chain. Otherwise it may result in an infinite loop of the same command</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>The DMAC will return to idle at the end of the current command</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The DMAC fetches the next command defined by LINKADDR</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>LINKADDR</name>
              <description>Link Address Pointer[31:2]\nThe DMAC fetches the next command from this address if LINKADDREN is set. Note: Commands are fetched with the security and privilege attribute of the channel and cannot be adjusted for the command link reads.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="GDMA_CH0_LINKADDR">
          <name>GDMA_CH1_LINKADDR</name>
          <displayName>GDMA_CH1_LINKADDR</displayName>
          <description>GDMA Channel Link Address Register</description>
          <addressOffset>0x1178</addressOffset>
       </register>
       <register>
          <name>GDMA_CH0_WRKREGPTR</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>GDMA_CH0_WRKREGPTR</displayName>
          <description>GDMA Channel Working Register Pointer Register</description>
          <addressOffset>0x1088</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WRKREGPTR</name>
              <description>Internal Working Register Pointer\nThese pointer refers to the following:\nNote: When the selected register is not supported by the DMA then it is read as 0 in the CH_WRKREGVAL register. For 1D modes the INITIAL and LINEINITIAL registers contain the same values.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Reserved.</description>
                    <value>0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>SRCADDR_INITIAL</description>
                    <value>1</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>SRCADDRHI_INITIAL</description>
                    <value>2</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>DESADDR_INITIAL</description>
                    <value>3</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>4</name>
                    <description>DESADDRHI_INITIAL</description>
                    <value>4</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>5</name>
                    <description>SRCXSIZEHI_INITIAL, SRCXSIZE_INITIAL</description>
                    <value>5</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>6</name>
                    <description>DESXSIZEHI_INITIAL, DESXSIZE_INITIAL</description>
                    <value>6</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>7</name>
                    <description>SRCADDR_LINEINITIAL</description>
                    <value>7</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>8</name>
                    <description>SRCADDRHI_LINEINITIAL</description>
                    <value>8</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>9</name>
                    <description>DESADDR_LINEINITIAL</description>
                    <value>9</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>10</name>
                    <description>DESADDRHI_LINEINITIAL</description>
                    <value>10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>11</name>
                    <description>SRCYSIZE_INITIAL (HAS_2D only)</description>
                    <value>11</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>12</name>
                    <description>DESYSIZE_INITIAL (HAS_2D only)</description>
                    <value>12</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="GDMA_CH0_WRKREGPTR">
          <name>GDMA_CH1_WRKREGPTR</name>
          <displayName>GDMA_CH1_WRKREGPTR</displayName>
          <description>GDMA Channel Working Register Pointer Register</description>
          <addressOffset>0x1188</addressOffset>
       </register>
       <register>
          <name>GDMA_CH0_WRKREGVAL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>GDMA_CH0_WRKREGVAL</displayName>
          <description>GDMA Channel - Working Register Value Register</description>
          <addressOffset>0x108C</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WRKREGVAL</name>
              <description>Internal Working Register Values\nWRKREGPTR points to the register that is visible here. The values are only guaranteed to be stable for the current command when STAT_PAUSED is asserted, otherwise they depend on the current status of the channel which makes them UNPREDICTABLE.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
