wosayttn/sdk-bsp-numaker-m55m1/Debug/svd/M55M1.svd
       <register derivedFrom="GDMA_CH0_WRKREGVAL">
          <name>GDMA_CH1_WRKREGVAL</name>
          <displayName>GDMA_CH1_WRKREGVAL</displayName>
          <description>GDMA Channel - Working Register Value Register</description>
          <addressOffset>0x118C</addressOffset>
       </register>
       <register>
          <name>GDMA_CH0_ERRINFO</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>GDMA_CH0_ERRINFO</displayName>
          <description>GDMA Channel Error Information Register</description>
          <addressOffset>0x1090</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BUSERR</name>
              <description>Bus Error Flag\nSet when the DMA encounters a bus error during data or command read transfers.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CFGERR</name>
              <description>Configuration Error Flag\nSet when the DMA command is enabled or a linked command is read but it is configured in a mode that is not supported by the implementation.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SRCTRIGINSELERR</name>
              <description>Source Trigger Input Selection Error Flag\nSet when the command selects a source trigger input that is not allowed for this channel.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DESTRIGINSELERR</name>
              <description>Destination Trigger Input Selection Error Flag\nSet when the command selects a destination trigger input that is not allowed for this channel.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TRIGOUTSELERR</name>
              <description>Trigger Output Selection Error Flag\nSet when the command selects a trigger output that is not allowed for this channel</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>STREAMERR</name>
              <description>Stream Interface Error Flag\nSet when the stream interface encountered an error. The field is RAZ/WI when the following condition is False: CH_STREAM_EN</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ERRINFO</name>
              <description>Error information Register\nAdditional information for the error that is encountered by the DMA. The meaning of the bits are detailed in the Error Handling section.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="GDMA_CH0_ERRINFO">
          <name>GDMA_CH1_ERRINFO</name>
          <displayName>GDMA_CH1_ERRINFO</displayName>
          <description>GDMA Channel Error Information Register</description>
          <addressOffset>0x1190</addressOffset>
       </register>
       <register>
          <name>GDMA_CH0_IIDR</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>GDMA_CH0_IIDR</displayName>
          <description>GDMA Channel Implementation Identification Register</description>
          <addressOffset>0x10C8</addressOffset>
          <access>read-only</access>
          <resetValue>0x3A00043B</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IMPLEMENTER</name>
              <description>Implementer Code\nContains the JEP106 code of the company that implemented the IP: - [11:8]: JEP106 continuation code of implementer. - [7]: Always 0. - [6:0]: JEP106 identity code of implementer. For Arm this field reads as 0x43B.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REVISION</name>
              <description>Minor Revision\nIndicates the minor revision of the product rxpy identifier</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VARIANT</name>
              <description>Variant ID\nIndicates the major revision, or variant, of the product rxpy identifier</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PRODUCTID</name>
              <description>Product ID\nIndicates the product ID</description>
              <bitOffset>20</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="GDMA_CH0_IIDR">
          <name>GDMA_CH1_IIDR</name>
          <displayName>GDMA_CH1_IIDR</displayName>
          <description>GDMA Channel Implementation Identification Register</description>
          <addressOffset>0x11C8</addressOffset>
       </register>
       <register>
          <name>GDMA_CH0_AIDR</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>GDMA_CH0_AIDR</displayName>
          <description>GDMA Channel Architecture Identification Register</description>
          <addressOffset>0x10CC</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ARCH_MINOR_REV</name>
              <description>Architecture Minor Revision</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ARCH_MAJOR_REV</name>
              <description>Architecture Major Revision</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
