wosayttn/sdk-bsp-numaker-m55m1/Debug/svd/M55M1.svd
       <register derivedFrom="GDMA_CH0_AIDR">
          <name>GDMA_CH1_AIDR</name>
          <displayName>GDMA_CH1_AIDR</displayName>
          <description>GDMA Channel Architecture Identification Register</description>
          <addressOffset>0x11CC</addressOffset>
       </register>
       <register>
          <name>GDMA_CH0_ISSUECAP</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>GDMA_CH0_ISSUECAP</displayName>
          <description>GDMA Used for setting issuing capability threshold</description>
          <addressOffset>0x10E8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000007</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ISSUECAP</name>
              <description>ISSUECAP\nISSUECAP can be used by software to place a constraint on allowed issuing capability in both read and write direction.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="GDMA_CH0_ISSUECAP">
          <name>GDMA_CH1_ISSUECAP</name>
          <displayName>GDMA_CH1_ISSUECAP</displayName>
          <description>GDMA Used for setting issuing capability threshold</description>
          <addressOffset>0x11E8</addressOffset>
       </register>
       <register>
          <name>GDMA_CH0_BUILDCFG0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>GDMA_CH0_BUILDCFG0</displayName>
          <description>GDMA Channel Build Configuration and Capability Register 0</description>
          <addressOffset>0x10F8</addressOffset>
          <access>read-only</access>
          <resetValue>0x3CDF000F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA_BUFF_SIZE</name>
              <description>Data Buffer Size</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CMD_BUFF_SIZE</name>
              <description>Command Buffer Size</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ADDR_WIDTH</name>
              <description>Address Width</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DATA_WIDTH</name>
              <description>Data Width</description>
              <bitOffset>22</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>8-bit</description>
                    <value>#000</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>16-bit</description>
                    <value>#001</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>32-bit</description>
                    <value>#010</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>64-bit</description>
                    <value>#011</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>4</name>
                    <description>128-bit</description>
                    <value>#100</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>5</name>
                    <description>256-bit</description>
                    <value>#101</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>6</name>
                    <description>512-bit</description>
                    <value>#110</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>7</name>
                    <description>1024-bit</description>
                    <value>#111</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>INC_WIDTH</name>
              <description>Width of the increment</description>
              <bitOffset>26</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="GDMA_CH0_BUILDCFG0">
          <name>GDMA_CH1_BUILDCFG0</name>
          <displayName>GDMA_CH1_BUILDCFG0</displayName>
          <description>GDMA Channel Build Configuration and Capability Register 0</description>
          <addressOffset>0x11F8</addressOffset>
       </register>
       <register>
          <name>GDMA_CH1_SRCTMPLT</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>GDMA_CH1_SRCTMPLT</displayName>
          <description>GDMA Channel 1 Source Template Pattern Register</description>
          <addressOffset>0x1144</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SRCTMPLTLSB</name>
              <description>Source Packing Template Least Significant Bit\nThis bit of the template is read only and always set to 1 as template patterns can only start from the base address of the transfer. Not present when HAS_TMPLT is 0. The field is RAZ/WI when the following condition is False: CH_EXT_FEAT_EN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SRCTMPLT</name>
              <description>Source Packing Template\nBit[0] is read only and always set to 1 as template patterns can only start from the base address of the transfer. Not present when HAS_TMPLT is 0. The field is RAZ/WI when the following condition is False: CH_EXT_FEAT_EN</description>
              <bitOffset>1</bitOffset>
              <bitWidth>31</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>GDMA_CH1_DESTMPLT</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>GDMA_CH1_DESTMPLT</displayName>
          <description>GDMA Channel 1 Destination Template Pattern Register</description>
          <addressOffset>0x1148</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DESTMPLTLSB</name>
              <description>Destination Packing Template Least Significant Bit\nThis bit of the template is read only and always set to 1 as template patterns can only start from the base address of the transfer. Not present when HAS_TMPLT is 0. The field is RAZ/WI when the following condition is False: CH_EXT_FEAT_EN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DESTMPLT</name>
              <description>Destination Packing Template\nBit[0] is read only and always set to 1 as template patterns can only start from the base address of the transfer. Not present when HAS_TMPLT is 0. The field is RAZ/WI when the following condition is False: CH_EXT_FEAT_EN</description>
              <bitOffset>1</bitOffset>
              <bitWidth>31</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>GDMA_CH0_BUILDCFG1</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>GDMA_CH0_BUILDCFG1</displayName>
          <description>GDMA Channel Build Configuration and Capability Register 1 (CH0)</description>
          <addressOffset>0x11FC</addressOffset>
          <access>read-only</access>
          <resetValue>0x0000079F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HAS_XSIZEHI</name>
              <description>Has 32-bit XSIZE counters</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HAS_WRAP</name>
              <description>Has wrap capability</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HAS_2D</name>
              <description>Has 2D capability</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HAS_TMPLT</name>
              <description>Has template based pack and unpack capability.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HAS_TRIG</name>
              <description>Has trigger capability</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HAS_TRIGIN</name>
              <description>Has hardware trigger input ports.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HAS_TRIGOUT</name>
              <description>Has hardware trigger output port.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HAS_TRIGSEL</name>
              <description>Has selectable triggers.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HAS_CMDLINK</name>
              <description>Has command link list capability.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HAS_AUTO</name>
              <description>Has automatic reload and restart capability.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HAS_WRKREG</name>
              <description>Has internal register view capability</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HAS_STREAM</name>
              <description>Has stream interface support.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HAS_STREAMSEL</name>
              <description>Has selectable stream interfaces.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HAS_GPOSEL</name>
              <description>Has shared GPO ports between channels.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GPO_WIDTH</name>
              <description>General Purpose Output Width 0 to 64. The field is RAZ/WI when the following condition is False: (CH_GPO_EN * GPO_WIDTH)  0</description>
              <bitOffset>19</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>GDMA_CH1_BUILDCFG1</name>
          <alternateRegister>GDMA_CH0_BUILDCFG1</alternateRegister>
          <!-- the display name is an unrestricted string. -->
          <displayName>GDMA_CH1_BUILDCFG1</displayName>
          <description>GDMA Channel Build Configuration and Capability Register 1 (CH1)</description>
          <addressOffset>0x11FC</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000791</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HAS_XSIZEHI</name>
              <description>Has 32-bit XSIZE counters</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HAS_WRAP</name>
              <description>Has wrap capability</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HAS_2D</name>
              <description>Has 2D capability</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HAS_TMPLT</name>
              <description>Has template based pack and unpack capability.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HAS_TRIG</name>
              <description>Has trigger capability</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HAS_TRIGIN</name>
              <description>Has hardware trigger input ports.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HAS_TRIGOUT</name>
              <description>Has hardware trigger output port.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HAS_TRIGSEL</name>
              <description>Has selectable triggers.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HAS_CMDLINK</name>
              <description>Has command link list capability.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HAS_AUTO</name>
              <description>Has automatic reload and restart capability.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HAS_WRKREG</name>
              <description>Has internal register view capability</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HAS_STREAM</name>
              <description>Has stream interface support.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HAS_STREAMSEL</name>
              <description>Has selectable stream interfaces.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HAS_GPOSEL</name>
              <description>Has shared GPO ports between channels.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GPO_WIDTH</name>
              <description>General Purpose Output Width 0 to 64. The field is RAZ/WI when the following condition is False: (CH_GPO_EN * GPO_WIDTH)  0</description>
              <bitOffset>19</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
