wosayttn/sdk-bsp-numaker-m55m1/Debug/svd/M55M1.svd
       <register>
          <name>LPTMR0_PWMPBUF</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>LPTMR0_PWMPBUF</displayName>
          <description>LPTMR0 PWM Period Buffer Register</description>
          <addressOffset>0x70</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PBUF</name>
              <description>PWM Period Buffer Register (Read Only)\nUsed as PERIOD active register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>LPTMR0_PWMCMPBUF</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>LPTMR0_PWMCMPBUF</displayName>
          <description>LPTMR0 PWM Comparator Buffer Register</description>
          <addressOffset>0x74</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CMPBUF</name>
              <description>PWM Comparator Buffer Register (Read Only)\nUsed as CMP active register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>LPTMR0_PWMIFA</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>LPTMR0_PWMIFA</displayName>
          <description>LPTMR0 PWM Interrupt Flag Accumulator Register</description>
          <addressOffset>0xA8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IFACNT</name>
              <description>PWM Interrupt Flag Accumulator Counter\nThis field sets the count number which defines (IFACNT+1) times of specify PWM interrupt occurs to set IFAIF bit to request the PWM accumulator interrupt. \nPWM accumulator flag (IFAIF) will be set in every (IFACNT+1) times during the the PWM counter operation.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STPMOD</name>
              <description>PWM Accumulator Stop Mode Enable Bit</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>PWM interrupt accumulator event to stop counting Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>PWM interrupt accumulator event to stop counting Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>IFASEL</name>
              <description>PWM Interrupt Flag Accumulator Source Select</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Accumulate at each PWM period point</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>Accumulate at each PWM up-count compared point</description>
                    <value>#10</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>IFAEN</name>
              <description>PWM Interrupt Flag Accumulator Enable Bit</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>PWM interrupt flag accumulator function Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>PWM interrupt flag accumulator function Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>LPTMR0_PWMAINTSTS</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>LPTMR0_PWMAINTSTS</displayName>
          <description>LPTMR0 PWM Accumulator Interrupt Flag Register</description>
          <addressOffset>0xAC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IFAIF</name>
              <description>PWM Interrupt Flag Accumulator Interrupt Flag\nThis bit is set by hardware when the accumulator value reaches (IFACNT+1)\nNote 1: This bit is cleared by writing 1 to it.\nNote 2: If APDMAEN (LPTMRx_PWMAPDMACTL[0]) is set, this bit will be auto clear after PDMA transfer done.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>LPTMR0_PWMAINTEN</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>LPTMR0_PWMAINTEN</displayName>
          <description>LPTMR0 PWM Accumulator Interrupt Enable Register</description>
          <addressOffset>0xB0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IFAIEN</name>
              <description>PWM Interrupt Flag Accumulator Interrupt Enable Bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Interrupt Flag Accumulator interrupt Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Interrupt Flag Accumulator interrupt Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>LPTMR0_PWMAPDMACTL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>LPTMR0_PWMAPDMACTL</displayName>
          <description>LPTMR0 PWM Accumulator LPPDMA Control Register</description>
          <addressOffset>0xB4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>APDMAEN</name>
              <description>PWM Accumulator LPPDMA Enable Bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>PWM interrupt accumulator event to trigger LPPDMA transfer Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>PWM interrupt accumulator event to trigger LPPDMA transfer Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
