wosayttn/sdk-bsp-numaker-m55m1/Debug/svd/M55M1.svd
       <register derivedFrom="LPTMR0_CTL">
          <name>LPTMR1_CTL</name>
          <displayName>LPTMR1_CTL</displayName>
          <description>LPTMR1 Control Register</description>
          <addressOffset>0x100</addressOffset>
       </register>
       <register derivedFrom="LPTMR0_CMP">
          <name>LPTMR1_CMP</name>
          <displayName>LPTMR1_CMP</displayName>
          <description>LPTMR1 Comparator Register</description>
          <addressOffset>0x104</addressOffset>
       </register>
       <register derivedFrom="LPTMR0_INTSTS">
          <name>LPTMR1_INTSTS</name>
          <displayName>LPTMR1_INTSTS</displayName>
          <description>LPTMR1 Interrupt Status Register</description>
          <addressOffset>0x108</addressOffset>
       </register>
       <register derivedFrom="LPTMR0_CNT">
          <name>LPTMR1_CNT</name>
          <displayName>LPTMR1_CNT</displayName>
          <description>LPTMR1 Data Register</description>
          <addressOffset>0x10C</addressOffset>
       </register>
       <register derivedFrom="LPTMR0_CAP">
          <name>LPTMR1_CAP</name>
          <displayName>LPTMR1_CAP</displayName>
          <description>LPTMR1 Capture Data Register</description>
          <addressOffset>0x110</addressOffset>
       </register>
       <register derivedFrom="LPTMR0_EXTCTL">
          <name>LPTMR1_EXTCTL</name>
          <displayName>LPTMR1_EXTCTL</displayName>
          <description>LPTMR1 External Control Register</description>
          <addressOffset>0x114</addressOffset>
       </register>
       <register derivedFrom="LPTMR0_EINTSTS">
          <name>LPTMR1_EINTSTS</name>
          <displayName>LPTMR1_EINTSTS</displayName>
          <description>LPTMR1 External Interrupt Status Register</description>
          <addressOffset>0x118</addressOffset>
       </register>
       <register derivedFrom="LPTMR0_TRGCTL">
          <name>LPTMR1_TRGCTL</name>
          <displayName>LPTMR1_TRGCTL</displayName>
          <description>LPTMR1 Trigger Control Register</description>
          <addressOffset>0x11C</addressOffset>
       </register>
       <register derivedFrom="LPTMR0_CAPNF">
          <name>LPTMR1_CAPNF</name>
          <displayName>LPTMR1_CAPNF</displayName>
          <description>LPTMR1 Capture Input Noise Filter Register</description>
          <addressOffset>0x124</addressOffset>
       </register>
       <register derivedFrom="LPTMR0_PWMCTL">
          <name>LPTMR1_PWMCTL</name>
          <displayName>LPTMR1_PWMCTL</displayName>
          <description>LPTMR1 PWM Control Register</description>
          <addressOffset>0x140</addressOffset>
       </register>
       <register derivedFrom="LPTMR0_PWMCLKPSC">
          <name>LPTMR1_PWMCLKPSC</name>
          <displayName>LPTMR1_PWMCLKPSC</displayName>
          <description>LPTMR1 PWM Counter Clock Pre-scale Register</description>
          <addressOffset>0x144</addressOffset>
       </register>
       <register derivedFrom="LPTMR0_PWMCNTCLR">
          <name>LPTMR1_PWMCNTCLR</name>
          <displayName>LPTMR1_PWMCNTCLR</displayName>
          <description>LPTMR1 PWM Clear Counter Register</description>
          <addressOffset>0x148</addressOffset>
       </register>
       <register derivedFrom="LPTMR0_PWMPERIOD">
          <name>LPTMR1_PWMPERIOD</name>
          <displayName>LPTMR1_PWMPERIOD</displayName>
          <description>LPTMR1 PWM Period Register</description>
          <addressOffset>0x14C</addressOffset>
       </register>
       <register derivedFrom="LPTMR0_PWMCMPDAT">
          <name>LPTMR1_PWMCMPDAT</name>
          <displayName>LPTMR1_PWMCMPDAT</displayName>
          <description>LPTMR1 PWM Comparator Register</description>
          <addressOffset>0x150</addressOffset>
       </register>
       <register derivedFrom="LPTMR0_PWMCNT">
          <name>LPTMR1_PWMCNT</name>
          <displayName>LPTMR1_PWMCNT</displayName>
          <description>LPTMR1 PWM Counter Register</description>
          <addressOffset>0x154</addressOffset>
       </register>
       <register derivedFrom="LPTMR0_PWMPOLCTL">
          <name>LPTMR1_PWMPOLCTL</name>
          <displayName>LPTMR1_PWMPOLCTL</displayName>
          <description>LPTMR1 PWM Pin Output Polar Control Register</description>
          <addressOffset>0x158</addressOffset>
       </register>
       <register derivedFrom="LPTMR0_PWMPOCTL">
          <name>LPTMR1_PWMPOCTL</name>
          <displayName>LPTMR1_PWMPOCTL</displayName>
          <description>LPTMR1 PWM Pin Output Control Register</description>
          <addressOffset>0x15C</addressOffset>
       </register>
       <register derivedFrom="LPTMR0_PWMINTEN0">
          <name>LPTMR1_PWMINTEN0</name>
          <displayName>LPTMR1_PWMINTEN0</displayName>
          <description>LPTMR1 PWM Interrupt Enable Register 0</description>
          <addressOffset>0x160</addressOffset>
       </register>
       <register derivedFrom="LPTMR0_PWMINTSTS0">
          <name>LPTMR1_PWMINTSTS0</name>
          <displayName>LPTMR1_PWMINTSTS0</displayName>
          <description>LPTMR1 PWM Interrupt Status Register 0</description>
          <addressOffset>0x164</addressOffset>
       </register>
       <register derivedFrom="LPTMR0_PWMTRGCTL">
          <name>LPTMR1_PWMTRGCTL</name>
          <displayName>LPTMR1_PWMTRGCTL</displayName>
          <description>LPTMR1 PWM Trigger Control Register</description>
          <addressOffset>0x168</addressOffset>
       </register>
       <register derivedFrom="LPTMR0_PWMSTATUS">
          <name>LPTMR1_PWMSTATUS</name>
          <displayName>LPTMR1_PWMSTATUS</displayName>
          <description>LPTMR1 PWM Status Register</description>
          <addressOffset>0x16C</addressOffset>
       </register>
       <register derivedFrom="LPTMR0_PWMPBUF">
          <name>LPTMR1_PWMPBUF</name>
          <displayName>LPTMR1_PWMPBUF</displayName>
          <description>LPTMR1 PWM Period Buffer Register</description>
          <addressOffset>0x170</addressOffset>
       </register>
       <register derivedFrom="LPTMR0_PWMCMPBUF">
          <name>LPTMR1_PWMCMPBUF</name>
          <displayName>LPTMR1_PWMCMPBUF</displayName>
          <description>LPTMR1 PWM Comparator Buffer Register</description>
          <addressOffset>0x174</addressOffset>
       </register>
       <register derivedFrom="LPTMR0_PWMIFA">
          <name>LPTMR1_PWMIFA</name>
          <displayName>LPTMR1_PWMIFA</displayName>
          <description>LPTMR1 PWM Interrupt Flag Accumulator Register</description>
          <addressOffset>0x1A8</addressOffset>
       </register>
