wosayttn/sdk-bsp-numaker-m55m1/Debug/svd/M55M1.svd
       <register>
          <name>EPWM_CAPNF0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>EPWM_CAPNF0</displayName>
          <description>EPWM Capture Input Noise Filter Register 0</description>
          <addressOffset>0x258</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CAPNFEN</name>
              <description>Capture Noise Filter Enable Bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Capture Noise Filter function Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Capture Noise Filter function Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>CAPNFSEL</name>
              <description>Capture Edge Detector Noise Filter Clock Selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Filter clock = PCLK</description>
                    <value>#000</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Filter clock = PCLK/2</description>
                    <value>#001</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>Filter clock = PCLK/4</description>
                    <value>#010</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Filter clock = PCLK/8</description>
                    <value>#011</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>4</name>
                    <description>Filter clock = PCLK/16</description>
                    <value>#100</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>5</name>
                    <description>Filter clock = PCLK/32</description>
                    <value>#101</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>6</name>
                    <description>Filter clock = PCLK/64</description>
                    <value>#110</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>7</name>
                    <description>Filter clock = PCLK/128</description>
                    <value>#111</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>CAPNFCNT</name>
              <description>Capture Edge Detector Noise Filter Count\nThe register bits control the capture filter counter to count from 0 to CAPNFCNT.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="EPWM_CAPNF0">
          <name>EPWM_CAPNF1</name>
          <displayName>EPWM_CAPNF1</displayName>
          <description>EPWM Capture Input Noise Filter Register 1</description>
          <addressOffset>0x25C</addressOffset>
       </register>
       <register derivedFrom="EPWM_CAPNF0">
          <name>EPWM_CAPNF2</name>
          <displayName>EPWM_CAPNF2</displayName>
          <description>EPWM Capture Input Noise Filter Register 2</description>
          <addressOffset>0x260</addressOffset>
       </register>
       <register derivedFrom="EPWM_CAPNF0">
          <name>EPWM_CAPNF3</name>
          <displayName>EPWM_CAPNF3</displayName>
          <description>EPWM Capture Input Noise Filter Register 3</description>
          <addressOffset>0x264</addressOffset>
       </register>
       <register derivedFrom="EPWM_CAPNF0">
          <name>EPWM_CAPNF4</name>
          <displayName>EPWM_CAPNF4</displayName>
          <description>EPWM Capture Input Noise Filter Register 4</description>
          <addressOffset>0x268</addressOffset>
       </register>
       <register derivedFrom="EPWM_CAPNF0">
          <name>EPWM_CAPNF5</name>
          <displayName>EPWM_CAPNF5</displayName>
          <description>EPWM Capture Input Noise Filter Register 5</description>
          <addressOffset>0x26C</addressOffset>
       </register>
       <register>
          <name>EPWM_EXTETCTL0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>EPWM_EXTETCTL0</displayName>
          <description>EPWM External Event Trigger Control Register 0</description>
          <addressOffset>0x270</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EXTETEN</name>
              <description>External Event Trigger Enable Bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>External Event Trigger function Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>External Event Trigger function Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>CNTACTS</name>
              <description>Counter Action Selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Counter reset</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Counter start</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>Counter reset and start</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Reseved</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTTRGS</name>
              <description>External Trigger Selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>INT0</description>
                    <value>#0000</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>INT1</description>
                    <value>#0001</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>INT2</description>
                    <value>#0010</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>INT3</description>
                    <value>#0011</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>4</name>
                    <description>INT4</description>
                    <value>#0100</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>5</name>
                    <description>INT5</description>
                    <value>#0101</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>6</name>
                    <description>INT6</description>
                    <value>#0110</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>7</name>
                    <description>INT7</description>
                    <value>#0111</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="EPWM_EXTETCTL0">
          <name>EPWM_EXTETCTL1</name>
          <displayName>EPWM_EXTETCTL1</displayName>
          <description>EPWM External Event Trigger Control Register 1</description>
          <addressOffset>0x274</addressOffset>
       </register>
       <register derivedFrom="EPWM_EXTETCTL0">
          <name>EPWM_EXTETCTL2</name>
          <displayName>EPWM_EXTETCTL2</displayName>
          <description>EPWM External Event Trigger Control Register 2</description>
          <addressOffset>0x278</addressOffset>
       </register>
       <register derivedFrom="EPWM_EXTETCTL0">
          <name>EPWM_EXTETCTL3</name>
          <displayName>EPWM_EXTETCTL3</displayName>
          <description>EPWM External Event Trigger Control Register 3</description>
          <addressOffset>0x27C</addressOffset>
       </register>
       <register derivedFrom="EPWM_EXTETCTL0">
          <name>EPWM_EXTETCTL4</name>
          <displayName>EPWM_EXTETCTL4</displayName>
          <description>EPWM External Event Trigger Control Register 4</description>
          <addressOffset>0x280</addressOffset>
       </register>
       <register derivedFrom="EPWM_EXTETCTL0">
          <name>EPWM_EXTETCTL5</name>
          <displayName>EPWM_EXTETCTL5</displayName>
          <description>EPWM External Event Trigger Control Register 5</description>
          <addressOffset>0x284</addressOffset>
       </register>
       <register>
          <name>EPWM_SWEOFCTL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>EPWM_SWEOFCTL</displayName>
          <description>EPWM Software Event Output Force Control Register</description>
          <addressOffset>0x288</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OUTACTS0</name>
              <description>Output Action Selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Do nothing</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>EPWM output Low</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>EPWM output High</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>EPWM output Toggle</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTACTS1</name>
              <description>Output Action Selection</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Do nothing</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>EPWM output Low</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>EPWM output High</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>EPWM output Toggle</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTACTS2</name>
              <description>Output Action Selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Do nothing</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>EPWM output Low</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>EPWM output High</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>EPWM output Toggle</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTACTS3</name>
              <description>Output Action Selection</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Do nothing</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>EPWM output Low</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>EPWM output High</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>EPWM output Toggle</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTACTS4</name>
              <description>Output Action Selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Do nothing</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>EPWM output Low</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>EPWM output High</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>EPWM output Toggle</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTACTS5</name>
              <description>Output Action Selection</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Do nothing</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>EPWM output Low</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>EPWM output High</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>EPWM output Toggle</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>EPWM_SWEOFTRG</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>EPWM_SWEOFTRG</displayName>
          <description>EPWM Software Event Output Force Trigger Register</description>
          <addressOffset>0x28C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWETRG0</name>
              <description>Software Event Trigger\nWrite 1 to this bit will change EPWM output status according to OUTACTSn in EPWMx_SWEOFCTL setting.\nNote: This bit will auto cleared by hardware.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SWETRG1</name>
              <description>Software Event Trigger\nWrite 1 to this bit will change EPWM output status according to OUTACTSn in EPWMx_SWEOFCTL setting.\nNote: This bit will auto cleared by hardware.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SWETRG2</name>
              <description>Software Event Trigger\nWrite 1 to this bit will change EPWM output status according to OUTACTSn in EPWMx_SWEOFCTL setting.\nNote: This bit will auto cleared by hardware.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SWETRG3</name>
              <description>Software Event Trigger\nWrite 1 to this bit will change EPWM output status according to OUTACTSn in EPWMx_SWEOFCTL setting.\nNote: This bit will auto cleared by hardware.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SWETRG4</name>
              <description>Software Event Trigger\nWrite 1 to this bit will change EPWM output status according to OUTACTSn in EPWMx_SWEOFCTL setting.\nNote: This bit will auto cleared by hardware.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SWETRG5</name>
              <description>Software Event Trigger\nWrite 1 to this bit will change EPWM output status according to OUTACTSn in EPWMx_SWEOFCTL setting.\nNote: This bit will auto cleared by hardware.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>EPWM_CLKPSC0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>EPWM_CLKPSC0</displayName>
          <description>EPWM Clock Prescale Register 0</description>
          <addressOffset>0x290</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CLKPSC</name>
              <description>EPWM Counter Clock Prescale\nThe clock of EPWM counter is decided by clock prescaler. Each EPWM pair share one EPWM counter clock prescaler. The clock of EPWM counter is divided by (CLKPSC+ 1).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="EPWM_CLKPSC0">
          <name>EPWM_CLKPSC1</name>
          <displayName>EPWM_CLKPSC1</displayName>
          <description>EPWM Clock Prescale Register 1</description>
          <addressOffset>0x294</addressOffset>
       </register>
       <register derivedFrom="EPWM_CLKPSC0">
          <name>EPWM_CLKPSC2</name>
          <displayName>EPWM_CLKPSC2</displayName>
          <description>EPWM Clock Prescale Register 2</description>
          <addressOffset>0x298</addressOffset>
       </register>
       <register derivedFrom="EPWM_CLKPSC0">
          <name>EPWM_CLKPSC3</name>
          <displayName>EPWM_CLKPSC3</displayName>
          <description>EPWM Clock Prescale Register 3</description>
          <addressOffset>0x29C</addressOffset>
       </register>
       <register derivedFrom="EPWM_CLKPSC0">
          <name>EPWM_CLKPSC4</name>
          <displayName>EPWM_CLKPSC4</displayName>
          <description>EPWM Clock Prescale Register 4</description>
          <addressOffset>0x2A0</addressOffset>
       </register>
       <register derivedFrom="EPWM_CLKPSC0">
          <name>EPWM_CLKPSC5</name>
          <displayName>EPWM_CLKPSC5</displayName>
          <description>EPWM Clock Prescale Register 5</description>
          <addressOffset>0x2A4</addressOffset>
       </register>
