wosayttn/sdk-bsp-numaker-m55m1/Debug/svd/M55M1.svd
       <register derivedFrom="EPWM_FTCBUF0_1">
          <name>EPWM_FTCBUF2_3</name>
          <displayName>EPWM_FTCBUF2_3</displayName>
          <description>EPWM FTCMPDAT2_3 Buffer</description>
          <addressOffset>0x344</addressOffset>
       </register>
       <register derivedFrom="EPWM_FTCBUF0_1">
          <name>EPWM_FTCBUF4_5</name>
          <displayName>EPWM_FTCBUF4_5</displayName>
          <description>EPWM FTCMPDAT4_5 Buffer</description>
          <addressOffset>0x348</addressOffset>
       </register>
       <register>
          <name>EPWM_FTCI</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>EPWM_FTCI</displayName>
          <description>EPWM FTCMPDAT Indicator Register</description>
          <addressOffset>0x34C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FTCMU0</name>
              <description>EPWM FTCMPDAT Up Indicator\nIndicator is set by hardware when EPWM counter up count and reaches EPWM_FTCMPDATn, software can clear this bit by writing 1 to it.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FTCMU2</name>
              <description>EPWM FTCMPDAT Up Indicator\nIndicator is set by hardware when EPWM counter up count and reaches EPWM_FTCMPDATn, software can clear this bit by writing 1 to it.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FTCMU4</name>
              <description>EPWM FTCMPDAT Up Indicator\nIndicator is set by hardware when EPWM counter up count and reaches EPWM_FTCMPDATn, software can clear this bit by writing 1 to it.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FTCMD0</name>
              <description>EPWM FTCMPDAT Down Indicator\nIndicator is set by hardware when EPWM counter down count and reaches EPWM_FTCMPDATn, software can clear this bit by writing 1 to it.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FTCMD2</name>
              <description>EPWM FTCMPDAT Down Indicator\nIndicator is set by hardware when EPWM counter down count and reaches EPWM_FTCMPDATn, software can clear this bit by writing 1 to it.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FTCMD4</name>
              <description>EPWM FTCMPDAT Down Indicator\nIndicator is set by hardware when EPWM counter down count and reaches EPWM_FTCMPDATn, software can clear this bit by writing 1 to it.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>EPWM_CPSCBUF0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>EPWM_CPSCBUF0</displayName>
          <description>EPWM CLKPSC0 Buffer</description>
          <addressOffset>0x350</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CPSCBUF</name>
              <description>EPWM Counter Clock Prescale Buffer\nUsed as EPWM counter clock pre-scare active register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="EPWM_CPSCBUF0">
          <name>EPWM_CPSCBUF1</name>
          <displayName>EPWM_CPSCBUF1</displayName>
          <description>EPWM CLKPSC1 Buffer</description>
          <addressOffset>0x354</addressOffset>
       </register>
       <register derivedFrom="EPWM_CPSCBUF0">
          <name>EPWM_CPSCBUF2</name>
          <displayName>EPWM_CPSCBUF2</displayName>
          <description>EPWM CLKPSC2 Buffer</description>
          <addressOffset>0x358</addressOffset>
       </register>
       <register derivedFrom="EPWM_CPSCBUF0">
          <name>EPWM_CPSCBUF3</name>
          <displayName>EPWM_CPSCBUF3</displayName>
          <description>EPWM CLKPSC3 Buffer</description>
          <addressOffset>0x35C</addressOffset>
       </register>
       <register derivedFrom="EPWM_CPSCBUF0">
          <name>EPWM_CPSCBUF4</name>
          <displayName>EPWM_CPSCBUF4</displayName>
          <description>EPWM CLKPSC4 Buffer</description>
          <addressOffset>0x360</addressOffset>
       </register>
       <register derivedFrom="EPWM_CPSCBUF0">
          <name>EPWM_CPSCBUF5</name>
          <displayName>EPWM_CPSCBUF5</displayName>
          <description>EPWM CLKPSC5 Buffer</description>
          <addressOffset>0x364</addressOffset>
       </register>
       <register>
          <name>EPWM_IFACNT0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>EPWM_IFACNT0</displayName>
          <description>EPWM Interrupt Flag Accumulator Counter 0</description>
          <addressOffset>0x368</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ACUCNT</name>
              <description>Accumulator Counter (Read Only)\nThis value indicates how many interrupt are accumulated when using interrupt flag accumulator function.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="EPWM_IFACNT0">
          <name>EPWM_IFACNT1</name>
          <displayName>EPWM_IFACNT1</displayName>
          <description>EPWM Interrupt Flag Accumulator Counter 1</description>
          <addressOffset>0x36C</addressOffset>
       </register>
       <register derivedFrom="EPWM_IFACNT0">
          <name>EPWM_IFACNT2</name>
          <displayName>EPWM_IFACNT2</displayName>
          <description>EPWM Interrupt Flag Accumulator Counter 2</description>
          <addressOffset>0x370</addressOffset>
       </register>
       <register derivedFrom="EPWM_IFACNT0">
          <name>EPWM_IFACNT3</name>
          <displayName>EPWM_IFACNT3</displayName>
          <description>EPWM Interrupt Flag Accumulator Counter 3</description>
          <addressOffset>0x374</addressOffset>
       </register>
       <register derivedFrom="EPWM_IFACNT0">
          <name>EPWM_IFACNT4</name>
          <displayName>EPWM_IFACNT4</displayName>
          <description>EPWM Interrupt Flag Accumulator Counter 4</description>
          <addressOffset>0x378</addressOffset>
       </register>
       <register derivedFrom="EPWM_IFACNT0">
          <name>EPWM_IFACNT5</name>
          <displayName>EPWM_IFACNT5</displayName>
          <description>EPWM Interrupt Flag Accumulator Counter 5</description>
          <addressOffset>0x37C</addressOffset>
       </register>
