wosayttn/sdk-bsp-numaker-m55m1/Debug/svd/M55M1.svd
       <register>
          <name>CCAP_FIFOTH</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CCAP_FIFOTH</displayName>
          <description>FIFO Threshold Register</description>
          <addressOffset>0x3C</addressOffset>
          <access>read-write</access>
          <resetValue>0x070D0507</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PLNVFTH</name>
              <description>Planar V FIFO Threshold\nSpecify the 4-bit value of the planar V FIFO threshold.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLNUFTH</name>
              <description>Planar U FIFO Threshold\nSpecify the 4-bit value of the planar U FIFO threshold.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLNYFTH</name>
              <description>Planar Y FIFO Threshold\nSpecify the 5-bit value of the planar Y FIFO threshold.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PKTFTH</name>
              <description>Packet FIFO Threshold\nSpecify the 5-bit value of the packet FIFO threshold.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OVF</name>
              <description>FIFO Overflow Flag\nIndicate the FIFO overflow flag.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CCAP_CMPADDR</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CCAP_CMPADDR</displayName>
          <description>Compare Memory Base Address Register</description>
          <addressOffset>0x40</addressOffset>
          <access>read-write</access>
          <resetValue>0xFFFFFFFC</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CMPADDR</name>
              <description>Compare Memory Base Address\nIt is a word alignment address, that is, the address is aligned by ignoring the 2 LSB bits [1:0].</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CCAP_LUMA_Y1_THD</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CCAP_LUMA_Y1_THD</displayName>
          <description>Luminance Y8 to Y1 Threshold Value Register</description>
          <addressOffset>0x44</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000080</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LUMA_Y1_THRESH</name>
              <description>Luminance Y8 to Y1 Threshold Value\nSpecify the 8-bit threshold value for the luminance Y bit-8 to the luminance Y 1-bit conversion.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CCAP_PKTSM</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CCAP_PKTSM</displayName>
          <description>Packet Scaling Vertical/Horizontal Factor Register (MSB)</description>
          <addressOffset>0x48</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKTSHMH</name>
              <description>Packet Scaling Horizontal Factor M\nSpecify the higher 8-bit of denominator part (M) of the horizontal scaling factor.\nPlease refer to the register 'CCAP_PKTSL' for the detailed operation.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PKTSHNH</name>
              <description>Packet Scaling Horizontal Factor N\nSpecify the higher 8-bit of numerator part (N) of the horizontal scaling factor.\nPlease refer to the register 'CCAP_PKTSL' for the detailed operation.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PKTSVMH</name>
              <description>Packet Scaling Vertical Factor M\nSpecify the higher 8-bit of denominator part (M) of the vertical scaling factor.\nPlease refer to the register 'CCAP_PKTSL' to check the cooperation between these two registers.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PKTSVNH</name>
              <description>Packet Scaling Vertical Factor N\nSpecify the higher 8-bit of numerator part (N) of the vertical scaling factor. \nPlease refer to the register 'CCAP_PKTSL' to check the cooperation between these two registers.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CCAP_PLNSM</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CCAP_PLNSM</displayName>
          <description>Planar Scaling Vertical/Horizontal Factor Register (MSB)</description>
          <addressOffset>0x4C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PLNSHMH</name>
              <description>Planar Scaling Horizontal Factor M \nSpecifies the higher 8-bit of denominator part (M) of the horizontal scaling factor\nFor detailed programming, please refer to the register 'CAP_PLNSL'.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLNSHNH</name>
              <description>Planar Scaling Horizontal Factor N \nSpecifies the higher 8-bit of numerator part (N) of the horizontal scaling factor.\nFor detailed programming, please refer to the register 'CAP_PLNSL'.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLNSVMH</name>
              <description>Planar Scaling Vertical Factor M \nSpecifies the lower 8-bit of denominator part (M) of the vertical scaling factor.\nFor detailed programming, please refer to the register 'CAP_PLNSL'.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLNSVNH</name>
              <description>Planar Scaling Vertical Factor N\nSpecifies the higher 8-bit of numerator part (N) of the vertical scaling factor. \nFor detailed programming, please refer to the register 'CAP_PLNSL'.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CCAP_CURADDRP</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CCAP_CURADDRP</displayName>
          <description>Current Packet System Memory Address Byte Counter Register</description>
          <addressOffset>0x50</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CURADDR</name>
              <description>Current Packet Output Memory Address Byte Counter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CCAP_CURADDRY</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CCAP_CURADDRY</displayName>
          <description>Current Planar Y System Memory Address Register</description>
          <addressOffset>0x54</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CURADDR</name>
              <description>Current Planar Y Output Memory Address\nSpecify the 32-bit value of the current planar Y output memory address.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CCAP_CURADDRU</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CCAP_CURADDRU</displayName>
          <description>Current Planar U System Memory Address Register</description>
          <addressOffset>0x58</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CURADDR</name>
              <description>Current Planar U Output Memory Address\nSpecify the 32-bit value of the current planar U output memory address.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CCAP_CURADDRV</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CCAP_CURADDRV</displayName>
          <description>Current Planar V System Memory Address Register</description>
          <addressOffset>0x5C</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CURADDR</name>
              <description>Current Planar V Output Memory Address\nSpecify the 32-bit value of the current planar V output memory address.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CCAP_PKTBA0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CCAP_PKTBA0</displayName>
          <description>System Memory Packet Base Address 0 Register</description>
          <addressOffset>0x60</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BASEADDR</name>
              <description>System Memory Packet Base Address 0\nIt is a word alignment address, that is, the address is aligned by ignoring the 2 LSB bits [1:0].</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CCAP_YBA</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CCAP_YBA</displayName>
          <description>System Memory Planar Y Base Address Register</description>
          <addressOffset>0x80</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BASEADDR</name>
              <description>System Memory Planar Y Base Address\nIt is a word alignment address, that is, the address is aligned by ignoring the 2 LSB bits [1:0].</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CCAP_UBA</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CCAP_UBA</displayName>
          <description>System Memory Planar U Base Address Register</description>
          <addressOffset>0x84</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BASEADDR</name>
              <description>System Memory Planar U Base Address\nIt is a word alignment address, that is, the address is aligned by ignoring the 2 LSB bits [1:0].</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CCAP_VBA</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CCAP_VBA</displayName>
          <description>System Memory Planar V Base Address Register</description>
          <addressOffset>0x88</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BASEADDR</name>
              <description>System Memory Planar V Base Address\nIt is a word alignment address, that is, the address is aligned by ignoring the 2 LSB bits [1:0].</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
