wosayttn/sdk-bsp-numaker-m55m1/Debug/svd/M55M1.svd
       <register>
          <name>CCAP_MDCTL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CCAP_MDCTL</displayName>
          <description>Motion Detection Control Register</description>
          <addressOffset>0x100</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WEN0</name>
              <description>Motion Detection Window 0 Enable Bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Motion Detection Window 0 Disabled</description>
                    <value>00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Motion Detection Window 0 Enabled only when CCAP_INTEN[5:4] (MDIEN) is not equal to 0x0</description>
                    <value>01</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>WEN1</name>
              <description>Motion Detection Window 1 Enable Bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Motion Detection Window 1 Disabled</description>
                    <value>00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Motion Detection Window 1 Enabled only when CCAP_INTEN[5:4] (MDIEN) is not equal to 0x0</description>
                    <value>01</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>WEN2</name>
              <description>Motion Detection Window 2 Enable Bit</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Motion Detection Window 2 Disabled</description>
                    <value>00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Motion Detection Window 2 Enabled only when CCAP_INTEN[5:4] (MDIEN) is not equal to 0x0</description>
                    <value>01</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>WEN3</name>
              <description>Motion Detection Window 3 Enable Bit</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Motion Detection Window 3 Disabled</description>
                    <value>00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Motion Detection Window 3 Enabled only when CCAP_INTEN[5:4] (MDIEN) is not equal to 0x0</description>
                    <value>01</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>WEN4</name>
              <description>Motion Detection Window 4 Enable Bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Motion Detection Window 4 Disabled</description>
                    <value>00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Motion Detection Window 4 Enabled only when CCAP_INTEN[5:4] (MDIEN) is not equal to 0x0</description>
                    <value>01</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>WEN5</name>
              <description>Motion Detection Window 5 Enable Bit</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Motion Detection Window 5 Disabled</description>
                    <value>00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Motion Detection Window 5 Enabled only when CCAP_INTEN[5:4] (MDIEN) is not equal to 0x0</description>
                    <value>01</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>WEN6</name>
              <description>Motion Detection Window 6 Enable Bit</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Motion Detection Window 6 Disabled</description>
                    <value>00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Motion Detection Window 6 Enabled only when CCAP_INTEN[5:4] (MDIEN) is not equal to 0x0</description>
                    <value>01</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>WEN7</name>
              <description>Motion Detection Window 7 Enable Bit</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Motion Detection Window 7 Disabled</description>
                    <value>00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Motion Detection Window 7 Enabled only when CCAP_INTEN[5:4] (MDIEN) is not equal to 0x0</description>
                    <value>01</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>WEN8</name>
              <description>Motion Detection Window 8 Enable Bit</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Motion Detection Window 8 Disabled</description>
                    <value>00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Motion Detection Window 8 Enabled only when CCAP_INTEN[5:4] (MDIEN) is not equal to 0x0,</description>
                    <value>01</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>WEN9</name>
              <description>Motion Detection Window 9 Enable Bit</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Motion Detection Window 9 Disabled</description>
                    <value>00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Motion Detection Window 9 Enabled only when CCAP_INTEN[5:4] (MDIEN) is not equal to 0x0</description>
                    <value>01</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>WEN10</name>
              <description>Motion Detection Window 10 Enable Bit</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Motion Detection Window 10 Disabled</description>
                    <value>00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Motion Detection Window 10 Enabled only when CCAP_INTEN[5:4] (MDIEN) is not equal to 0x0</description>
                    <value>01</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>WEN11</name>
              <description>Motion Detection Window 11 Enable Bit</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Motion Detection Window 11 Disabled</description>
                    <value>00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Motion Detection Window 11 Enabled only when CCAP_INTEN[5:4] (MDIEN) is not equal to 0x0</description>
                    <value>01</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>WEN12</name>
              <description>Motion Detection Window 12 Enable Bit</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Motion Detection Window 12 Disabled</description>
                    <value>00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Motion Detection Window 12 Enabled only when CCAP_INTEN[5:4] (MDIEN) is not equal to 0x0</description>
                    <value>01</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>WEN13</name>
              <description>Motion Detection Window 13 Enable Bit</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Motion Detection Window 13 Disabled</description>
                    <value>00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Motion Detection Window 13 Enabled only when CCAP_INTEN[5:4] (MDIEN) is not equal to 0x0</description>
                    <value>01</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>WEN14</name>
              <description>Motion Detection Window 14 Enable Bit</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Motion Detection Window 14 Disabled</description>
                    <value>00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Motion Detection Window 14 Enabled only when CCAP_INTEN[5:4] (MDIEN) is not equal to 0x0</description>
                    <value>01</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>WEN15</name>
              <description>Motion Detection Window 15 Enable Bit</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Motion Detection Window 15 Disabled</description>
                    <value>00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Motion Detection Window 15 Enabled only when CCAP_INTEN[5:4] (MDIEN) is not equal to 0x0</description>
                    <value>01</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CCAP_MDTRG_WK</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CCAP_MDTRG_WK</displayName>
          <description>Motion Detection Trigger and Wakeup Register</description>
          <addressOffset>0x104</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TRGSEL</name>
              <description>Trigger Source Selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>LPTMR0</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>LPTMR1</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>TTMR0</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>TTMR1</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>WKEN</name>
              <description>Wake-up Function Enable Bit\nIf this bit is set to 1, while Motion Detection Modes interrupt MDINTF (CCAP_INTSTS[5:4]) is 1 and MDIEN (CCAP_INTEN[5:4]) is enabled, the CCAP interrupt signal will generate a wake-up trigger event to CPU.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Wake-up function Disabled if CCAP interrupt signal generated</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Wake-up function Enabled if CCAP interrupt signal generated</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>WKF</name>
              <description>CCAP Wake-up Flag\nThis bit indicates the interrupt wake-up flag status of CCAP.\nNote: This bit is cleared by writing 1 to it.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>CCAP does not cause CPU wake-up</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>CPU wake-up from Idle or Power-down mode if MDINTF (CCAP_INTSTS[5:4]) are generated</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CCAP_MDTTH</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CCAP_MDTTH</displayName>
          <description>Motion Detection Total Threshold Register</description>
          <addressOffset>0x110</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MDTTH</name>
              <description>Motion Detection Total Threshold\nSpecify the 21-bit threshold value for checking if the total SAD of all windows (CCAP_MDTSAD) is overflow\nNote: The maximum value of MDTSAD is 0x12AD40.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>21</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CCAP_MDTSAD</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CCAP_MDTSAD</displayName>
          <description>Motion Detection Total SAD Register</description>
          <addressOffset>0x114</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MDTSAD</name>
              <description>Motion Detection Total SAD\nNote: The maximum value of MDTSAD is 0x12AD40.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>21</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CCAP_MDWOCTH</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CCAP_MDWOCTH</displayName>
          <description>Motion Detection Window Overflow Counter Threshold Register</description>
          <addressOffset>0x120</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MDWOCTH</name>
              <description>Motion Detection Window Overflow Counter threshold\nSpecify the 4-bit threshold value for checking if CCAP_MDWOC is overflow.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CCAP_MDWOC</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CCAP_MDWOC</displayName>
          <description>Motion Detection Window Overflow Counter Register</description>
          <addressOffset>0x124</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MDWOC</name>
              <description>Motion Detection Window Overflow Counter \nThe counter of windows that their CCAP_MDWSADx are larger than their CCAP_MDWTHx.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CCAP_MDWTH0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CCAP_MDWTH0</displayName>
          <description>Motion Detection Window Threshold 0 Register</description>
          <addressOffset>0x140</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MDWTH</name>
              <description>Motion Detection Window Threshold \nSpecify the 17-bit threshold value for checking if the SAD of window x (CCAP_MDWSADx) is overflow.\nNote: The maximum value of MDWSAD is 0x12AD4.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>17</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="CCAP_MDWTH0">
          <name>CCAP_MDWTH1</name>
          <displayName>CCAP_MDWTH1</displayName>
          <description>Motion Detection Window Threshold 1 Register</description>
          <addressOffset>0x144</addressOffset>
       </register>
       <register derivedFrom="CCAP_MDWTH0">
          <name>CCAP_MDWTH2</name>
          <displayName>CCAP_MDWTH2</displayName>
          <description>Motion Detection Window Threshold 2 Register</description>
          <addressOffset>0x148</addressOffset>
       </register>
       <register derivedFrom="CCAP_MDWTH0">
          <name>CCAP_MDWTH3</name>
          <displayName>CCAP_MDWTH3</displayName>
          <description>Motion Detection Window Threshold 3 Register</description>
          <addressOffset>0x14C</addressOffset>
       </register>
       <register derivedFrom="CCAP_MDWTH0">
          <name>CCAP_MDWTH4</name>
          <displayName>CCAP_MDWTH4</displayName>
          <description>Motion Detection Window Threshold 4 Register</description>
          <addressOffset>0x150</addressOffset>
       </register>
       <register derivedFrom="CCAP_MDWTH0">
          <name>CCAP_MDWTH5</name>
          <displayName>CCAP_MDWTH5</displayName>
          <description>Motion Detection Window Threshold 5 Register</description>
          <addressOffset>0x154</addressOffset>
       </register>
       <register derivedFrom="CCAP_MDWTH0">
          <name>CCAP_MDWTH6</name>
          <displayName>CCAP_MDWTH6</displayName>
          <description>Motion Detection Window Threshold 6 Register</description>
          <addressOffset>0x158</addressOffset>
       </register>
       <register derivedFrom="CCAP_MDWTH0">
          <name>CCAP_MDWTH7</name>
          <displayName>CCAP_MDWTH7</displayName>
          <description>Motion Detection Window Threshold 7 Register</description>
          <addressOffset>0x15C</addressOffset>
       </register>
       <register derivedFrom="CCAP_MDWTH0">
          <name>CCAP_MDWTH8</name>
          <displayName>CCAP_MDWTH8</displayName>
          <description>Motion Detection Window Threshold 8 Register</description>
          <addressOffset>0x160</addressOffset>
       </register>
