wosayttn/sdk-bsp-numaker-m55m1/Debug/svd/M55M1.svd
       <register derivedFrom="CCAP_MDWTH0">
          <name>CCAP_MDWTH9</name>
          <displayName>CCAP_MDWTH9</displayName>
          <description>Motion Detection Window Threshold 9 Register</description>
          <addressOffset>0x164</addressOffset>
       </register>
       <register derivedFrom="CCAP_MDWTH0">
          <name>CCAP_MDWTH10</name>
          <displayName>CCAP_MDWTH10</displayName>
          <description>Motion Detection Window Threshold 10 Register</description>
          <addressOffset>0x168</addressOffset>
       </register>
       <register derivedFrom="CCAP_MDWTH0">
          <name>CCAP_MDWTH11</name>
          <displayName>CCAP_MDWTH11</displayName>
          <description>Motion Detection Window Threshold 11 Register</description>
          <addressOffset>0x16C</addressOffset>
       </register>
       <register derivedFrom="CCAP_MDWTH0">
          <name>CCAP_MDWTH12</name>
          <displayName>CCAP_MDWTH12</displayName>
          <description>Motion Detection Window Threshold 12 Register</description>
          <addressOffset>0x170</addressOffset>
       </register>
       <register derivedFrom="CCAP_MDWTH0">
          <name>CCAP_MDWTH13</name>
          <displayName>CCAP_MDWTH13</displayName>
          <description>Motion Detection Window Threshold 13 Register</description>
          <addressOffset>0x174</addressOffset>
       </register>
       <register derivedFrom="CCAP_MDWTH0">
          <name>CCAP_MDWTH14</name>
          <displayName>CCAP_MDWTH14</displayName>
          <description>Motion Detection Window Threshold 14 Register</description>
          <addressOffset>0x178</addressOffset>
       </register>
       <register derivedFrom="CCAP_MDWTH0">
          <name>CCAP_MDWTH15</name>
          <displayName>CCAP_MDWTH15</displayName>
          <description>Motion Detection Window Threshold 15 Register</description>
          <addressOffset>0x17C</addressOffset>
       </register>
       <register>
          <name>CCAP_MDWSAD0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CCAP_MDWSAD0</displayName>
          <description>Motion Detection Window SAD 0 Register</description>
          <addressOffset>0x180</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MDWSAD</name>
              <description>Motion Detection Window SAD \nThe 17-bit value for the SAD (Sum of Absolute Differences) of window x.\nNote: The maximum value of MDWSAD is 0x12AD4.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>17</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="CCAP_MDWSAD0">
          <name>CCAP_MDWSAD1</name>
          <displayName>CCAP_MDWSAD1</displayName>
          <description>Motion Detection Window SAD 1 Register</description>
          <addressOffset>0x184</addressOffset>
       </register>
       <register derivedFrom="CCAP_MDWSAD0">
          <name>CCAP_MDWSAD2</name>
          <displayName>CCAP_MDWSAD2</displayName>
          <description>Motion Detection Window SAD 2 Register</description>
          <addressOffset>0x188</addressOffset>
       </register>
       <register derivedFrom="CCAP_MDWSAD0">
          <name>CCAP_MDWSAD3</name>
          <displayName>CCAP_MDWSAD3</displayName>
          <description>Motion Detection Window SAD 3 Register</description>
          <addressOffset>0x18C</addressOffset>
       </register>
       <register derivedFrom="CCAP_MDWSAD0">
          <name>CCAP_MDWSAD4</name>
          <displayName>CCAP_MDWSAD4</displayName>
          <description>Motion Detection Window SAD 4 Register</description>
          <addressOffset>0x190</addressOffset>
       </register>
       <register derivedFrom="CCAP_MDWSAD0">
          <name>CCAP_MDWSAD5</name>
          <displayName>CCAP_MDWSAD5</displayName>
          <description>Motion Detection Window SAD 5 Register</description>
          <addressOffset>0x194</addressOffset>
       </register>
       <register derivedFrom="CCAP_MDWSAD0">
          <name>CCAP_MDWSAD6</name>
          <displayName>CCAP_MDWSAD6</displayName>
          <description>Motion Detection Window SAD 6 Register</description>
          <addressOffset>0x198</addressOffset>
       </register>
       <register derivedFrom="CCAP_MDWSAD0">
          <name>CCAP_MDWSAD7</name>
          <displayName>CCAP_MDWSAD7</displayName>
          <description>Motion Detection Window SAD 7 Register</description>
          <addressOffset>0x19C</addressOffset>
       </register>
       <register derivedFrom="CCAP_MDWSAD0">
          <name>CCAP_MDWSAD8</name>
          <displayName>CCAP_MDWSAD8</displayName>
          <description>Motion Detection Window SAD 8 Register</description>
          <addressOffset>0x1A0</addressOffset>
       </register>
       <register derivedFrom="CCAP_MDWSAD0">
          <name>CCAP_MDWSAD9</name>
          <displayName>CCAP_MDWSAD9</displayName>
          <description>Motion Detection Window SAD 9 Register</description>
          <addressOffset>0x1A4</addressOffset>
       </register>
       <register derivedFrom="CCAP_MDWSAD0">
          <name>CCAP_MDWSAD10</name>
          <displayName>CCAP_MDWSAD10</displayName>
          <description>Motion Detection Window SAD 10 Register</description>
          <addressOffset>0x1A8</addressOffset>
       </register>
       <register derivedFrom="CCAP_MDWSAD0">
          <name>CCAP_MDWSAD11</name>
          <displayName>CCAP_MDWSAD11</displayName>
          <description>Motion Detection Window SAD 11 Register</description>
          <addressOffset>0x1AC</addressOffset>
       </register>
       <register derivedFrom="CCAP_MDWSAD0">
          <name>CCAP_MDWSAD12</name>
          <displayName>CCAP_MDWSAD12</displayName>
          <description>Motion Detection Window SAD 12 Register</description>
          <addressOffset>0x1B0</addressOffset>
       </register>
       <register derivedFrom="CCAP_MDWSAD0">
          <name>CCAP_MDWSAD13</name>
          <displayName>CCAP_MDWSAD13</displayName>
          <description>Motion Detection Window SAD 13 Register</description>
          <addressOffset>0x1B4</addressOffset>
       </register>
       <register derivedFrom="CCAP_MDWSAD0">
          <name>CCAP_MDWSAD14</name>
          <displayName>CCAP_MDWSAD14</displayName>
          <description>Motion Detection Window SAD 14 Register</description>
          <addressOffset>0x1B8</addressOffset>
       </register>
       <register derivedFrom="CCAP_MDWSAD0">
          <name>CCAP_MDWSAD15</name>
          <displayName>CCAP_MDWSAD15</displayName>
          <description>Motion Detection Window SAD 15 Register</description>
          <addressOffset>0x1BC</addressOffset>
       </register>
