wosayttn/sdk-bsp-numaker-m55m1/Debug/svd/M55M1.svd
       <register>
          <name>LPSPI_AUTOCTL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>LPSPI_AUTOCTL</displayName>
          <description>LPSPI Automatic Operation Control Register</description>
          <addressOffset>0x50</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TRIGSEL</name>
              <description>Automatic Operation Trigger Source Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Low Power Auto-operation Trigger Source from LPTMR0</description>
                    <value>#0000</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Low Power Auto-operation Trigger Source from LPTMR1</description>
                    <value>#0001</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>Low Power Auto-operation Trigger Source from TTMR0</description>
                    <value>#0010</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Low Power Auto-operation Trigger Source from TTMR1</description>
                    <value>#0011</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>4</name>
                    <description>Low Power Auto-operation Trigger Source from LPGPIO0 (PA.0)</description>
                    <value>#0100</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>5</name>
                    <description>Low Power Auto-operation Trigger Source from LPGPIO1 (PB.0)</description>
                    <value>#0101</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>6</name>
                    <description>Low Power Auto-operation Trigger Source from LPGPIO2 (PC.0)</description>
                    <value>#0110</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>7</name>
                    <description>Low Power Auto-operation Trigger Source from LPGPIO3 (PD.0)</description>
                    <value>#0111</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIGEN</name>
              <description>Automatic Operation Trigger Enable Bit\nIn Auomatic Operation Master mode, the automatic operation of LPSPI will be triggered by a event sent from the trigger source selected by TRIGSEL[3:0] after this bit is set to 1.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>LPSPI Automatic Operation Trigger Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>LPSPI Automatic Operation Trigger Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>CNTIEN</name>
              <description>TCNT Count Match Interrupt Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>TCNT count match interrupt Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>TCNT count match interrupt Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>FULLRXEN</name>
              <description>Full RX Data Acception Enable Bit\nIn Auomatic Operation Master mode and LPSPI operates in full-duplex mode, the RX data will be saved from RX buffer by LPPDMA while in TX Phase after this bit is set to 1.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SSWKEN</name>
              <description>Slave Select Wake Up Enable Bit\nIn Slave mode, the CPU will be woken up by SS falling or rising edge in NPDx mode after this bit is set to 1.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>LPSPI SS wake-up function Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>LPSPI SS wake-up function Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>AUTOEN</name>
              <description>Automatic Operation Mode Enable Bit</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Automatic operation master mode Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Automatic operation master mode Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SWTRIG</name>
              <description>Software Trigger (Write Only)\nAfter AUTOEN set to 1, software can manually trigger the Automatic Operation Master mode by writing 1 to this bit.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CNTWKEN</name>
              <description>TCNT Count Match Wake Up Enable Bit\nNote: If TCNT is set to 0, TCNT count match wake-up function will remain disabled even if CNTWKEN is set to 1.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>TCNT count match wake-up function Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>TCNT count match wake-up function Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>TCNT</name>
              <description>Auomatic Operation RX Transfer Count\nIn Auomatic Operation Master mode, TCNT represents the required number of RX data received from external LPSPI slave device while in RX Phase. The maximum transfer count is 255.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>LPSPI_AUTOSTS</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>LPSPI_AUTOSTS</displayName>
          <description>LPSPI Automatic Operation Status Register</description>
          <addressOffset>0x54</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CNTIF</name>
              <description>TCNT Count Match Interrupt Flag\nWhen the received data count matchs the setting value of TCNT, this bit will be set to 1.\nSoftware can write 1 to clear this bit.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>The received data count is less than the setting value of TCNT</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The received data count is equal than the setting value of TCNT</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SSWKF</name>
              <description>Slave Select Wake Up Flag\nIn Slave mode, when chip is woken up from NPDx mode by LPSPI, this bit is set to 1. Software can write 1 to clear this bit.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AOBUSY</name>
              <description>Automatic Operation Busy Flag\nWhen there were one or more requests from trigger sources during auto operation, this bit will be set to 1. Software can write 1 to clear this bit.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNTWKF</name>
              <description>TCNT Count Match Wake Up Flag\nWhen chip is woken up due to the received data count matching the setting value of TCNT, this bit will be set to 1.\nSoftware can write 1 to clear this bit.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
