wosayttn/sdk-bsp-numaker-m55m1/Debug/svd/M55M1.svd
       <register>
          <name>SPIM_RXCLKDLY</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SPIM_RXCLKDLY</displayName>
          <description>RX Clock Delay Control Register</description>
          <addressOffset>0xC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RDDLYSEL</name>
              <description>Sampling Clock Delay Selection for Received Data for Normal I/O Mode, DMA Read Mode, DMA Write Mode, Direct Memory Mapping Mode, and SPI FLASH Only\nDetermine the number of inserted delay cycles. Used to adjust the sampling clock of received data to latch the correct data.\n0x0: No delay. (Default)\n0x1: Delay 0.5 SPI Flash clock.\n0x2: Delay 1 SPI Flash clocks.\n0x3: Delay 1.5 SPI Flash clocks.\n...\n0xf: Delay 7.5 SPI Flash clocks\nNote 1: The manufacturer or device ID of SPI Flash component can be used to determine the correct setting value of RDDLYSEL. An example is given as follows.\nFor example, the manufacturer ID and device ID of SPI Flash for some vendor are 0xEF and 0x1234 separately. First, set RDDLYSEL to 0x0, and use read manufacturer id/device id command to read the manufacturer id of SPI Flash by using normal I/O mode (the manufacturer id is 0xEF (1110_1111) in this example).\nIf the manufacturer ID which reads from SPI Flash is 0xF7 (1111_0111), it denotes that manufacturer id is shifted the right by 1 bit and most significant bit (MSB) of manufacturer id is assigned to 1. According to manufacturer id reads from SPI Flash, RDDLYSEL needs to be set to 0x1 to receive SPI Flash data correctly.\nNote 2: If read command of SPI FLASH sneds out DS (Data Strobe), and we recommand to use DS and HYPERDLL to sample RX data from SPI FLASH. RDDLYSEL is only used to sample RX data when read command of SPI FLASH doesn't send out DS (Data Strobe).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>SPIM_RX0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SPIM_RX0</displayName>
          <description>Data Receive Register 0</description>
          <addressOffset>0x10</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXDAT</name>
              <description>Data Receive Register\nThe Data Receive Registers hold the received data of the last executed transfer. \nNumber of valid RX registers is specified in SPIM_CTL0[BURSTNUM]. If BURSTNUM  0, received data are held in the most significant RXDAT register first.\nNumber of valid-bit is specified in SPIM_CTL0[DWIDTH]. If DWIDTH is 16, 24, or 32, received data are held in the least significant byte of RXDAT register first.\nIn a byte, received data are held in the most significant bit of RXDAT register first.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="SPIM_RX0">
          <name>SPIM_RX1</name>
          <displayName>SPIM_RX1</displayName>
          <description>Data Receive Register 1</description>
          <addressOffset>0x14</addressOffset>
       </register>
       <register derivedFrom="SPIM_RX0">
          <name>SPIM_RX2</name>
          <displayName>SPIM_RX2</displayName>
          <description>Data Receive Register 2</description>
          <addressOffset>0x18</addressOffset>
       </register>
       <register derivedFrom="SPIM_RX0">
          <name>SPIM_RX3</name>
          <displayName>SPIM_RX3</displayName>
          <description>Data Receive Register 3</description>
          <addressOffset>0x1C</addressOffset>
       </register>
       <register>
          <name>SPIM_TX0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SPIM_TX0</displayName>
          <description>Data Transmit Register 0</description>
          <addressOffset>0x20</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXDAT</name>
              <description>Data Transmit Register\nThe Data Transmit Registers hold the data to be transmitted in next transfer. \nNumber of valid TXDAT registers is specified in SPIM_CTL0[BURSTNUM]. If BURSTNUM  0, data are transmitted in the most significant TXDAT register first.\nNumber of valid-bit is specified in SPIM_CTL0[DWIDTH]. If DWIDTH is 16, 24, or 32, data are transmitted in the least significant byte of TXDAT register first.\nIn a byte, data are transmitted in the most significant bit of TXDAT register first.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="SPIM_TX0">
          <name>SPIM_TX1</name>
          <displayName>SPIM_TX1</displayName>
          <description>Data Transmit Register 1</description>
          <addressOffset>0x24</addressOffset>
       </register>
       <register derivedFrom="SPIM_TX0">
          <name>SPIM_TX2</name>
          <displayName>SPIM_TX2</displayName>
          <description>Data Transmit Register 2</description>
          <addressOffset>0x28</addressOffset>
       </register>
       <register derivedFrom="SPIM_TX0">
          <name>SPIM_TX3</name>
          <displayName>SPIM_TX3</displayName>
          <description>Data Transmit Register 3</description>
          <addressOffset>0x2C</addressOffset>
       </register>
       <register>
          <name>SPIM_SRAMADDR</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SPIM_SRAMADDR</displayName>
          <description>SRAM Memory Address Register</description>
          <addressOffset>0x30</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADDR</name>
              <description>SRAM Memory Address\nFor DMA Read mode, this is the destination address for DMA transfer.\nFor DMA Write mode, this is the source address for DMA transfer.\nNote: This address must be 8bytes aligned.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>SPIM_DMACNT</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SPIM_DMACNT</displayName>
          <description>DMA Transfer Byte Count Register</description>
          <addressOffset>0x34</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DMACNT</name>
              <description>DMA Transfer Byte Count Register\nIt indicates the transfer length for DMA process. \nNote 1: The unit for counting is byte and the number must be the multiple of 8.\nNote 2: The page program instruction allows from one byte to 256 bytes (a page) of data to be programmed at previously erased (FFh) memory locations for SPI Flash device.\nNote 3: A maximum of 512 bytes can be programmed as long as an aligned 512-byte address boundary is not crossed for HYPER Flash device.\nNote 4: Please check specification of used SPI Flash and Hyper Flash to know maximum byte length of page program and program address boundary.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>SPIM_FADDR</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SPIM_FADDR</displayName>
          <description>Address Register for SPI Flash and Hyper Device</description>
          <addressOffset>0x38</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Address Register for SPI Flash and Hyper Device\nFor DMA Read mode, this is the source address for DMA transfer.\nFor DMA Write mode, this is the destination address for DMA transfer.\nNote 1: This address must be 8bytes aligned.\nNote 2: A maximum of 512 bytes can be programmed as long as an aligned 512-byte address boundary is not crossed for HYPER Flash device.\nNote 3: For SPI Flash and Hyper device with 32 Mbytes, the value 'ADDR' is from 0x00000000 to 0x00FFFFFF when using DMA write mode and DMA read mode to write/read data of SPI Flash and Hyper device. Please check specification of used SPI Flash and Hyper Flash to know access address range and program address boundary.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>SPIM_DMMCTL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SPIM_DMMCTL</displayName>
          <description>Direct Memory Mapping Mode Control Register</description>
          <addressOffset>0x44</addressOffset>
          <access>read-write</access>
          <resetValue>0x80080000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ACTSCLKT</name>
              <description>SPI Flash Active SCLK Time for Direct Memory Mapping Mode, DMA Write Mode, and DMA Read Mode Only\nThe bits set time interval between SPIM SS active edge and the position edge of the first serial SPI output clock, as shown in Figure 6.345.\nNote 2: SCLK is SPI output clock\nNote 3: Please check the used SPI Flash specification to know the setting value of this register, and different SPI Flash vendor may use different setting values.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DESELTIM</name>
              <description>SPI Flash Deselect Time for Direct Memory Mapping Mode Only\nSet the minimum time width of SPI Flash deselect time (i.e. Minimum SPIM_SS deselect time), as shown in Figure 6.345.\nNote 3: Please check the used SPI Flash specification to know the setting value of this register, and different SPI Flash vendor may use different setting values.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BWEN</name>
              <description>16 Bytes Burst Wrap Mode Enable Bit for Direct Memory Mapping Mode, and Read Command Code 0xEB, and 0xE7 Only</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Burst Wrap Mode Disabled. (Default)</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Burst Wrap Mode Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>CREN</name>
              <description>Continuous Read Mode Enable Bit for Direct Memory Mapping Mode, Read Command Codes 0xBB, 0xEB, 0xE7, 0x0D, 0xBD, and 0xED Only\nFor read operations of SPI Flash, commands of fast read quad I/O (0xEB), word read quad I/O (0xE7), fast read dual I/O (0xBB), DTR fast read (0x0D), DTR fast read dual I/O (0xBD), and DTR fast read quad I/O (0xED) can further reduce cycles of command phase overhead through setting the 'continuous read mode' after address phase.\nNote: When user sets CREN to 1 to use continuous read mode, SPIM_MODE must be set by used SPI Flash specifications.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Continuous Read Mode Disabled. (Default)</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Continuous Read Mode Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>UACTSCLK</name>
              <description>User Sets SPI Flash Active SCLK Time for Direct Memory Mapping Mode, DMA Write Mode, and DMA Read Mode Only\nNote: When user wants to set ACTSCLKT(SPIM_DMMCTL[7:0]) manually, please set UACTSCLK to 1.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>According to DIVIDER(SPIM_CTL1[31:16]), ACTSCLKT(SPIM_DMMCTL[7:0]) is set by hardware automatically. (Default)</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Set ACTSCLKT(SPIM_DMMCTL[7:0]) by user manually</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>HYPDONE</name>
              <description>Set All Read/Write Operations Done in Direct Memory Mapping Mode for HYPER Device\nNote 1: User must set this bit to 1 after all read/write operations are done in DMM mode for HYPER device, and wait this bit to 0 to indicate that finish process of all read/write operations is done in DMM mode for HYPER device.\nNote 2: User must set this bit to 1 before user switches SPIM operation mode (SPIM_CTL0[23:22]) from DMM mode to Normal I/O mode, DMA write mode, or DMA read mode.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Finish process of all read/write operations is done in DMM mode for HYPER device</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Finish process of all read/write operations is executed in DMM mode for HYPER device. This bit is cleared by hardware automatically</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>DMMIDLE</name>
              <description>DMM Mode Idle State for DMM mode only\nNote 1: User can polling this status register to know DMM mode is in idle state or busy state when user wants to change OPMODE (SPIM_CTL0[23:22]) from DMM mode to Normal I/O mode/DMA write mode/DMA read mode, SPIM cipher enable/disable switch (SPIM_CTL[0]).\nNote 2: This status register keep to 1 when SPIM is in Normal I/O mode, DMA write mode, and DMA read mode.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>DMM mode is in busy state</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>DMM mode is in idle state</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>SPIM_CTL2</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SPIM_CTL2</displayName>
          <description>Control and Status Register 2</description>
          <addressOffset>0x48</addressOffset>
          <access>read-write</access>
          <resetValue>0x00080800</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DC_DMAR</name>
              <description>Dummy Cycle Number for DMA Read Mode Only\nSet number of dummy cycles for DMA read mode only.\nNote 1: When there is not any dummy cycles in this used read command of SPI Flash, user must set DC_DMAR to 0x0.\nNote 2: Number of dummy cycles depends on the frequency of SPI output clock, SPI Flash vendor, and read command types. Please check the used SPI Flash specification to know the setting value of this number of dummy cycles.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DC_DMM</name>
              <description>Dummy Cycle Number for Direct Memory Mapping Mode Only\nSet number of dummy cycles for direct memory mapping mode only.\nNote 1: When there is not any dummy cycles in this used read command of SPI Flash, user must set DC_DMM to 0x0.\nNote 2: Number of dummy cycles depends on the frequency of SPI output clock, SPI Flash vendor, and read command types. Please check the used SPI Flash specification to know the setting value of this number of dummy cycles.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>SPIM_CMDCODE</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SPIM_CMDCODE</displayName>
          <description>Command Code Register</description>
          <addressOffset>0x4C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CMDCODE</name>
              <description>SPI Flash Command Code\nThe SPI Flash command codes are separated in the following types.\nPage Program Command Code for DMA Write mode of SPIM\nRead Command Code for DMA Read mode and DMM mode of SPIM\nNote 1: Quad mode of SPI Flash must be enabled first by normal I/O mode before using quad page program/quad read commands.\nNote 2: Please check SPI Flash specifications for support command codes.\nNote 3: Please disable 'continuous read mode' and 'burst wrap mode' before DMA write mode of SPI Flash controller is used to program data of SPI Flash.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>SPIM_MODE</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SPIM_MODE</displayName>
          <description>Mode Data Register</description>
          <addressOffset>0x50</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MODEDATA</name>
              <description>Mode Data Register\nSet output data for mode phase.\nWhen user sets this mode data (Note1) and set CREN(SPIM_DMMCTL[25]) to enter continuous read mode, this will reduce the command phase by eight clocks and allows the read address to be immediately entered after SPIM_SS asserted to active. (Note1)\nNote 1: Please check the used SPI Flash specification to know the setting value of this mode bits data, and different SPI Flash vendor may use different setting values.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
