wosayttn/sdk-bsp-numaker-m55m1/Debug/svd/M55M1.svd
       <register>
          <name>SPIM_PHDMAR</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SPIM_PHDMAR</displayName>
          <description>Phase Setting Register for DMA Read Mode</description>
          <addressOffset>0x58</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DW_CMD</name>
              <description>Data Width for Command Phase\nThis specifies how many bits are transmitted in this phase.\nNote: Only used for DMA Read mode.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No command phase</description>
                    <value>0x0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>8 bits</description>
                    <value>0x1</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>16 bits</description>
                    <value>0x2</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>24 bits</description>
                    <value>0x3</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>4</name>
                    <description>32 bits</description>
                    <value>0x4</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>DTR_CMD</name>
              <description>Double Transfer Rate Mode Enable Bit for Command Phase\nIn master mode, SPI will transmit data at both rising edge and falling edge of SPI bus clock.\nNote: Only used for DMA Read mode.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>DTR mode Disabled (i.e. Single Transfer Rate (STR) mode enabled)</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>DTR mode Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>BM_CMD</name>
              <description>SPI Interface Bit Mode for Command Phase\nNote: Only used for DMA Read mode.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Standard mode</description>
                    <value>0x0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Dual mode</description>
                    <value>0x1</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>Quad mode</description>
                    <value>0x2</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Octal mode</description>
                    <value>0x3</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>DW_ADDR</name>
              <description>Data Width for Address Phase\nThis specifies how many bits are transmitted in this phase.\nNote: Only used for DMA Read mode.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No address phase</description>
                    <value>0x0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>8 bits</description>
                    <value>0x1</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>16 bits</description>
                    <value>0x2</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>24 bits</description>
                    <value>0x3</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>4</name>
                    <description>32 bits</description>
                    <value>0x4</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>DTR_ADDR</name>
              <description>Double Transfer Rate Mode Enable Bit for Address Phase\nIn master mode, SPI will transmit data at both rising edge and falling edge of SPI bus clock.\nNote: Only used for DMA Read mode.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>DTR mode Disabled (i.e. Single Transfer Rate (STR) mode enabled)</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>DTR mode Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>BM_ADDR</name>
              <description>SPI Interface Bit Mode for Address Phase\nNote: Only used for DMA Read mode.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Standard mode</description>
                    <value>0x0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Dual mode</description>
                    <value>0x1</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>Quad mode</description>
                    <value>0x2</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Octal mode</description>
                    <value>0x3</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>DW_MODE</name>
              <description>Data Width for Mode Phase\nThis specifies how many bits are transmitted in this phase.\nNote: Only used for DMA Read mode.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No mode phase</description>
                    <value>0x0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>8 bits</description>
                    <value>0x1</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>16 bits</description>
                    <value>0x2</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>24 bits</description>
                    <value>0x3</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>4</name>
                    <description>32 bits</description>
                    <value>0x4</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>DTR_MODE</name>
              <description>Double Transfer Rate Mode Enable Bit for Mode Phase\nIn master mode, SPI will transmit data at both rising edge and falling edge of SPI bus clock.\nNote: Only used for DMA Read mode.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>DTR mode Disabled (i.e. Single Transfer Rate (STR) mode enabled)</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>DTR mode Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>BM_MODE</name>
              <description>SPI Interface Bit Mode for Mode Phase\nNote: Only used for DMA Read mode.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Standard mode</description>
                    <value>0x0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Dual mode</description>
                    <value>0x1</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>Quad mode</description>
                    <value>0x2</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Octal mode</description>
                    <value>0x3</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>DTR_DATA</name>
              <description>Double Transfer Rate Mode Enable Bit for Data Phase\nIn master mode, SPI will receive data at both rising edge and falling edge of SPI bus clock.\nNote: Only used for DMA Read mode.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>DTR mode Disabled (i.e. Single Transfer Rate (STR) mode enabled)</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>DTR mode Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>RDQS_DATA</name>
              <description>Read DQS Mode Enable Bit for Data Phase\nIn SPI master mode, SPI uses read DQS signal, which is generated by SPI Flash, to sample RX data from SPI Flash when Read DQS mode is enabled.\nNote: Only used for DMA Read mode.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Read DQS mode Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Read DQS mode Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>RBO_DATA</name>
              <description>Received Data Byte Order of Received Data Phase for Octal SPI Flash\nNote: Only used for DMA Read mode.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Byte order of received data to SPI Flash is byte0, byte1, byte2, byte3, byte4, byte5, byte6, byte7</description>
                    <value>0x0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Byte order of received data to SPI Flash is byte7, byte6, byte5, byte4, byte3, byte2, byte1, byte0</description>
                    <value>0x1</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>Byte order of received data to SPI Flash is byte1, byte0, byte3, byte2, byte5, byte4, byte7, byte6</description>
                    <value>0x2</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Byte order of received data to SPI Flash is byte6, byte7, byte4, byte5, byte2, byte3, byte0, byte1</description>
                    <value>0x3</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>BM_DATA</name>
              <description>SPI Interface Bit Mode for Data Phase\nNote: Only used for DMA Read mode.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Standard mode</description>
                    <value>0x0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Dual mode</description>
                    <value>0x1</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>Quad mode</description>
                    <value>0x2</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Octal mode</description>
                    <value>0x3</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
