wosayttn/sdk-bsp-numaker-m55m1/Debug/svd/M55M1.svd
       <register>
          <name>SPIM_DLL0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SPIM_DLL0</displayName>
          <description>HYPERDLL Control and Status Register 0</description>
          <addressOffset>0x68</addressOffset>
          <access>read-write</access>
          <resetValue>0x00100000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DLLOLDO</name>
              <description>HYPERDLL OLDO Enable Bit\nNote 1: HYPERDLL reference clock will start to send after user sets DLLOLDO to 0x1.\nNote 2: User only writes 1'b1 to DLLOLDO (SPIM_DLL0[0]) once before user starts to trim delay step number of HYPERDLL.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>HYPERDLL OLDO is disabled, and HYPERDLL circuit is in Power-down mode</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>HYPERDLL OLDO is enabled, and HYPERDLL circuit is in power enable mode</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>DLLOVRST</name>
              <description>HYPERDLL Output Valid Counter Reset Enable\nNote 1: This bit will be cleared automatically.\nNote 2: User only writes 1'b1 to DLLOVRST once before user starts to trim delay step number of HYPERDLL. User needs to set DLLOVRST again to wait HYPERDLL output valid when one of frequencies of SPI output bus clock/HyperBus clock, HYPERDLL reference clock, or RWDS/DS clock are changed.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>HYPERDLL output valid counter is not reseted to 0x0 and it does not start to count</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>HYPERDLL output valid counter is reseted to 0x0 and it starts to count from 0x0 to DLLOVNUM (SPIM_DLL1[15:0])</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>DLLCLKON</name>
              <description>HYPERDLL Clock Divider Circuit Status Bit (Read Only)\nNote: User needs to check HYPERDLL Datasheet to know time interval that HYPERDLL clock divider circuit can be enabled after HYPERDLL OLDO is enabled.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>HYPERDLL clock divider circuit is disabled after HYPERDLL OLDO is enabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>HYPERDLL clock divider circuit is enabled after HYPERDLL OLDO is enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>DLLLOCK</name>
              <description>HYPERDLL Lock Status Bit (Read Only)\nNote: User needs to check HYPERDLL Datasheet to know HYPERDLL lock time.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>HYPERDLL is not locked after HYPERDLL reference clock sends to HYPERDLL circuit</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>HYPERDLL is locked after HYPERDLL reference clock sends to HYPERDLL circuit</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>DLLREADY</name>
              <description>HYPERDLL Output Ready Status Bit (Read Only)\nNote: User needs to check status of HYPERDLL output to ready before HYPERDLL output can be used correctly.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>HYPERDLL output is not ready, and HYPERDLL output is not ready to use</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>HYPERDLL output is ready, and HYPERDLL output is ready to use</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>DLL_REF</name>
              <description>HYPERDLL Refresh Status Bit (Read Only)\nNote 1: This bit will be cleared automatically.\nNote 2: User needs to check this bit to know that the refresh flow of HYPERDLL circuit is finished or not.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>The updating flow of new HYPERDLL delay step number DLL_DNUM (SPIM_DLL0[13:8]) of HYPERDLL circuit is finished</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>HYPERDLL circuit is updating the new HYPERDLL delay step number DLL_DNUM (SPIM_DLL0[13:8])</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>DLLATRDY</name>
              <description>HYPERDLL Auto Trim Ready Status Bit (Read Only)\nNote 1: User needs to check status of HYPERDLL auto trim function before HYPERDLL output can be used for flow of HYPERDLL auto trim correctly.\nNote 2: This status bit is valid only when DLLATEN (SPIM_DLL0[16]) is enabled.\nNote 3: This status bit will be cleared to 0 when DLLATEN (SPIM_DLL0[16]) is disabled.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>HYPERDLL auto trim function is not in ready state when DLLATEN (SPIM_DLL0[16]) is enabled and HYPERDLL output is ready</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>HYPERDLL auto trim function is in ready state when DLLATEN (SPIM_DLL0[16]) is enabled and HYPERDLL output is ready</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>DLL_DNUM</name>
              <description>HYPERDLL Delay Step Number\nSet HYPERDLL delay step number.\n0x0: No delay. (Default)\n0x1: HYPERDLL delay read data strobe of RWDS and DQS with 1x (SPIM output bus clock period)/32\n0x2: HYPERDLL delay read data strobe of RWDS and DQS with 2x (SPIM output bus clock period)/32\n0x3: HYPERDLL delay read data strobe of RWDS and DQS with 3x (SPIM output bus clock period)/32\n...\n0x1f: HYPERDLL delay read data strobe of RWDS and DQS with 31x (SPIM output bus clock period)/32</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DLLATEN</name>
              <description>HYPERDLL Auto Trim Enable Bit</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>HYPERDLL auto trim function is disabled for HYPERDLL normal mode and HYPERDLL BIST1 mode</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>HYPERDLL auto trim function is enabled for HYPERDLL normal mode and HYPERDLL BIST1 mode</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>DLLLOOP</name>
              <description>HYPERDLL Delay Time Self-Test Enable Bit</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>HYPERDLL Delay time self-test is disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>HYPERDLL Delay time self-test is enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SIGINTEN</name>
              <description>Selection for Clock Source DQS/RWDS of HYPERDLL Open Loop Delay Line</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>HYPERDLL clock source DQS/RWDS of HYPERDLL open loop delay line is from SPI Flash and HYPER device</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>HYPERDLL clock source DQS/RWDS of HYPERDLL open loop delay line is from HYPERDLL internal clock divider</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>DLLDIVER</name>
              <description>Divider Number Selection of HYPERDLL Internal Clock Divder</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Output frequency of HYPERDLL internal clock divdier equals to input frequency of HYPERDLL internal clock divdier</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Output frequency of HYPERDLL internal clock divdier is (input frequency of HYPERDLL internal clock divdier)/2</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>Output frequency of HYPERDLL internal clock divdier is (input frequency of HYPERDLL internal clock divdier)/4</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Output frequency of HYPERDLL internal clock divdier is (input frequency of HYPERDLL internal clock divdier)/8</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>DLLFAST</name>
              <description>Band Selection of HYPERDLL Reference Clock</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>When frequency of HYPERDLL reference clock equals to 100 MHz</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>When frequency of HYPERDLL reference clock is greater than 100 MHz</description>
                    <value>#01</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>SPIM_DLL1</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SPIM_DLL1</displayName>
          <description>HYPERDLL Control and Status Register 1</description>
          <addressOffset>0x6C</addressOffset>
          <access>read-write</access>
          <resetValue>0x07D01388</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DLLOVNUM</name>
              <description>Clock Cycle Number between HYPERDLL Lock and HYPERDLL Output Valid\nSet cycle number of HYPERDLL output valid. The hardware counter of HYPERDLL output valid will count from 0 to the DLLOVNUM after user sets DLLOVRST (SPIM_DLL0[1]) of HYPERDLL output valid counter to 0x1.\nNote 1: User needs to check datasheet of HYPERDLL to know the time interval between HYPERDLL lock done and HYPERDLL output valid.\nNote 2: The unit of this DLLOVNUM is cycle number of HYPERDLL reference clock that its frequency equals to frequency of SPIM output bus clock.\nNote 3: The default value is 0x1388 when frequency of HYPERDLL reference clock is 100 MHz and valid time of HYPERDLL output is 50us.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DLLLKNUM</name>
              <description>Clock Cycle Number between HYPERDLL Clock Divider Enable and HYPERDLL Lock\nSets cycle number of HYPERDLL lock time after HYPERDLL clock divider is enabled.\nNote 1: User needs to check datasheet of HYPERDLL to know the time interval between HYPERDLL clock divider enable and HYPERDLL lock done.\nNote 2: The unit of this DLLLKNUM is cycle number of HYPERDLL reference clock that its frequency equals to frequency of SPIM output bus clock.\nNote 3: The default value is 0x07D0 when frequency of HYPERDLL reference clock is 100 MHz and HYPERDLL lock time is 20us.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>SPIM_DLL2</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SPIM_DLL2</displayName>
          <description>HYPERDLL Control and Status Register 2</description>
          <addressOffset>0x70</addressOffset>
          <access>read-write</access>
          <resetValue>0x07D007D0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TRIMNUM</name>
              <description>Clock Cycle Number between HYPERDLL Output Valid and HYPERDLL Auto Trim Enable\nSets cycle number of HYPERDLL auto trim to be enabled after HYPERDLL output is valid.\nNote 1: User needs to check Datasheet of HYPERDLL to know the time interval between HYPERDLL output valid and HYPERDLL auto trim enable.\nNote 2: The unit of this TRIMNUM is cycle number of HYPERDLL reference clock that its frequency equals to frequency of SPIM output bus clock.\nNote 3: The default value is 0x07D0 when frequency of HYPERDLL reference clock is 100 MHz and HYPERDLL lock time is 20us.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLKONNUM</name>
              <description>Clock Cycle Number between HYPERDLL OLDO Enable and HYPERDLL Clock Divider Enable\nSets cycle number of HYPERDLL divider to be enabled after HYPERDLL OLDO is enabled.\nNote 1: User needs to check Datasheet of HYPERDLL to know the time interval between HYPERDLL OLDO enable and HYPERDLL clock divider enable.\nNote 2: The unit of this CLKONNUM is cycle number of HYPERDLL reference clock that its frequency equals to frequency of SPIM output bus clock.\nNote 3: The default value is 0x07D0 when frequency of HYPERDLL reference clock is 100 MHz and HYPERDLL lock time is 20us.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>SPIM_HYPER_CMD</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SPIM_HYPER_CMD</displayName>
          <description>HyperBus Command and Status Register</description>
          <addressOffset>0x80</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HYPCMD</name>
              <description>HyperBus Command and Status\nWrite\nNote 1: When an operation is Done, the read value automatically return to 4'b0000.\nNote 2: The encryption and decryption of cipher are not supported, and it only uses to send command to HyperBus device, write control register to HyperBus device, and read status register from HyperBus device.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>HyperBus interface is Idle</description>
                    <value>#0000</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Reset Hyper RAM</description>
                    <value>#0001</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>Read Hyper RAM regsiter (16-Bit, Read Data[15:0]</description>
                    <value>#0010</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>5</name>
                    <description>Exit From Hybrid Sleep and deep power down</description>
                    <value>#0101</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>7</name>
                    <description>Write Hyper RAM regsiter (16-Bit, Write Data[15:0]</description>
                    <value>#0111</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>8</name>
                    <description>Read 2 Bytes (Read Data[15:0]) from memory space of HyperBus device</description>
                    <value>#1000</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>9</name>
                    <description>Read 4 Bytes (Read Data[31:0]) from memory space of HyperBus device</description>
                    <value>#1001</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>12</name>
                    <description>Write 1 Byte (Write Data[7:0]) to memory space of HyperBus device</description>
                    <value>#1100</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>13</name>
                    <description>Write 2 Bytes (Write Data[15:0]) to memory space of HyperBus device</description>
                    <value>#1101</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>14</name>
                    <description>Write 3 Bytes (Write Data[23:0]) to memory space of HyperBus device</description>
                    <value>#1110</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>15</name>
                    <description>Write 4 Bytes (Write Data[31:0]) to memory space of HyperBus device</description>
                    <value>#1111</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
