wosayttn/sdk-bsp-numaker-m55m1/Debug/svd/M55M1.svd
       <register>
          <name>SPIM_HYPER_CONFIG1</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SPIM_HYPER_CONFIG1</displayName>
          <description>HyperBus Configuration Register 1</description>
          <addressOffset>0x84</addressOffset>
          <access>read-write</access>
          <resetValue>0x002ED820</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CSS</name>
              <description>Chip Select Setup Time to Next CK Rising Edge\nThis field indicates the setup time between the chip select and the next CK rising edge</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>3.5 HCLK cycles. (default)</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>4.5 HCLK cycles</description>
                    <value>#01</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>CSH</name>
              <description>Chip Select Hold Time After CK Falling Edge\nThis field indicates the hold time between the last CK falling edge and chip select\nNote: Please set this register to 2'b11 when user uses control register SPIM_HYPER_CMD to read register/memory data from Hyper device.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>2</name>
                    <description>2.5 HCLK cycles</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>3.5 HCLK cycles</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>CSHI</name>
              <description>Chip Select High between Transaction\nThis field indicates the inactive period between two HyperBus transactions\nNote: This field must meet the HyperBus device's specification of tCSHI.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>3</name>
                    <description>4 HCLK cycles</description>
                    <value>#0011</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>15</name>
                    <description>16 HCLK cycles</description>
                    <value>#1111</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>CSMAXLT</name>
              <description>Chip Select Maximum Low Time\nThis field indicates the maximum Low period of the  chip select (CS#) in one transaction\n\nNote1 : This field inidcates the timing of Hyper RAM Chip Select specification so that it has to relative the frequency of HCLK and the DIVIDER (SPIM_CTL1[31:16]) and the unit of the above two formulas are clock cycle number of SPIM HCLK.\nNote2 : This register must be set to 0x000FFFFF for Hyper Flash device.\nNote3 : User needs to check specification of used HYPER RAM device to know the value of timing parameter tCSM with unit 'nano second' (ns).</description>
              <bitOffset>12</bitOffset>
              <bitWidth>20</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>1 HCLK cycle</description>
                    <value>0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>2 HCLK cycles</description>
                    <value>1</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>3 HCLK cycles</description>
                    <value>2</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>4 HCLK cycles</description>
                    <value>3</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>749</name>
                    <description>750 HCLK cycles (3750ns @200 MHz)</description>
                    <value>749</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1048574</name>
                    <description>1048575 HCLK cycles</description>
                    <value>1048574</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1048575</name>
                    <description>1048576 HCLK cycles</description>
                    <value>1048575</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>SPIM_HYPER_CONFIG2</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SPIM_HYPER_CONFIG2</displayName>
          <description>HyperBus Configuration Register 2</description>
          <addressOffset>0x88</addressOffset>
          <access>read-write</access>
          <resetValue>0x04320400</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ACCTWR</name>
              <description>Initial Access Time for Write Data to HYPER Device\nThis field indicates the initial access cycles for write transaction of the HyperBus\nNote1 : This field must be set to the same value as 'Initial Latency' for write operations in Configuration Register 0 in HYPER device.\nNote2 : If user sets value to 0000, the hardware will modify it to 0001 automatically.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>1</name>
                    <description>1 CK cycles</description>
                    <value>#00001</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>2 CK cycles</description>
                    <value>#00010</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>3 CK cycles</description>
                    <value>#00011</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>4</name>
                    <description>4 CK cycles (default)</description>
                    <value>#00100</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>5</name>
                    <description>5 CK cycles</description>
                    <value>#00101</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>6</name>
                    <description>6 CK cycles</description>
                    <value>#00110</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>7</name>
                    <description>7 CK cycles</description>
                    <value>#00111</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>31</name>
                    <description>31 CK cycles</description>
                    <value>#11111</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>RSTNLT</name>
              <description>HyperBus Device RESETN Low Time\nThis field indicates the low period of HyperBus device RESETN (RESET#)\nNote: This field inidcates the timing of HyperBus device RESET# specification so that it has to relative the frequency of HCLK.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>1</name>
                    <description>2 HCLK cycles</description>
                    <value>1</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>3 HCLK cycles</description>
                    <value>2</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>4 HCLK cycles</description>
                    <value>3</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>255</name>
                    <description>255 HCLK cycles</description>
                    <value>255</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>ACCTRD</name>
              <description>Initial Access Time for Read Data from HYPER Device\nThis field indicates the initial access cycles for read transaction of the HyperBus\nNote1 : This field must be set to the same value as 'Initial Latency' for read operations in Configuration Register 0 in HYPER device.\nNote2 : If user sets value to 0000, the hardware will modify it to 0001 automatically.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>1</name>
                    <description>1 CK cycles</description>
                    <value>#00001</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>2 CK cycles</description>
                    <value>#00010</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>3 CK cycles</description>
                    <value>#00011</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>4</name>
                    <description>4 CK cycles. (default)</description>
                    <value>#00100</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>5</name>
                    <description>5 CK cycles</description>
                    <value>#00101</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>6</name>
                    <description>6 CK cycles</description>
                    <value>#00110</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>7</name>
                    <description>7 CK cycles</description>
                    <value>#00111</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>31</name>
                    <description>31 CK cycles</description>
                    <value>#11111</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>SPIM_HYPER_ADR</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SPIM_HYPER_ADR</displayName>
          <description>HyperBus Address Register</description>
          <addressOffset>0x8C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HBADDR</name>
              <description>HyperBus Register Address\nMemory Space Range:\n   0x0000_0000 ~ 0x01FF_FFFF\nRegister Space Range:\nNote 1: It is 'Byte' address.\nNote 2: Up to 32 Mbytesytes of memory space is supported.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>25</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>SPIM_HYPER_WDATA</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SPIM_HYPER_WDATA</displayName>
          <description>HyperBus 32-Bits Write Data Register</description>
          <addressOffset>0x90</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HBWDATA</name>
              <description>HyperBus 32-Bits Write Data\nTo write 1 Byte to HyperBus device, Byte 0 (Data[7:0]) is used\nTo write 2 Bytes to HyperBus device, Byte 1~0 (Data[15:0]) is used\nTo write 3 Bytes to HyperBus device, Byte 2~0 (Data[23:0]) is used\nTo write 4 Bytes to HyperBus device, Byte 3~0 (Data[31:0]) is used</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>SPIM_HYPER_RDATA</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SPIM_HYPER_RDATA</displayName>
          <description>HyperBus 32-Bits Read Data Register</description>
          <addressOffset>0x94</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HBRDATA</name>
              <description>HyperBus 32-bits Read Data\n32-Bits data read from HyperBus device\nNote 1: The byte order of read data is little endian only.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>SPIM_HYPER_INTEN</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SPIM_HYPER_INTEN</displayName>
          <description>HyperBus Interrupt Enable Register</description>
          <addressOffset>0x98</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OPINTEN</name>
              <description>HyperBus Operation Done Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Operation done interrupt is Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Operation done interrupt is Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>SPIM_HYPER_INTSTS</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SPIM_HYPER_INTSTS</displayName>
          <description>HyperBus Interrupt Status Register</description>
          <addressOffset>0x9C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OPDONE</name>
              <description>HyperBus Operation Done Interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>HyperBus operation is busy</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>HyperBus operation is done</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>SPIM_DMM_TIMEOUT_INTERVAL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SPIM_DMM_TIMEOUT_INTERVAL</displayName>
          <description>SPIM DMM Time-out Interval Register</description>
          <addressOffset>0xA0</addressOffset>
          <access>read-write</access>
          <resetValue>0x0000FFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TOCNTDMM</name>
              <description>Time-Out Counter Setting Value for DMM Read Mode only\nUser can set this control register to know if SPIM DMM mode doesn't response read data to MCU over the time interval by this time-out counter settings value, and the time-out event flag of DMM mode (SPIM_DMM_TIMEOUT_FLAG_STS[0]) will go high.\nNote 1: The time interval by this time-out counter settings value equals to time-out counter settings value multiple by clock cycle period of SPIM HCLK.\nNote 2: If setting value of this control register is smaller than 0x1000, then hardware will set this control register to 0x1000 automatically.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>SPIM_DMM_TIMEOUT_FLAG_STS</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SPIM_DMM_TIMEOUT_FLAG_STS</displayName>
          <description>SPIM DMM Time-out Flag Status Register</description>
          <addressOffset>0xA4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DMMTOF</name>
              <description>Time-out Flag for DMM Read Mode only\nNote: Write 1 to clear to 0 for this time-out event flag of DMM mode.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>There is no time-out event when SPIM is in DMM read mode</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>There is time-out event when SPIM is in DMM read mode</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
