wosayttn/sdk-bsp-numaker-m55m1/Debug/svd/M55M1.svd
       <register>
          <name>LPI2C_AUTOCTL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>LPI2C_AUTOCTL</displayName>
          <description>LPI2C Automatic Operation Control Register</description>
          <addressOffset>0x70</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TGSRCSEL</name>
              <description>Low Power Auto-operation Trigger Source Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Low Power Auto-operation Trigger Source from LPTMR0</description>
                    <value>#0000</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Low Power Auto-operation Trigger Source from LPTMR1</description>
                    <value>#0001</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>Low Power Auto-operation Trigger Source from TTMR0</description>
                    <value>#0010</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Low Power Auto-operation Trigger Source from TTMR1</description>
                    <value>#0011</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>4</name>
                    <description>Low Power Auto-operation Trigger Source from WKIOA0(GPA0)</description>
                    <value>#0100</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>5</name>
                    <description>Low Power Auto-operation Trigger Source from WKIOB0(GPB0)</description>
                    <value>#0101</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>6</name>
                    <description>Low Power Auto-operation Trigger Source from WKIOC0(GPC0)</description>
                    <value>#0110</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>7</name>
                    <description>Low Power Auto-operation Trigger Source from WKIOD0(GPD0)</description>
                    <value>#0111</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>8</name>
                    <description>Low Power Auto-operation Trigger Source from Software setting SWTRG(LPI2C_AUTOCTL[31]) to 1</description>
                    <value>#1000</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>TRGEN</name>
              <description>Trigger Source Enable bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>LPIC trigger source disable</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>LPIC trigger source enable</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>TXWKEN</name>
              <description>TX Transfer Count Match Wakeup Enable bit</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Power off after TX transfer count matches TXCNT</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Wakeup after TX transfer count matches TXCNT</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>RXWKEN</name>
              <description>RX Transfer Count Match Wakeup Enable bit</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Power off after RX transfer count matches RXCNT</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Wakeup after RX transfer count matches RXCNT</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>NACKWKEN</name>
              <description>Receive Slave NACK Wakeup Enable bit</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Stop after receiving NACK</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Wakeup after receiving NACK</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>AUTOMODE</name>
              <description>Auto-operation Mode Select\nNote: Use TXWKEN(LPI2C_AUTOCTL[5]) to wakeup system when using auto TXPDMA transfer mode AUTOMODE(LPI2C_AUTOCTL[10:8]) in power-down mode.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No auto-operation</description>
                    <value>#000</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Auto TXPDMA transfer mode</description>
                    <value>#001</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>Auto RXPDMA transfer mode</description>
                    <value>#010</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Random Read mode, repeat start between TX/RX</description>
                    <value>#011</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>4</name>
                    <description>Random Read mode, stop and start between TX/RX</description>
                    <value>#100</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SWTRG</name>
              <description>Auto-operation Mode Software Trigger Bit\nNote: TGSRCSEL(LPI2C_AUTOCTL[3:0]) need to be set to 0x8 first. This bit will be cleared by hardware automatically.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No operation</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Software trigger auto-operattion</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>LPI2C_AUTOSTS</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>LPI2C_AUTOSTS</displayName>
          <description>LPI2C Automatic Operation Status Register</description>
          <addressOffset>0x74</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXWKF</name>
              <description>TX Transfer Count Match Wakeup Flag\nWhen chip is woken up from Power-down mode by LPI2C TX transfer count match, this bit is set to 1. Software can write 1 to clear this bit.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXWKF</name>
              <description>RX Transfer Count Match Wakeup Flag\nWhen chip is woken up from Power-down mode by LPI2C RX transfer count match, this bit is set to 1. Software can write 1 to clear this bit.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERRORWKF</name>
              <description>Error Condition Wakeup Flag\nWhen chip is woken up from Power-down mode by LPI2C receiving NACK from slave, running into bus error or arbitration lost, this bit is set to 1. Software can write 1 to clear this bit.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXFINISH</name>
              <description>Automatic Operation TX Finish Flag</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXFINISH</name>
              <description>Automatic Operation RX Finish Flag</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERRORIF</name>
              <description>ERROR Interrupt Flag\nWhen LPI2C receiving NACK from slave, running into bus error or arbitration lost, this bit is set to 1. Software can write 1 to clear this bit.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AOFINISH</name>
              <description>Automatic Operation Finish Flag\nAOFINISH is set when finishing one round of auto operation, but it will not issue interrupt. Software can write 1 to clear this bit.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BUSY</name>
              <description>Busy Flag\nWhen chip is woken up and this bit is set to 1. It means that there were one or more requests from trigger source during transfer. Software can write 1 to clear this bit.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>LPI2C_AUTOCNT</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>LPI2C_AUTOCNT</displayName>
          <description>LPI2C Automatic Operation Transfer Count Register</description>
          <addressOffset>0x78</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXCNT</name>
              <description>TX Transfer Count\nBit [7:0] is set for TXPDMA and Random Read transfer mode. TXCNT represents the required number of the transfer, the real transfer count is TXCNT + 1. The maximum transfer count is 255 + 1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXCNT</name>
              <description>RX Transfer Count\nBit [23:16] is set for RXPDMA and Random Read transfer mode. RXCNT represents the required number of the transfer, the real transfer count is RXCNT + 1. The maximum transfer count is 255 + 1.\nNote: RXCNT must be set at 1 or above when AUTOMODE (LPI2C_AUTOCTL[10:8]) is 3'b011 or 3'b100</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
