wosayttn/sdk-bsp-numaker-m55m1/Debug/svd/M55M1.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>I3Cn</name>
      <description>I3C Register Map</description>
      <groupName>I3C</groupName>
      <baseAddress>0x4029A000</baseAddress>
      <!-- d -> no access permission -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x8</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xC</offset>
        <size>0x1C</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x34</offset>
        <size>0x14</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x4C</offset>
        <size>0x18</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x6C</offset>
        <size>0x1C</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x8C</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x94</offset>
        <size>0x8</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xB0</offset>
        <size>0x14</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xC8</offset>
        <size>0x18</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x200</offset>
        <size>0x70</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x280</offset>
        <size>0x1C</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
       <register>
          <name>I3C_DEVCTL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>I3C_DEVCTL</displayName>
          <description>I3C Device Control Register</description>
          <addressOffset>0x0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IBAINCL</name>
              <description>I3C Broadcast Address include\nThis bit is used in Master mode of operation. This bit is used to include DWC_mipi_i3c broadcast address (0x7E) for private transfer.\nNote: If I3C broadcast address is not included for the private transfers, In-band Interrupts (IBI) driven from Slaves might not win address arbitration. Hence, the IBIs get delayed.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>I3C Broadcast Address is not included for Private Transfer</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>I3C Broadcast Address is included for Private Transfers</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>PENDINT</name>
              <description>Pending Interrupt Status\nThis field is used in Slave mode of operation. \nThis field is used for setting the interrupt number and is also reflected in I3C_CCCDEVS[3:0] PENDINT.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HJCTL</name>
              <description>Hot-Join ACK/NACK Control \nThis bit is used in master mode of operation. This bit acts as a global control to ACK/NACK the Hot-Join request from the devices. The I3C Master ACK/NACKs the Hot-Join request from other devices connected on the I3C bus, based on programming of this bit.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>ACK the Hot-join request</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>NACK and send broadcast CCC to disable Hot-Join</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>IDLECNT</name>
              <description>Idle Count Multiplier \nThis bit is used in Slave mode of operation. After power-on reset, the Slave controller is enabled only after it sees both SDA and SCL lines idle for a specified time. This idle time is calculated by multiplying IDLE_ MUL with AVAILTC field in the I3C_BUSFAT register. </description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Bus Avaliable time * 1</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Bus Avaliable time * 2</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>Bus Avaliable time * 4</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Bus Avaliable time * 8</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>ADAPTIVE</name>
              <description>Adaptive Mode\n(effect on HJ operation)\nThis field is used in Slave mode of operation. Setting of this bit is NOT required to put the controller in Adaptive Mode. It is only used to enable some features of the Slave controller to adapt to Adaptive I2C/I3C mode of operation. This bit is cleared automatically if the controller determines the mode as I3C. Effect on Hot- Join: If this bit is programmed to 1'b1, the controller initiates a Hot-Join request only after it has switched to I3C mode of operation. If this bit is not set, the controller initiates a Hot- Join without determining the bus mode assuming itself to be on i3c bus. This bit should be set only if the Slave application does not know to which bus the device is connected to.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMAEN</name>
              <description>DMA Handshake Interface Enable </description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>The DMA handshake control has no significance</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Enables the DMA handshake control to interact with external DMA</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>ABORT</name>
              <description>Abort Bit\nThis bit is used in Master mode of operation This bit allows the controller to relinquish the I3C bus before completing the issued transfer In response to an ABORT request, the controller issues the STOP condition after the complete data byte is transferred or received\nThis bit is auto-cleared once the transfer is aborted and the controller issues a 'Transfer Abort' interrupt.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RESUME</name>
              <description>I3C Resume Bit\nThis bit is used to resume the controller after it goes to the halt state.\nNote: This bit is cleared by writing 1 to it.\nIn the Master mode of operation, the controller goes to the halt state due to any type of error in the transfer. After the controller gones to the halt state, the application has to write 1'b1 to this bit to resume the controller. This bit is auto-cleared once the controller resumes the transfers by initiating the next command.\nIn the Slave mode of operation, the controller goes to the halt state due to following conditions:\n&#9632; Any type of error in the transfer \n&#9632; MRL Register updated by the master through SETMRL CCC. \nAfter the controller goes to the halt state, the application has to take necessary action to handle the error condition and then write 1'b1 to this bit to resume the controller. This bit is auto-cleared once the controller is ready to accept new transfers.\n(RESUME cannot auto-clear until GETSTATS CCC is received .if Slave has Protocol Error)</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>RESUME operation is completion</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>RESUME operation is in progress</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Controls whether or not I3C is enabled\nNote:\n1.To Enable the Slave controller, the application must set the ENABLE bit to 1. Enabling the Slave controller might not be instantaneous because it is dependent on the availability of SCL clock on the I3C line.\n2.To Disable the Slave controller, the application after setting the value of 0 to the ENABLE bit must keep polling the ENABLE bit to check whether the bit value is zero. Once the ENABLE bit is read with a value of zero, the application can be sure that the Slave controller is disabled. If the SCL clock is present, the Slave controller takes two SCL clocks to come out of the Disable state.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>I3C controller Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>I3C controller Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>I3C_DEVADDR</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>I3C_DEVADDR</displayName>
          <description>I3C Device Address Register</description>
          <addressOffset>0x4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00008000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SA</name>
              <description>Device Static Address\nThe slave controller uses this address to respond to SETDASA CCC Command to get the Dynamic Address or performs Legacy I2C Read/Write operation.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAVALID</name>
              <description>Static Address Valid\nIn slave mode of operation this bit reflects the value of static_addr_en input port. The input port static_addr_en is expected to be driven to 1 only if the device supports I2C or I3C Static Address. </description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Static Address is invalid</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Static Address is valid</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>DA</name>
              <description>Device Dynamic Address\nIn Master mode, the user/application has to program the Dynamic Address through the Slave interface as it self-assigns its Dynamic Address.\nIn Slave mode, this field is used to indicate the device Dynamic Address after slave completes the dynamic address assignment operation by ENTDAA, SETDASA or SETNEDA CCC.\nNote: This field is read only.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DAVALID</name>
              <description>Dynamic Address Valid \nIn Master mode, the user sets this bit to 1 as it self-assigns its dynamic address.\nIn I3C Slave Mode the Controller sets this bit to 1 when Main Master assigns the Dynamic address during ENTDAA or SETDASA mechanism.\nNote: This bit can be auto-clear to 0 if RSTDAA CCC is reveived.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Dynamic Address is invalid</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Dynamic Address is valid</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>I3C_CMDQUE</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>I3C_CMDQUE</displayName>
          <description>I3C Command Queue Port Register</description>
          <addressOffset>0xC</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CMDQUE</name>
              <description>Command Queue\nPlease refer to chapter Master Command Data Structure and chapter Slave Command Data Structure</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>I3C_RESPQUE</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>I3C_RESPQUE</displayName>
          <description>I3C Response Queue Port Register</description>
          <addressOffset>0x10</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RESPQUE</name>
              <description>Response Queue\nPlease refer to chapter Master Response Data Structure and chapter Slave Response Data Structure</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>I3C_TXRXDAT</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>I3C_TXRXDAT</displayName>
          <description>I3C Transmit and Receive Data Port Register</description>
          <addressOffset>0x14</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAT</name>
              <description>Transmit and Receive Data Port\nTransmit (Write) Operation:\nThe Transmit Data port is mapped to the Tx-Data Buffer. The transmit data should always be packed as 4-byte aligned data words and written to the Transmit Data Port register. If the Command length is not aligned to 4-bytes, then the additional bytes are ignored.\nReceive (Read) Operation:\nThe Receive Data port is mapped to the Rx-Data Buffer. The Receive data is always packed in 4-byte aligned data words and stored in the Rx-Data Buffer. If the command length is not aligned to the 4-bytes, then the additional data bytes have to be ignored.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>I3C_IBIQUE</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>I3C_IBIQUE</displayName>
          <description>I3C In-Band Interrupt Queue Data Register</description>
          <addressOffset>0x18</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IBIDAT</name>
              <description>In-Band Interrupt Data \nThis register is used in master mode of operation. \nThis register when read from, reads the data from the IBI Queue. This register is mapped to the IBI Queue.The IBI Data is always packed in 4-byte aligned and put to the IBI Queue. If the incoming data is not aligned to the 4-bytes, then there are unused bytes in the end location of the IBI transfer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>I3C_IBISTS</name>
          <alternateRegister>I3C_IBIQUE</alternateRegister>
          <!-- the display name is an unrestricted string. -->
          <displayName>I3C_IBISTS</displayName>
          <description>I3C In-Band Interrupt Queue Status Register</description>
          <addressOffset>0x18</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATLEN</name>
              <description>In-Band Interrupt data length \nThis field represents the length of data received along with the IBI, in bytes.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IBIID</name>
              <description>IBI Identifier \nThe byte received after START which includes the address and the R/W bit. \nDevice address and R/W bit in case of Slave Interrupt or Master Request. \nHot-Join ID and R/W bit in case of Hot-Join IBI.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IBISTS</name>
              <description>I IBI Received Status \nDefines the master response for IBI received. \n4'b0xxx: Responded with ACK \n4'b1xxx: Responded with NACK \nOthers: RESERVED</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>I3C_QUETHCTL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>I3C_QUETHCTL</displayName>
          <description>I3C Queue Threshold Control Register</description>
          <addressOffset>0x1C</addressOffset>
          <access>read-write</access>
          <resetValue>0x01000101</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CMDETH</name>
              <description>Command Buffer Empty Threshold Value\nControls the number of empty locations (or greater) in the Command Queue that trigger CMD_QUEUE_READY_STAT interrupt. The valid range is 0 to CMD_BUF_DEPTH-1. The software programs only valid values. Value of N ranging from 1 to CMD_BUF_DEPTH-1 sets the threshold to N empty locations and a value of 0 sets the threshold to indicate that the queue is completely empty.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RESPTH</name>
              <description>Response Buffer Threshold Value\nControls the number of entries (or greater) in the Response\nQueue that trigger the RESP_READY_STAT_INTR interrupt.\nThe valid range is 0 to RESP_DT-1. The software programs only valid values. A value of 0 sets the threshold for 1 entry, and a value of N sets the threshold for N+1 entries.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IBIDATTH</name>
              <description>IBI Data Threshold Value \nThis field represents the IBI data segment size in Dwords (4 bytes). The minimum supported segment size is 1 (4 bytes) and the maximum supported size is IC_IBI_DATA_BUF_DEPTH-1. The IBI_DATA_THLD field enables the slicing of the incoming IBI data and generate individual status and thereby promotes the cut-through operation in reading out the IBI data.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IBISTSTH</name>
              <description>In-Band Interrupt Status Threshold Value\nEvery In Band Interrupt received by I3C controller generates an IBI status. This field controls the number of IBI status entries (or greater) in the IBI queue that trigger the IBI_THLD_STAT interrupt. The valid range is 0 to IC_IBI_BUF_DEPTH-1. The software programs only valid values. A value of 0 sets the threshold for 1 entry, and a value of N sets the threshold for N+1 entries. </description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
