wosayttn/sdk-bsp-numaker-m55m1/Debug/svd/M55M1.svd
       <register>
          <name>I3C_DBTHCTL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>I3C_DBTHCTL</displayName>
          <description>I3C Data Buffer Threshold Control Register</description>
          <addressOffset>0x20</addressOffset>
          <access>read-write</access>
          <resetValue>0x01010101</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXTH</name>
              <description>Transmit Buffer Threshold Value\nThe supported values for TXTH are</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>1</description>
                    <value>#000</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>4</description>
                    <value>#001</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>8</description>
                    <value>#010</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>16</description>
                    <value>#011</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>4</name>
                    <description>32</description>
                    <value>#100</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>RXTH</name>
              <description>Receive Buffer Threshold Value\nThe supported values for RXTH are</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>1</description>
                    <value>#000</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>4</description>
                    <value>#001</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>8</description>
                    <value>#010</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>16</description>
                    <value>#011</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>4</name>
                    <description>32</description>
                    <value>#100</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>TXSTATH</name>
              <description>Transfer Start Threshold Value \nIn master mode of operation when the controller is set up to initiate a write transfer, it waits until either one of the following conditions are met before it initiates the write transfer on the I3C Interface.\nIn slave mode of operation the slave controller ACK's a read request from Master only if either one of the following conditions are met:\n1. Data length (as specified in the command) number of locations are filled in the Transmit FIFO\n2. Threshold number of entries (or more) are available in the Transmit FIFO\nThe supported values for RXSTATH are:</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>1</description>
                    <value>#000</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>4</description>
                    <value>#001</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>8</description>
                    <value>#010</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>16</description>
                    <value>#011</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>4</name>
                    <description>32</description>
                    <value>#100</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>RXSTATH</name>
              <description>Receive Start Threshold Value \nIn master mode of operation when the controller is set up to initiate a read transfer, it waits until either one of the conditions are met before it initiates the read transfer on the I3C Interface.\nIn the slave mode of operation the slave controller ACK's a write request from Master only if threshold number of empty locations(or more) are available in its receive buffer.\nThe supported values for RXSTATH are:</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>1</description>
                    <value>#000</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>4</description>
                    <value>#001</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>8</description>
                    <value>#010</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>16</description>
                    <value>#011</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>4</name>
                    <description>32</description>
                    <value>#100</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>I3C_IBIQCTL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>I3C_IBIQCTL</displayName>
          <description>I3C IBI Queue Control Register</description>
          <addressOffset>0x24</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HJREJ</name>
              <description>Notify Rejected Master Request Control \nThis bit is used to suppress reporting to the application about Master request rejected. \n0x0 : Notify Master Request Rejected Disable \n0x1 : Notify Master Request Rejected Enable\nNote: This register is only used in master mode of operation</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MRREJ</name>
              <description>Notify Rejected Master Request Control\nThis bit is used to suppress reporting to the application about Master request rejected.\n 0x0 : Notify Master Request Rejected Disable\n 0x1 : Notify Master Request Rejected Enable \nNote: This register is only used in master mode of operation</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SIRREJ</name>
              <description>Notify Rejected Slave Interrupt Request Control \nThis bit is used to suppress reporting to the application about SIR request rejected. \n0x0 : Notify SIR Rejected Disable \n0x1 : Notify SIR Rejected Enable\nNote: This register is only used in master mode of operation</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>I3C_RSTCTL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>I3C_RSTCTL</displayName>
          <description>I3C Reset Control Register</description>
          <addressOffset>0x34</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWRST</name>
              <description>Core Software Reset\nWrite 1'b1 to this bit to exercise software reset. This resets all Buffers - Receive, Transmit, Command, and Response. This bit is cleared automatically once the core reset is complete.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMDRST</name>
              <description>Command Queue Software Reset\nWrite 1'b1 to this bit to exercise Command Queue reset. This bit is cleared automatically once the Command Queue reset is complete.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RESPRST</name>
              <description>Response Queue Software Reset\nWrite 1'b1 to this bit to exercise Response Queue reset. This bit is cleared automatically once the Response Queue reset is complete.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXRST</name>
              <description>Transmit Buffer Software Reset\nWrite 1'b1 to this bit to exercise Transmit Buffer reset. This bit is cleared automatically once the Transmit Buffer reset is completed.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXRST</name>
              <description>Receive Buffer Software Reset\nWrite 1'b1 to this bit to exercise Receive Buffer reset. This bit is cleared automatically once the Receive buffer reset is\ncompleted.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IBIQRST</name>
              <description>IBI Queue Software Reset \nThis bit is only used in master mode of operation. Write 1'b1 to this bit to exercise IBI Queue reset This bit is cleared automatically once the IBI Queue reset is completed</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BUSRSTPY</name>
              <description>Bus Reset type \nType of bus reset triggered by BUS_RESET field. \n2'b00: EXIT: Exit Pattern \n2'b11: SCL_LOW_RESET Pattern</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BUSRST</name>
              <description>Bus Reset \nThis bit is only used in master mode of operation. Write 1'b1 to this bit to exercise Bus Reset Reset Pattern Generation based on Bus Reset Type selection. This bit is cleared automatically once the Bus Reset Pattern Generation is completed.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>I3C_SLVEVNTS</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>I3C_SLVEVNTS</displayName>
          <description>I3C Slave Event Status Register</description>
          <addressOffset>0x38</addressOffset>
          <access>read-write</access>
          <resetValue>0x0000000B</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SIREN</name>
              <description>Slave Interrupt Request Enable Bit\nIn Slave mode of operation, this bit reflects whether the controller can initiate the SIR on the I3C bus or not. Usually, this bit is set or cleared by the I3C Master through ENEC or DISEC CCC.\nNote: This bit is read only.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MREN</name>
              <description>Master Request Enable Bit\nIn Slave mode of operation, this bit reflects whether the controller can initiate the Master Request on the I3C bus or not.Usually, this bit is set or cleared by the I3C Master throughENEC or DISEC CCC.\nNote: This bit is read only.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HJEN</name>
              <description>Hot-Join Interrupt Enable Bit\nThis bit reflects whether the Hot-Join Request Interrupts are allowed on the I3C bus or not. The Slave application can choose to Disable HJ Capability of the SLave Controller (if selected) by setting this field to 0 before 'Enabling' the Controller. When done so, the Slave does not initiate Hot Join and takes part in Address Assignment without initiating Hot Join. If this field is NOT set to 0 by slave application, it can be set or cleared by the I3C Master through ENEC or DISEC CCCs. Once Disabled by software, CCCs do not have any effect on this field.\nNote: This field is read only.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ACTSTATE</name>
              <description>Activity State Status\nENTAS0 - 00\nENTAS1 - 01\nENTAS2 - 10\nENTAS3 - 11\nThis bit reflects the Activity State of slave set by the Master.\nNote: This field is read only.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MRLUPD</name>
              <description>MRL Updated Status\nThis bit indicates a SETMRL CCC is received by the slave. The updated MRL value can be read from SLV_MAX_LEN register. This status can be cleared by writing 1'b1 to this field after reading the updated MRL.\nNote: This bit is cleared by writing 1 to it.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MWLUPD</name>
              <description>MWL Updated Status\nThis bit indicates a SETMWL CCC is received by the slave. The updated MWL value can be read from SLV_MAX_LEN register. This status can be cleared by writing 1'b1 to this field after reading the updated MWL.\nNote: This bit is cleared by writing 1 to it.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>I3C_INTSTS</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>I3C_INTSTS</displayName>
          <description>I3C Interrupt Status Register</description>
          <addressOffset>0x3C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXTH</name>
              <description>Transmit Buffer Threshold Status\nThis interrupt is generated when the number of empty locations in transmit buffer is greater than or equal to threshold value specified by TXBUF_TD field in I3C_DBTHCTL register. This interrupt is cleared automatically when number of empty locations in transmit buffer is less than threshold value specified.\nNote: This bit is read only.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXTH</name>
              <description>Receive Buffer Threshold Status\nThis interrupt is generated when number of entries in receive buffer is greater than or equal to threshold value specified by RXBUF_TD field in I3C_DBTHCTL register. This interrupt is cleared automatically when number of entries in receive buffer is less than threshold value specified.\nNote: This bit is read only.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IBITH</name>
              <description>IBI Buffer Threshold Status \nThis field is only used in master mode of operation This interrupt is generated when number of entries in IBI buffer is greater than or equal to threshold value specified by IBISTTH field in I3C_QUETHCTL register. This interrupt is cleared automatically when number of entries in IBI buffer is less than threshold value specified.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMDRDY</name>
              <description>Command Queue Ready Status\nThis interrupt is generated when number of empty locations in command queue is greater than or equal to threshold value specified by CMDEY_ TD field in QUETHCTL register. This interrupt is cleared automatically when number of empty locations in command buffer is less than threshold value specified.\nNote: This bit is read only.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RESPRDY</name>
              <description>Response Queue Ready Status\nThis interrupt is generated when number of entries in response queue is greater than or equal to threshold value\nspecified by RESPB_TD field in QUETHCTL register. This interrupt is cleared automatically when number of entries in response buffer is less than threshold value specified.\nNote: This bit is read only.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TFABORT</name>
              <description>Transfer Abort Status \nThis field is used only in master mode of operation. This interrupt is generated if transfer is aborted. This interrupt can be cleared by writing 1'b1.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CCCUPD</name>
              <description>CCC Table Updated Status\nThis field is used only in slave mode of operation. This interrupt is generated if any of the CCC registers are updated by I3C Master through CCC commands. This interrupt can be cleared by writing 1'b1.\nNote: This bit is cleared by writing 1 to it.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DAA</name>
              <description>Dynamic Address Assigned Status\nThis field is used only in slave mode of operation. This interrupt is generated if the device's Dynamic Address is assigned through SETDASA or ENTDAA CCC. This bit can be cleared by writing 1'b1.\nNote: This bit is cleared by writing 1 to it.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TFRERR</name>
              <description>Transfer Error Status\nThis interrupt is generated if any error occurs during transfer. The error type is specified in the response packet associated with the command (in ERR_STATUS field of RESPONSE_QUEUE_PORT register). This bit can be cleared by writing 1'b1.\nNote: This bit is cleared by writing 1 to it.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DEFSLV</name>
              <description>Define Slave CCC Received Status\nThis interrupt is generated if DEFSLV CCC is received.This bit can be cleared by writing 1'b1.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READREQ</name>
              <description>Read Request Received\nThis field is used only in slave mode of operation. Read Request received from the current master when CMDQ is empty. This bit can be cleared by writing 1'b1.\nNote: This bit is cleared by writing 1 to it.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IBIUPD</name>
              <description>IBI Status Updated\nThis field is used only in slave mode of operation. It indicates that the IBI request initiated through SIR request register is addressed and status is updated.\nNote: This bit is cleared by writing 1 to it.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BUSOWNER</name>
              <description>Bus owner Updated Status\nThis interrupt is set when the role of the controller changes from being a Master to Slave or vice versa.\nThis bit can be cleared by writing 1'b1.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BUSRSTDN</name>
              <description>Bus Reset Pattern Generation Done Status\nThis field is used only in Master mode of operation. This interrupt is generated when the SCL Low Timeout Bus Reset Pattern Generation is completed. This bit can be cleared by writing 1'b1.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
