wosayttn/sdk-bsp-numaker-m55m1/Debug/svd/M55M1.svd
       <register>
          <name>I3C_INTSTSEN</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>I3C_INTSTSEN</displayName>
          <description>I3C Interrupt Status Enable Register</description>
          <addressOffset>0x40</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXTH</name>
              <description>Transmit Buffer Threshold Status Enable Bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXTH</name>
              <description>Receive Buffer Threshold Status Enable Bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IBITH</name>
              <description>IBI Buffer Threshold Status Enable Bit</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMDRDY</name>
              <description>Command Queue Ready Status Enable Bit</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RESPRDY</name>
              <description>Response Queue Ready Status Enable Bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TFRABORT</name>
              <description>Transfer Abort Status Enable Bit\nThis field is used only in master mode of operation.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CCCUPD</name>
              <description>CCC Table Updated Status Enable Bit\nThis field is used in slave mode of operation.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DAA</name>
              <description>Dynamic Address Assigned Status Enable Bit\nThis field is used in slave mode of operation.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TFRERR</name>
              <description>Transfer Error Status Enable Bit</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DEFSLV</name>
              <description>Define Slave CCC Received Status Enable Bit</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READREQ</name>
              <description>Read Request Received Status Enable Bit\nThis field is used in slave mode of operation.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IBIUPD</name>
              <description>IBI Updated Status Enable Bit\nThis field is used in slave mode of operation.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BUSOWNER</name>
              <description>Bus owner Updated Status Enable Bit</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BUSRSTDN</name>
              <description>Bus Reset Pattern Generation Done Status Enable Bit\nThis field is used only in Master mode of operation.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>I3C_INTEN</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>I3C_INTEN</displayName>
          <description>I3C Interrupt Signal Enable Register</description>
          <addressOffset>0x44</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXTH</name>
              <description>Transmit Buffer Threshold Signal Enable Bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXTH</name>
              <description>Receive Buffer Threshold Signal Enable Bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IBITH</name>
              <description>IBI Buffer Threshold Signal Enable Bit</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMDRDY</name>
              <description>Command Queue Ready Signal Enable Bit</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RESPRDY</name>
              <description>Response Queue Ready Signal Enable Bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TFRABORT</name>
              <description>Transfer Abort Status Signal Enable Bit\nThis field is used only in master mode of operation.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CCCUPD</name>
              <description>CCC Table Updated Signal Enable Bit\nThis field is used in slave mode of operation.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DAA</name>
              <description>Dynamic Address Assigned Signal Enable Bit\nThis field is used in slave mode of operation.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TFRERR</name>
              <description>Transfer Error Signal Enable Bit</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DEFSLV</name>
              <description>Define Slave CCC Received Status Enable Bit</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READREQ</name>
              <description>Read Request Received Signal Enable Bit\nThis field is used in slave mode of operation.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IBIUPD</name>
              <description>IBI Updated Signal Enable Bit\nThis field is used in slave mode of operation.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BUSOWNER</name>
              <description>Bus owner Updated Status Enable Bit</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BUSRSTDN</name>
              <description>Bus Reset Pattern Generation Done Signal Enable Bit\nThis field is used only in Master mode of operation.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>I3C_QUESTSLV</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>I3C_QUESTSLV</displayName>
          <description>I3C Queue Status Level Register</description>
          <addressOffset>0x4C</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000008</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CMDELOC</name>
              <description>Command Queue Empty Locations\nContains the number of empty locations in the command Buffer.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RESPLV</name>
              <description>Response Buffer Level Value\nContains the number of valid data entries in the response Buffer.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IBIBLR</name>
              <description>IBI Buffer Level Value \nContains the number of valid IBI Data entries in the IBI Data Buffer. \nThis field is used in master mode of operation</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IBISCNT</name>
              <description>IBI Buffer Status Count\nContains the number of valid IBI Status entries in the IBI Status Buffer. \nThis field is used in master mode of operation.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>I3C_DBSTSLV</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>I3C_DBSTSLV</displayName>
          <description>I3C Data Buffer Status Level Register</description>
          <addressOffset>0x50</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000020</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXELV</name>
              <description>Transmit Buffer Empty Level Value\nContains the number of empty locations in the transmit Buffer.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RXLV</name>
              <description>Receive Buffer Level Value\nContains the number of valid data entries in the receive Buffer.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>I3C_PRESENTS</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>I3C_PRESENTS</displayName>
          <description>I3C Present State Register</description>
          <addressOffset>0x54</addressOffset>
          <access>read-only</access>
          <resetValue>0x10000007</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SCLLEL</name>
              <description>This bit is used to check the SCL line level to recover from errors and for debugging \nThis bit reflects the value of synchronized scl input signal. \nThis is valid in Master mode only.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SDALEL</name>
              <description>This bit is used to check the SDA line level to recover from errors and for debugging \nThis bit reflects the value of synchronized sda input signal. \nThis is valid in Master mode only.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TFRTYPE</name>
              <description>Transfer Type Status \nIn Master mode of operation: </description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>IDLE (Controller is in Idle state)</description>
                    <value>0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Hot-Join transfer state</description>
                    <value>1</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>IBI transfer state</description>
                    <value>2</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Master write transfer ongoing</description>
                    <value>3</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>4</name>
                    <description>Read data prefetch state</description>
                    <value>4</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>5</name>
                    <description>Master read transfer ongoing</description>
                    <value>5</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>6</name>
                    <description>Slave controller in Halt State waiting for resume from application</description>
                    <value>6</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>CMTFRSTS</name>
              <description>Current Master Transfer State Status Indicates the state of current transfer currently executing by the I3C controller This is valid in Master mode only </description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TID</name>
              <description>Transmit Transaction ID \nThis field reflects the Transaction ID of the current executing command.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MAIDLE</name>
              <description>This field reflects whether the Master Controller is in Idle state or not \nThis bit is set when all the Queues(Command , Response, IBI) and Buffers(Transmit and Receive) are empty along with the Master State machine is in Idle state. \n0x0 (MST_NOT_IDLE): Master Controller is not in IDLE State \n0x1 (MST_IDLE): Master Controller is in IDLE State.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>I3C_CCCDEVS</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>I3C_CCCDEVS</displayName>
          <description>I3C Device Operating Status Register</description>
          <addressOffset>0x58</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PENDINT</name>
              <description>Pending Interrupt \nThis field reflects the value driven on pending_int input port.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PROTERR</name>
              <description>Protocol Error \nThis bit is set when the slave controller encouters a Parity/CRC error during write data transfer.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ACTMODE</name>
              <description>Activity Mode \nThis field reflects the input port signal act_mode.MIPI: Contains the two-bit ID of the Slave Device's current Activity Mode \n(readiness to support data read of sensor or related information).</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>UDFERR</name>
              <description>Underflow Error \nUnder Flow Error during private master read transfer. This bit is set if slave controller terminates a read transfer because of unavailability of data in the transmit buffer. This is cleared only after master reads the Device Status through GETSTATUS CCC.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SLVBUSY</name>
              <description>Slave Busy \nThis bit is set if any change is made by the current master in to MRL register or occurance of any error. It is cleared after slave application resumes the slave operation by writing 1'b1 in RESUME field of Device Control Register.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OVFERR</name>
              <description>Overflow Error \nOverflow error condition detected during master write transfer. This is cleared only after master reads the Device Status through GETSTATUS CCC.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DATNRDY</name>
              <description>Data Not Ready \nThis bit is set when private read request from Master is NACKED because of any of the following conditions \n1. Command FIFO Empty. \n2. Transmit FIFO threshold is not met. \n3. Response FIFO Full. This is cleared when the Master issues GET_STATUS CCC or upon successful completion of the subsequent read transfer.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BFNAVAIL</name>
              <description>Buffer Not Available\nThis bit is set when private write request from Master is NACKED because of RX buffer not having RX_BUF_THLD number of empty locations or Response buffer is full. In SDR mode of operation this is cleared when the Master issues GET_STATUS CCC or upon space becoming available in the buffer and the successful completion of the next write transfer. In HDR mode of operation it is cleared only when Master issues GET_STATUS CCC</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FRAMERR</name>
              <description>Frame Error \nThis bit is set when private write request from Master has frame error in HDR-DDR/HDR-TSP/TSL mode. This is cleared only after Master reads the device status through GETSTATUS_CCC.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>I3C_ADDRTP</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>I3C_ADDRTP</displayName>
          <description>I3C Pointer for Device Address Table Register</description>
          <addressOffset>0x5C</addressOffset>
          <access>read-only</access>
          <resetValue>0x00070280</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STARTADR</name>
              <description>Start Address of Device Address Table.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TABLEDEH</name>
              <description>Depth of Device Address Table</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
