wosayttn/sdk-bsp-numaker-m55m1/Debug/svd/M55M1.svd
       <register>
          <name>I3C_CHRTP</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>I3C_CHRTP</displayName>
          <description>I3C Pointer for Device Characteristics Table Register</description>
          <addressOffset>0x60</addressOffset>
          <access>read-only</access>
          <resetValue>0x0001C200</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CHSTART</name>
              <description>Start Address of Device Characteristics Table.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CHARDEH</name>
              <description>Depth of Device Characteristics Table</description>
              <bitOffset>12</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CHARINDX</name>
              <description>Current index of Device Characteristics Table This field returns the current location of Device Characteristics Table index Initially, this index points to 0 Once the complete characteristics information of a Slave device is written into Device Characteristics Table during ENTDAA, this index increments by 1 The first winning device information is stored in Device Characteristics Table index 0, the</description>
              <bitOffset>19</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>I3C_VENDOR</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>I3C_VENDOR</displayName>
          <description>I3C Start Address of Vendor specific Register</description>
          <addressOffset>0x6C</addressOffset>
          <access>read-only</access>
          <resetValue>0x000000B0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VENODADR</name>
              <description>Pointer for Vendor specific Registers</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>I3C_SLVMID</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>I3C_SLVMID</displayName>
          <description>I3C MIPI Manufacturer ID Register</description>
          <addressOffset>0x70</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PIDTYPE</name>
              <description>Specifies the Provisional ID Type Selector (PID[32]) (1'b1: Random Value, 1'b0: Vendor Fixed Value)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MID</name>
              <description>Specifies the MIPI Manufacturer ID (PID[47:33]).</description>
              <bitOffset>1</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>I3C_SLVPID</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>I3C_SLVPID</displayName>
          <description>I3C Normal Provisional ID Register</description>
          <addressOffset>0x74</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DCR</name>
              <description>Specifies the additional 12-bit ID of DWC_mipi_i3c device (PID[11:0]).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INSTID</name>
              <description>This field is used to program the instance ID of the Slave The reset value of this register is taken from input port 'inst_id'.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PARTID</name>
              <description>Specifies the Part ID of DWC_mipi_i3c device (PID[31:16])</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>I3C_SLVCHAR</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>I3C_SLVCHAR</displayName>
          <description>I3C Slave Characteristic Register</description>
          <addressOffset>0x78</addressOffset>
          <access>read-write</access>
          <resetValue>0x00010066</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MXDSLIM</name>
              <description>Max Data Speed Limitation field in Bus Characteristic Register \n(BCR[0])</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No limitation</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Limitation</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>IBICAP</name>
              <description>IBI Request Capable field in Bus Characteristic Register\n(BCR[1])\nNote: This bit is read only.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Support IBI</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>IBIPL</name>
              <description>IBI Payload field in Bus Characteristic Register\n(BCR[2])\nNote: This bit is read only.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Support IBI payload</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>OLCAP</name>
              <description>Offline Capable field in Bus Characteristic Register \n(BCR[3])\nNote: This bit is read only.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Slave will always respond to I3C bus commands</description>
                    <value>#0</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>BRIDGEID</name>
              <description>Bridge Identifier field in Bus Characteristic Register\n(BCR[4])\nNote: This bit is read only.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Not a bridge device</description>
                    <value>#0</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>HDRCAP</name>
              <description>SDR Only or SDR and HDR Capable field in Bus Characteristic Register \n(BCR[5])</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>SDR only. It doesn't disable the HW HDR feature, it just doesn't advertise the Slave HDR capability to Master</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>HDR capable</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>DEVROLE</name>
              <description>Device Role field in Bus Characteristic Register \n(BCR[7:6])\nNote: This bit is read only.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCR</name>
              <description>I3C Device Characteristic Value</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HDRCPVAL</name>
              <description>I3C Device HDR Capability Register Value\nNote: This bit is read only.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>1</name>
                    <description>HDR-DDR</description>
                    <value>1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>I3C_SLVMXLEN</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>I3C_SLVMXLEN</displayName>
          <description>I3C Maximum Write/Read Length Register</description>
          <addressOffset>0x7C</addressOffset>
          <access>read-only</access>
          <resetValue>0x00FF00FF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MWL</name>
              <description>I3C Device Max Write Length\n(Can be updated if SETMWL CCC is received)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MRL</name>
              <description>I3C Device Max Read Length\n(Can be updated if SETMRL CCC is received)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>I3C_MXRDTURN</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>I3C_MXRDTURN</displayName>
          <description>I3C Maximum Read Turnaround Time Register</description>
          <addressOffset>0x80</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MXRDTURN</name>
              <description>Specifies the maximum read turnaround time \n(in microseconds)\n(The 3rd byte which returned in the GETMXDS CCC)\nNote: This field is read only.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>I3C_MXDS</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>I3C_MXDS</displayName>
          <description>I3C Maximum Data Speed Register</description>
          <addressOffset>0x84</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MXWR</name>
              <description>Specifies the Maximum Sustained Data Rate for non-CCC messages sent by Master Device to Slave device   \n(The 1st byte which returned in the GETMXDS CCC)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>12.5 MHz</description>
                    <value>0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>8 MHz</description>
                    <value>1</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>6 MHz</description>
                    <value>2</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>4 MHz</description>
                    <value>3</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>4</name>
                    <description>2 MHz</description>
                    <value>4</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>MXRD</name>
              <description>Specifies the Maximum Sustained Data Rate for non-CCC messages sent by Slave Device to Master Device  \n(The 2nd byte which returned in the GETMXDS CCC)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>12.5 MHz</description>
                    <value>0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>8 MHz</description>
                    <value>1</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>6 MHz</description>
                    <value>2</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>4 MHz</description>
                    <value>3</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>4</name>
                    <description>2 MHz</description>
                    <value>4</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>MXDTURN</name>
              <description>Specifies the clock to data turnaround time \n(Tsco parameter)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>8 ns</description>
                    <value>0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>9 ns</description>
                    <value>1</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>10 ns</description>
                    <value>2</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>11 ns</description>
                    <value>3</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>4</name>
                    <description>12 ns</description>
                    <value>4</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>I3C_SIR</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>I3C_SIR</displayName>
          <description>I3C Slave Interrupt Request Register</description>
          <addressOffset>0x8C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EN</name>
              <description>Slave Interrupt Request\nWhen set, the slave controller attempts to issue the SIR on the I3C bus. Once issued and when the current master accepts (ACK) or if the controller is unable to issue the SIR, then the controller clears this bit automatically and updates the IBI_STS field. If the NACK response is received for the SIR, the controller reattempts the SIR upon detecting the next START condition from the master or after the Bus Available Time. Once set, the application cannot clear this bit.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CTL</name>
              <description>Slave Interrupt Request Control</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Indicates source of SIR data to be from the registers</description>
                    <value>#00</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>MR</name>
              <description>Master Request\nWhen set, the controller attempts to issue the MR on the I3C bus. Once issued and when the current master accepts(ACK) or if the controller is unable to issue the MR, then the controller clears this bit automatically and updates the IBI_STS field. If NACK response is received for the MR, the controller reattempts the MR upon detecting the next START condition from the master or after the Bus Available time. This bit is available only in the secondary master configuration. For other configurations, this bit is reserved and returns 0 when read. Once set, the application cannot clear this bit.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MDB</name>
              <description>Mandatory Data Byte \nThis field gives the mandatory data byte which is required to be transmitted after the Master ACK the slave address during SIR transfer. This field is only applicable when BCR[2] is set indicating that SIR supports payload data.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATLEN</name>
              <description>Slave Interrupt Request Data Length \nThis field should be programmed by the slave application to give the data length for the payload data other than the MDB byte. This field is only applicable when BCR[2] is set indicating that SIR supports payload data.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>I3C_SIRDAT</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>I3C_SIRDAT</displayName>
          <description>I3C Slave Interrupt Request Data Register</description>
          <addressOffset>0x94</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAT0</name>
              <description>SIR Data Byte 0 \nThis register SIRDATA containing four bytes of SIR Data will be in effect only when SIR_CTRL field in INTRREQ is programmed to 00 provided the data length is up to 1. \nThis field holds the first byte of SIR DATA that will be passed after the MDB when SIR is initiated by the application on writing into SIR bit in INTRREQ Register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DAT1</name>
              <description>SIR Data Byte 1 \nThis register SIRDATA containing four bytes of SIR Data will be in effect only when SIR_CTRL field in INTRREQ is programmed to 00 provided the data length is up to 2. \nThis field holds the second byte of SIR DATA that will be passed after the MDB when SIR is initiated by the application on writing into SIR bit in INTRREQ Register.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DAT2</name>
              <description>SIR Data Byte 2 \nThis register SIRDATA containing four bytes of SIR Data will be in effect only when SIR_CTRL field in INTRREQ is programmed to 00 provided the data length is up to 3. \nThis field holds the third byte of SIR DATA that will be passed after the MDB when SIR is initiated by the application on writing into SIR bit in INTRREQ Register.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DAT3</name>
              <description>SIR Data Byte 3 \nThis register SIRDATA containing four bytes of SIR Data will be in effect only when SIR_CTRL field in INTRREQ is programmed to 00 provided the data length is up to 4. \nThis field holds the fourth byte of SIR DATA that will be passed after the MDB when SIR is initiated by the application on writing into SIR bit in INTRREQ Register.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
