wosayttn/sdk-bsp-numaker-m55m1/Debug/svd/M55M1.svd
       <register>
          <name>I3C_SIRRESP</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>I3C_SIRRESP</displayName>
          <description>I3C Slave Interrupt Request Response Register</description>
          <addressOffset>0x98</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IBISTS</name>
              <description>IBI Completion Status \nThis field is common for SIR and MR \nThe controller does not attempt to issue the IBI and generates the IBI Completion Status as 3'b011 if one of the following condition is true. \n1. Master has not assigned the Dynamic Address. \n2. Master has cleared the assigned Dynamic Address (through RSTDAA CCC). \n3. Master has disabled the IBI event (through DISEC CCC). \n4. The controller has switched the role to Master (applicable only for secondary master configuration). \n5. DL doesn't match with SIR_CTRL.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Reserved.</description>
                    <value>#000</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>IBI accepted by the Master (ACK response received)</description>
                    <value>#001</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>Master Early Terminate (only for SIR with Data)</description>
                    <value>#010</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>IBI Not Attempted</description>
                    <value>#011</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>DATLEN</name>
              <description>Data Length for SIR Response \nThe value in this filed will indicate the number of bytes remaining that was not transmitted because of Master early terminating the SIR transfer. \nIn case the IBI is not attempted the number for bytes returned will be same as that programmed for IBI payload</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>I3C_DEVCTLE</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>I3C_DEVCTLE</displayName>
          <description>I3C Device Control Extended Register</description>
          <addressOffset>0xB0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OPERMODE</name>
              <description>This bit is used to select the Device Operation Mode before the controller is enabled \n 0: Master \n 1: Slave \n 2: Reserved \n 3: Reserved\nNote:This field is written only when the i3c is disabled</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MRACKCTL</name>
              <description>In Slave mode of operation, this bit serves as a control to ACK/NACK GETACCMST CCC from current master\n 0: ACK GETACCMST CCC\n 1: NACK GETACCMST CCC</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>I3C_SCLOD</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>I3C_SCLOD</displayName>
          <description>I3C SCL Open Drain Timing Register</description>
          <addressOffset>0xB4</addressOffset>
          <access>read-write</access>
          <resetValue>0x003F007F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ODLCNT</name>
              <description>I3C Open Drain Low Count \nSCL Open-drain low count for I3C transfers targeted to I3C devices.\nNote: ODLCNT minimum value is five</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ODHCNT</name>
              <description>I3C Open Drain High Count \nSCL open-drain High count for I3C transfers targeted to I3C devices.\nNote: ODHCNT minimum value is five</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>I3C_SCLPP</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>I3C_SCLPP</displayName>
          <description>I3C SCL Push Pull Timing Register</description>
          <addressOffset>0xB8</addressOffset>
          <access>read-write</access>
          <resetValue>0x000A000A</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PPLCNT</name>
              <description>I3C Push Pull Low Count \nSCL Push-Pull low count for I3C transfers targeted to I3C devices.\nNote: PPLCNT minimum value is five</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PPHCNT</name>
              <description>I3C Push Pull High Count \nSCL Push-Pull High count for I3C transfers targeted to I3C devices.\nNote: PPHCNT minimum value is five</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>I3C_SCLFM</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>I3C_SCLFM</displayName>
          <description>I3C SCL I2C Fast Mode Timing Register</description>
          <addressOffset>0xBC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00FF00FF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FMLCNT</name>
              <description>I2C Fast Mode Low Count \nThe SCL open-drain low count timing for I2C fast mode transfers.\nNote: FMLCNT minimum value is five</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FMHCNT</name>
              <description>I2C Fast Mode High Count \nThe SCL open-drain high count timing for I2C fast mode transfers.\nNote: FMHCNT minimum value is five</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>I3C_SCLFMP</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>I3C_SCLFMP</displayName>
          <description>I3C SCL I2C Fast Mode Plus Timing Register</description>
          <addressOffset>0xC0</addressOffset>
          <access>read-write</access>
          <resetValue>0x007F007F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FMPLCNT</name>
              <description>I2C Fast Mode Low Count \nThe SCL open-drain low count timing for I2C fast mode transfers.\nNote: FMPLCNT minimum value is five</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FMPHCNT</name>
              <description>I2C Fast Mode High Count \nThe SCL open-drain high count timing for I2C fast mode transfers.\nNote: FMPHCNT minimum value is five</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>I3C_SCLEXTL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>I3C_SCLEXTL</displayName>
          <description>I3C SCL Extended Low Count Timing Register</description>
          <addressOffset>0xC8</addressOffset>
          <access>read-write</access>
          <resetValue>0x20202020</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EXLCNT1</name>
              <description>I3C Extended Low Count Register 1\nSDR1 uses this register field for data transfer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXLCNT2</name>
              <description>I3C Extended Low Count Register 2\nSDR2 uses this register field for data transfer</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXLCNT3</name>
              <description>I3C Extended Low Count Register 3\nSDR3 uses this register field for data transfer</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXLCNT4</name>
              <description>I3C Extended Low Count Register 4\nSDR4 uses this register field for data transfer</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>I3C_SCLTERM</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>I3C_SCLTERM</displayName>
          <description>I3C SCL Termination Bit Low count Timing Register</description>
          <addressOffset>0xCC</addressOffset>
          <access>read-write</access>
          <resetValue>0x10000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EXTERM</name>
              <description>I3C Read Termination Bit Low count\nExtended I3C Read Termination Bit low count for I3C Readtransfers. Effective Termination-Bit Low Period is derived based on the SDR speed as shown below SDR0 speed: PPLCNT + EXTERM\nSDR1 speed: EXLCNT1 + EXTERM\nSDR2 speed: EXLCNT2 + EXTERM\nSDR3 speed: EXLCNT3 + EXTERM\nSDR4 speed: EXLCNT4 + EXTERM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STOPHLD</name>
              <description>STOP HOLD Count\nStop Hold Count in terms of ECLK which is used for generation of Stop Hold generation in Controller Mode.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>I3C_SDAHOLD</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>I3C_SDAHOLD</displayName>
          <description>I3C SDA Hold and Mode Switch Delay Timing Register</description>
          <addressOffset>0xD0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00010101</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SDAOPDLY</name>
              <description>OP Mode SDA Delay</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SDAPDDLY</name>
              <description>PD Mode SDA Delay </description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXHOLD</name>
              <description>TX Hold time\nThis field controls the hold time (in term of the core clock period) of the transmit data (SDA) with respect to the SCL edge in FM FM+ SDR and DDR speed mode of operations\n The valid values are 1 to 7. Others are Reserved.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>I3C_BUSFAT</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>I3C_BUSFAT</displayName>
          <description>I3C Bus Free and Available Timing Register</description>
          <addressOffset>0xD4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00500050</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FREETC</name>
              <description>Bus Free Time Count Value\nThis register field is used only in Master mode of operation I3C Bus Free Count Value. In Pure Bus System, this field represents tCAS parameter. In Mixed Bus system, this field is expected to be programmed to tLOW of I2C Timing</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AVAILTC</name>
              <description>Bus Avaliable Time Count Value\nThis register field is used only in Slave mode of operation Bus Available Count Value . This field is used by the Slave to initiate an IBI after STOP condition.\n(for IBI)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>I3C_BUSIDLET</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>I3C_BUSIDLET</displayName>
          <description>I3C Bus Idle Timing Register</description>
          <addressOffset>0xD8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000050</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IDLETC</name>
              <description>Bus Idle Time Count Value\nThis field is used by the controller in Slave mode to initiate Hot-Join request if the dynamic address is not valid.\n(for Hot-Join)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>I3C_SCLLOW</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>I3C_SCLLOW</displayName>
          <description>I3C SCL Low Timeout register</description>
          <addressOffset>0xDC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00500000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LOWTIMER</name>
              <description>This count defines the number of core clock periods to count for generation of the SCL Low Bus Reset Pattern.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>26</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>I3C_DEV1CH1</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>I3C_DEV1CH1</displayName>
          <description>Device Characteristic Table Location-1 of Device1 register</description>
          <addressOffset>0x200</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>PIDMSB</name>
              <description>The LSB 32-bit value of Provisional-ID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>I3C_DEV1CH2</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>I3C_DEV1CH2</displayName>
          <description>Device Characteristic Table Location-2 of Device1 register</description>
          <addressOffset>0x204</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>PIDLSB</name>
              <description>The MSB 16-bit value of Provisional-ID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>I3C_DEV1CH3</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>I3C_DEV1CH3</displayName>
          <description>Device Characteristic Table Location-3 of Device1 register</description>
          <addressOffset>0x208</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>DCR</name>
              <description>Device Characteristic Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BCR</name>
              <description>Bus Characteristic Value</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>I3C_DEV1CH4</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>I3C_DEV1CH4</displayName>
          <description>Device Characteristic Table Location-4 of Device1 register</description>
          <addressOffset>0x20C</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>DADR</name>
              <description>Device Dynamic Address assigned.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="I3C_DEV1CH1">
          <name>I3C_DEV2CH1</name>
          <displayName>I3C_DEV2CH1</displayName>
          <description>Device Characteristic Table Location-1 of Device2 register</description>
          <addressOffset>0x210</addressOffset>
       </register>
       <register derivedFrom="I3C_DEV1CH2">
          <name>I3C_DEV2CH2</name>
          <displayName>I3C_DEV2CH2</displayName>
          <description>Device Characteristic Table Location-2 of Device2 register</description>
          <addressOffset>0x214</addressOffset>
       </register>
       <register derivedFrom="I3C_DEV1CH3">
          <name>I3C_DEV2CH3</name>
          <displayName>I3C_DEV2CH3</displayName>
          <description>Device Characteristic Table Location-3 of Device2 register</description>
          <addressOffset>0x218</addressOffset>
       </register>
