wosayttn/sdk-bsp-numaker-m55m1/Debug/svd/M55M1.svd
       <register derivedFrom="I3C_DEV1CH4">
          <name>I3C_DEV2CH4</name>
          <displayName>I3C_DEV2CH4</displayName>
          <description>Device Characteristic Table Location-4 of Device2 register</description>
          <addressOffset>0x21C</addressOffset>
       </register>
       <register derivedFrom="I3C_DEV1CH1">
          <name>I3C_DEV3CH1</name>
          <displayName>I3C_DEV3CH1</displayName>
          <description>Device Characteristic Table Location-1 of Device3 register</description>
          <addressOffset>0x220</addressOffset>
       </register>
       <register derivedFrom="I3C_DEV1CH2">
          <name>I3C_DEV3CH2</name>
          <displayName>I3C_DEV3CH2</displayName>
          <description>Device Characteristic Table Location-2 of Device3 register</description>
          <addressOffset>0x224</addressOffset>
       </register>
       <register derivedFrom="I3C_DEV1CH3">
          <name>I3C_DEV3CH3</name>
          <displayName>I3C_DEV3CH3</displayName>
          <description>Device Characteristic Table Location-3 of Device3 register</description>
          <addressOffset>0x228</addressOffset>
       </register>
       <register derivedFrom="I3C_DEV1CH4">
          <name>I3C_DEV3CH4</name>
          <displayName>I3C_DEV3CH4</displayName>
          <description>Device Characteristic Table Location-4 of Device3 register</description>
          <addressOffset>0x22C</addressOffset>
       </register>
       <register derivedFrom="I3C_DEV1CH1">
          <name>I3C_DEV4CH1</name>
          <displayName>I3C_DEV4CH1</displayName>
          <description>Device Characteristic Table Location-1 of Device4 register</description>
          <addressOffset>0x230</addressOffset>
       </register>
       <register derivedFrom="I3C_DEV1CH2">
          <name>I3C_DEV4CH2</name>
          <displayName>I3C_DEV4CH2</displayName>
          <description>Device Characteristic Table Location-2 of Device4 register</description>
          <addressOffset>0x234</addressOffset>
       </register>
       <register derivedFrom="I3C_DEV1CH3">
          <name>I3C_DEV4CH3</name>
          <displayName>I3C_DEV4CH3</displayName>
          <description>Device Characteristic Table Location-3 of Device4 register</description>
          <addressOffset>0x238</addressOffset>
       </register>
       <register derivedFrom="I3C_DEV1CH4">
          <name>I3C_DEV4CH4</name>
          <displayName>I3C_DEV4CH4</displayName>
          <description>Device Characteristic Table Location-4 of Device4 register</description>
          <addressOffset>0x23C</addressOffset>
       </register>
       <register derivedFrom="I3C_DEV1CH1">
          <name>I3C_DEV5CH1</name>
          <displayName>I3C_DEV5CH1</displayName>
          <description>Device Characteristic Table Location-1 of Device5 register</description>
          <addressOffset>0x240</addressOffset>
       </register>
       <register derivedFrom="I3C_DEV1CH2">
          <name>I3C_DEV5CH2</name>
          <displayName>I3C_DEV5CH2</displayName>
          <description>Device Characteristic Table Location-2 of Device5 register</description>
          <addressOffset>0x244</addressOffset>
       </register>
       <register derivedFrom="I3C_DEV1CH3">
          <name>I3C_DEV5CH3</name>
          <displayName>I3C_DEV5CH3</displayName>
          <description>Device Characteristic Table Location-3 of Device5 register</description>
          <addressOffset>0x248</addressOffset>
       </register>
       <register derivedFrom="I3C_DEV1CH4">
          <name>I3C_DEV5CH4</name>
          <displayName>I3C_DEV5CH4</displayName>
          <description>Device Characteristic Table Location-4 of Device5 register</description>
          <addressOffset>0x24C</addressOffset>
       </register>
       <register derivedFrom="I3C_DEV1CH1">
          <name>I3C_DEV6CH1</name>
          <displayName>I3C_DEV6CH1</displayName>
          <description>Device Characteristic Table Location-1 of Device6 register</description>
          <addressOffset>0x250</addressOffset>
       </register>
       <register derivedFrom="I3C_DEV1CH2">
          <name>I3C_DEV6CH2</name>
          <displayName>I3C_DEV6CH2</displayName>
          <description>Device Characteristic Table Location-2 of Device6 register</description>
          <addressOffset>0x254</addressOffset>
       </register>
       <register derivedFrom="I3C_DEV1CH3">
          <name>I3C_DEV6CH3</name>
          <displayName>I3C_DEV6CH3</displayName>
          <description>Device Characteristic Table Location-3 of Device6 register</description>
          <addressOffset>0x258</addressOffset>
       </register>
       <register derivedFrom="I3C_DEV1CH4">
          <name>I3C_DEV6CH4</name>
          <displayName>I3C_DEV6CH4</displayName>
          <description>Device Characteristic Table Location-4 of Device6 register</description>
          <addressOffset>0x25C</addressOffset>
       </register>
       <register derivedFrom="I3C_DEV1CH1">
          <name>I3C_DEV7CH1</name>
          <displayName>I3C_DEV7CH1</displayName>
          <description>Device Characteristic Table Location-1 of Device7 register</description>
          <addressOffset>0x260</addressOffset>
       </register>
       <register derivedFrom="I3C_DEV1CH2">
          <name>I3C_DEV7CH2</name>
          <displayName>I3C_DEV7CH2</displayName>
          <description>Device Characteristic Table Location-2 of Device7 register</description>
          <addressOffset>0x264</addressOffset>
       </register>
       <register derivedFrom="I3C_DEV1CH3">
          <name>I3C_DEV7CH3</name>
          <displayName>I3C_DEV7CH3</displayName>
          <description>Device Characteristic Table Location-3 of Device7 register</description>
          <addressOffset>0x268</addressOffset>
       </register>
       <register derivedFrom="I3C_DEV1CH4">
          <name>I3C_DEV7CH4</name>
          <displayName>I3C_DEV7CH4</displayName>
          <description>Device Characteristic Table Location-4 of Device7 register</description>
          <addressOffset>0x26C</addressOffset>
       </register>
       <register>
          <name>I3C_DEV1ADR</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>I3C_DEV1ADR</displayName>
          <description>Device Address Table Location of Device1</description>
          <addressOffset>0x280</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>STADR</name>
              <description>Device Static Address.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IBIPECEN</name>
              <description>Packet Error Check enabled for accepted IBI from the device PEC byte is appended at the end of IBI data from the device This bit controls whether PEC check should be performed for IBI data from device This bit also controls whether PEC byte has to be send for auto disable CCC when controller NACKs the IBI \n0x0 : Packet Error Check disabled for IBI \n0x1 : Packet Error Check enabled for IBI</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IBIWDATA</name>
              <description>Mandatory one or more data bytes follow the accepted IBI from the device Data byte continuation is indicated by T-Bit \n0x0 : IBI Without Mandatory Byte \n0x1 : IBI with one or more Mandatory Bytes</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SIRREJ</name>
              <description>In-Band Slave Interrupt Request Reject field is used to control, per device, whether to accept Slave Interrupt request from Devices \n0x0 : Accept: ACK the SIR \n0x1 :Reject: NACK the SIR and send auto disable CCC.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MRREJECT</name>
              <description>In-Band Master Request Reject field is used to control, per device, whether to accept Master request from Devices\n 0x0: Accept: ACK the Master Request \n 0x1: Reject: NACK the Master Request and send auto disable CCC.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DADR</name>
              <description>Device Dynamic Address with parity \nThis field consists of Dynamic address and Parity Bit. The LSB bits [22:16] should consist of Dynamic Address field indicates the address to be assigned for the winning I3C device when using ENTDAA command.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OPDADR</name>
              <description>Odd parity of the 7-bit Dynamic address\nOdd parity of the 7-bit Dynamic address used for ENTDAA address assignment</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NAKRCNT</name>
              <description>This field is used to set the Device NACK Retry count for the particular device\nIf the Device NACK's for the device address, the controller automatically retries the same device until this count expires. If the Slave does not ACK for the mentioned number of retries, then Controller generates an error response and move to the Halt state. \nThis feature is used for Retry Model for the following features mentioned in the I3C Specification: \nRetry Model for Direct GET CCC Commands. \nThe incoming SIR-IBI matches with the slave address initated by the Master</description>
              <bitOffset>29</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DEVICE</name>
              <description>Type of device \n 0: I3C \n 1: I2C</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="I3C_DEV1ADR">
          <name>I3C_DEV2ADR</name>
          <displayName>I3C_DEV2ADR</displayName>
          <description>Device Address Table Location of Device2</description>
          <addressOffset>0x284</addressOffset>
       </register>
       <register derivedFrom="I3C_DEV1ADR">
          <name>I3C_DEV3ADR</name>
          <displayName>I3C_DEV3ADR</displayName>
          <description>Device Address Table Location of Device3</description>
          <addressOffset>0x288</addressOffset>
       </register>
       <register derivedFrom="I3C_DEV1ADR">
          <name>I3C_DEV4ADR</name>
          <displayName>I3C_DEV4ADR</displayName>
          <description>Device Address Table Location of Device4</description>
          <addressOffset>0x28C</addressOffset>
       </register>
       <register derivedFrom="I3C_DEV1ADR">
          <name>I3C_DEV5ADR</name>
          <displayName>I3C_DEV5ADR</displayName>
          <description>Device Address Table Location of Device5</description>
          <addressOffset>0x290</addressOffset>
       </register>
       <register derivedFrom="I3C_DEV1ADR">
          <name>I3C_DEV6ADR</name>
          <displayName>I3C_DEV6ADR</displayName>
          <description>Device Address Table Location of Device6</description>
          <addressOffset>0x294</addressOffset>
       </register>
       <register derivedFrom="I3C_DEV1ADR">
          <name>I3C_DEV7ADR</name>
          <displayName>I3C_DEV7ADR</displayName>
          <description>Device Address Table Location of Device7</description>
          <addressOffset>0x298</addressOffset>
       </register>
