wosayttn/sdk-bsp-numaker-m55m1/Debug/svd/M55M1.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PSIO</name>
      <description>PSIO Register Map</description>
      <groupName>PSIO</groupName>
      <baseAddress>0x40255000</baseAddress>
      <!-- d -> no access permission -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x5C</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x60</offset>
        <size>0x1C</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x80</offset>
        <size>0x1C</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xA0</offset>
        <size>0x1C</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xC0</offset>
        <size>0x1C</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xE0</offset>
        <size>0x1C</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x100</offset>
        <size>0x1C</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x120</offset>
        <size>0x1C</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
       <register>
          <name>PSIO_INTCTL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PSIO_INTCTL</displayName>
          <description>PSIO Interrupt Control Register</description>
          <addressOffset>0x0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CONI0SS</name>
              <description>Configurable Interrupt 0 Slot Selection </description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No use</description>
                    <value>0000</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>SLOT0</description>
                    <value>0001</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>10</name>
                    <description>SLOT1</description>
                    <value>0010</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>11</name>
                    <description>SLOT2</description>
                    <value>0011</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>100</name>
                    <description>SLOT3</description>
                    <value>0100</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>101</name>
                    <description>SLOT4</description>
                    <value>0101</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>110</name>
                    <description>SLOT5</description>
                    <value>0110</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>111</name>
                    <description>SLOT6</description>
                    <value>0111</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1000</name>
                    <description>SLOT7</description>
                    <value>1000</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>CONI1SS</name>
              <description>Configurable Interrupt 1 Slot Selection </description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No use</description>
                    <value>0000</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>SLOT0</description>
                    <value>0001</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>10</name>
                    <description>SLOT1</description>
                    <value>0010</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>11</name>
                    <description>SLOT2</description>
                    <value>0011</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>100</name>
                    <description>SLOT3</description>
                    <value>0100</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>101</name>
                    <description>SLOT4</description>
                    <value>0101</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>110</name>
                    <description>SLOT5</description>
                    <value>0110</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>111</name>
                    <description>SLOT6</description>
                    <value>0111</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1000</name>
                    <description>SLOT7</description>
                    <value>1000</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>CONI0SCS</name>
              <description>Configurable Interrupt 0 Slot Controller Selection \nSelect Slot controller for interrupt 0.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Slot controller 0</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Slot controller 1</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>Slot controller 2</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Slot controller 3</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>CONI1SCS</name>
              <description>Configurable Interrupt 1 Slot Controller Selection \nSelect Slot controller for interrupt 1.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Slot controller 0</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Slot controller 1</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>Slot controller 2</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Slot controller 3</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>PSIO_INTEN</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PSIO_INTEN</displayName>
          <description>PSIO Interrupt Enable Register</description>
          <addressOffset>0x4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CON0IE</name>
              <description>Configurable Interrupt 0 Enable Bit\nThis field is used to enable selective interrupt 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Selective interrupt 0 Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Selective interrupt 0 Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>CON1IE</name>
              <description>Configurable Interrupt 1 Enable Bit\nThis field is used to enable selective interrupt 1.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Selective interrupt 1 Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Selective interrupt 1 Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>MISMATIE</name>
              <description>Mismatch Interrupt Enable Bit\nThis field is used to enable mismatch interrupt.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Mismatch interrupt Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Mismatch interrupt Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>TERRIE</name>
              <description>Transfer Error Interrupt Enable Bit\nThis field is used to enable transfer error interrupt.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Transfer error interrupt Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Transfer error interrupt Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SC0IE</name>
              <description>Slot Controller 0 Done Interrupt Enable Bit\nThis field is used to enable Slot controller 0 finish interrupt.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Slot controller 0 finish interrupt Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Slot controller 0 finish interrupt Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SC1IE</name>
              <description>Slot Controller 1 Done Interrupt Enable Bit\nThis field is used to enable Slot controller 1 finish interrupt.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Slot controller 1 finish interrupt Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Slot controller 1 finish interrupt Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SC2IE</name>
              <description>Slot Controller 2 Done Interrupt Enable Bit\nThis field is used to enable Slot controller 2 finish interrupt.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Slot controller 2 finish interrupt Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Slot controller 2 finish interrupt Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SC3IE</name>
              <description>Slot Controller 3 Done Interrupt Enable Bit\nThis field is used to enable Slot controller 3 finish interrupt.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Slot controller 3 finish interrupt Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Slot controller 3 finish interrupt Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
