wosayttn/sdk-bsp-numaker-m55m1/Debug/svd/M55M1.svd
       <register>
          <name>PSIO_INTSTS</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PSIO_INTSTS</displayName>
          <description>PSIO Interrupt Status Register</description>
          <addressOffset>0x8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CON0IF</name>
              <description>Configurable Interrupt 0 Flag  \nThe setting interrupt is trigger at the end of the check point of the pin.\nNote: This bit can be cleared by writing 1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Condition in PSIO_INTCTL is not triggered</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Condition in PSIO_INTCTL is triggered</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>CON1IF</name>
              <description>Configurable Interrupt 1 Flag \nThe setting interrupt is trigger at the end of the check point of the pin.\nNote: This bit can be cleared by writing 1.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Condition in PSIO_INTCTL is not triggered</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Condition in PSIO_INTCTL is triggered</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>MISMATIF</name>
              <description>Mismatch Interrupt Flag\nThis flag shows the amounts of data are not the same in each pins with PDMA enabled. If this situation happens, all slot controllers stop counting.\nNote 1: This flag is only effective on the pin with PDMA enabled.\nNote 2: This bit can be cleared by writing 1.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Each pin with PDMA enabled receive or transfer data in the same rate</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Each pin with PDMA enabled receive or transfer data in different rate</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>TERRIF</name>
              <description>Transfer Error Interrupt Status Flag \nThis field is used for transfer error interrupt status flag. The transfer error states is at PSIO_TRANSTS register which includes input data overflow flag INOVERn (PSIO_TRANSTS[29,25,21,17,13,9,5,1] and output data underflow flag OUTUFn (PSIO_TRANSTS[31,27,23,19,15,11,7,3]).\nNote 1: This field is the status flag of INOVER or OUTUFER.\nNote 2: This bit can only be cleared by writing 1 to coordinate transfer error.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Transfer error interrupt did not occur</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Transfer error interrupt occurred</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SC0IF</name>
              <description>Slot Controller 0 Counting Done Interrupt Status Flag\nThis field is used for slot controller 0 finish interrupt status flag. \nNote: This bit can be cleared by writing 1.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Slot controller 0 done interrupt did not occur</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Slot controller 0 done interrupt occurred</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SC1IF</name>
              <description>Slot Controller 1 Counting Done Interrupt Status Flag\nThis field is used for slot controller 1 finish interrupt status flag. \nNote: This bit can be cleared by writing 1.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Slot controller 1 done interrupt did not occur</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Slot controller 1 done interrupt occurred</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SC2IF</name>
              <description>Slot Controller 2 Counting Done Interrupt Status Flag\nThis field is used for slot controller 2 finish interrupt status flag. \nNote: This bit can be cleared by writing 1.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Slot controller 2 done interrupt did not occur</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Slot controller 2 done interrupt occurred</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SC3IF</name>
              <description>Slot Controller 3 Counting Done Interrupt Status Flag\nThis field is used for slot controller 3 finish interrupt status flag. \nNote: This bit can be cleared by writing 1.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Slot controller 3 done interrupt did not occur</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Slot controller 3 done interrupt occurred</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
