wosayttn/sdk-bsp-numaker-m55m1/Debug/svd/M55M1.svd
       <register derivedFrom="PSIO_SC0SLOT">
          <name>PSIO_SC1SLOT</name>
          <displayName>PSIO_SC1SLOT</displayName>
          <description>PSIO Slot Controller n Slot Register</description>
          <addressOffset>0x2C</addressOffset>
       </register>
       <register derivedFrom="PSIO_SC0SLOT">
          <name>PSIO_SC2SLOT</name>
          <displayName>PSIO_SC2SLOT</displayName>
          <description>PSIO Slot Controller n Slot Register</description>
          <addressOffset>0x34</addressOffset>
       </register>
       <register derivedFrom="PSIO_SC0SLOT">
          <name>PSIO_SC3SLOT</name>
          <displayName>PSIO_SC3SLOT</displayName>
          <description>PSIO Slot Controller n Slot Register</description>
          <addressOffset>0x3C</addressOffset>
       </register>
       <register>
          <name>PSIO0_GENCTL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PSIO0_GENCTL</displayName>
          <description>PSIOn General Control Register</description>
          <addressOffset>0x40</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IOMODE</name>
              <description>I/O Mode\nI/O mode state represent the I/O state when slot controller has not started counting or slot controller has started counting but has not cross the switch I/O mode check point.\nNote 1: When slot controller stops counting, it will switch to the current I/O mode setting.\nNote 2: When PSIO uses quasi-bidirectional mode or open-drain mode to trigger slot controller, the initial or interval output state needs to be set output high level, or the pin will not be triggered.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Input mode</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Output mode</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>Open-drain mode</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Quasi-bidirectional mode</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>INITIAL</name>
              <description>Initial Output\nThe output state of PSIO when slot controller stops counting and IDLE (PSIO_SCnCTL[25]) is 1.\nNote 1: Only when IOMODE is not input mode, this register is effective.\nNote 2: This bit is effective only when IDLE(PSIO_SCnCTL[25]) is high.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Low level</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>High level</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>Last output</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Toggle</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>INTERVAL</name>
              <description>Interval Output\nThe output of PSIO when slot controller stops counting and IDLE (PSIO_SCnCTL[25]) is 0.\nNote 1: Only when IOMODE is not input mode, then this register is effective.\nNote 2: This bit is effective only when IDLE(PSIO_SCnCTL[25]) is low.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Low level</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>High level</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>Last output</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Toggle</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SW0CP</name>
              <description>Switch0 Check Point</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No use</description>
                    <value>#0000</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>CHECK POINT 0</description>
                    <value>#0001</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>CHECK POINT 1</description>
                    <value>#0010</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>CHECK POINT 2</description>
                    <value>#0011</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>4</name>
                    <description>CHECK POINT 3</description>
                    <value>#0100</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>5</name>
                    <description>CHECK POINT 4</description>
                    <value>#0101</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>6</name>
                    <description>CHECK POINT 5</description>
                    <value>#0110</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>7</name>
                    <description>CHECK POINT 6</description>
                    <value>#0111</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>8</name>
                    <description>CHECK POINT 7</description>
                    <value>#1000</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SW1CP</name>
              <description>Switch1 Check Point</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No use</description>
                    <value>#0000</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>CHECK POINT 0</description>
                    <value>#0001</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>CHECK POINT 1</description>
                    <value>#0010</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>CHECK POINT 2</description>
                    <value>#0011</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>4</name>
                    <description>CHECK POINT 3</description>
                    <value>#0100</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>5</name>
                    <description>CHECK POINT 4</description>
                    <value>#0101</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>6</name>
                    <description>CHECK POINT 5</description>
                    <value>#0110</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>7</name>
                    <description>CHECK POINT 6</description>
                    <value>#0111</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>8</name>
                    <description>CHECK POINT 7</description>
                    <value>#1000</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>MODESW0</name>
              <description>Mode Switch0 Point\nMode at the switch0 point.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Input mode</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Output mode</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>Open-drain mode</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Quasi-bidirectional mode</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>MODESW1</name>
              <description>Mode Switch1 Point\nMode at the switch1 point.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Input mode</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Output mode</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>Open-drain mode</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Quasi-bidirectional mode</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SCSEL</name>
              <description>Slot Controller Selection\nSelect slot controller for check point.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>SLOT CONTROLLER0</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>SLOT CONTROLLER1</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>SLOT CONTROLLER2</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>SLOT CONTROLLER3</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>PINEN</name>
              <description>Pin Enable Bit</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Pin Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Pin Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="PSIO0_GENCTL">
          <name>PSIO1_GENCTL</name>
          <displayName>PSIO1_GENCTL</displayName>
          <description>PSIOn General Control Register</description>
          <addressOffset>0x60</addressOffset>
       </register>
       <register derivedFrom="PSIO0_GENCTL">
          <name>PSIO2_GENCTL</name>
          <displayName>PSIO2_GENCTL</displayName>
          <description>PSIOn General Control Register</description>
          <addressOffset>0x80</addressOffset>
       </register>
       <register derivedFrom="PSIO0_GENCTL">
          <name>PSIO3_GENCTL</name>
          <displayName>PSIO3_GENCTL</displayName>
          <description>PSIOn General Control Register</description>
          <addressOffset>0xA0</addressOffset>
       </register>
       <register derivedFrom="PSIO0_GENCTL">
          <name>PSIO4_GENCTL</name>
          <displayName>PSIO4_GENCTL</displayName>
          <description>PSIOn General Control Register</description>
          <addressOffset>0xC0</addressOffset>
       </register>
       <register derivedFrom="PSIO0_GENCTL">
          <name>PSIO5_GENCTL</name>
          <displayName>PSIO5_GENCTL</displayName>
          <description>PSIOn General Control Register</description>
          <addressOffset>0xE0</addressOffset>
       </register>
       <register derivedFrom="PSIO0_GENCTL">
          <name>PSIO6_GENCTL</name>
          <displayName>PSIO6_GENCTL</displayName>
          <description>PSIOn General Control Register</description>
          <addressOffset>0x100</addressOffset>
       </register>
       <register derivedFrom="PSIO0_GENCTL">
          <name>PSIO7_GENCTL</name>
          <displayName>PSIO7_GENCTL</displayName>
          <description>PSIOn General Control Register</description>
          <addressOffset>0x120</addressOffset>
       </register>
       <register>
          <name>PSIO0_DATCTL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PSIO0_DATCTL</displayName>
          <description>PSIOn Data Control Register</description>
          <addressOffset>0x44</addressOffset>
          <access>read-write</access>
          <resetValue>0x33000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OUTDATWD</name>
              <description>Output Data Width\nIndicate the data width of OUTPUT DATA register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INDATWD</name>
              <description>Input Data Width\nIndicate the data width of INPUT DATA register.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ORDER</name>
              <description>Order\nThe order of output data and input data.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Data transfer start form LSB</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Data transfer start form MSB</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTDEPTH</name>
              <description>Output Data Depth\nRepresent the data depth of the output buffer, when data width is larger than 16-bit, this setting can be ignored.\nWhen the data width is between 9-bit and 16 bit, \nNote 1: The output data depth impacts when the output data empty flag and output under flow data flag is set to 1.\nNote 2: There is no difference of data depth no matter using software program data or PDMA program data.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>OUTDEPTH [0], the data depth is 1.\nOUTDEPTH, the data depth is 1</description>
                    <value>0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>OUTDEPTH [0], the data depth is 2.\nOUTDEPTH, the data depth is 2</description>
                    <value>1</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>OUTDEPTH, the data depth is 3</description>
                    <value>2</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>OUTDEPTH, the data depth is 4</description>
                    <value>3</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>INDEPTH</name>
              <description>Input Data Depth\nRepresent the data depth of the input buffer, when data width is larger than 16-bit, this setting can be ignored.\nWhen the data width is between 9-bit and 16 bit, \nNote 1: The input data depth impacts when the input data full flag and input data over flow flag is set to 1.\nNote 2: There is no difference of data depth no matter using software program data or PDMA program data.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>INDEPTH[0], the data depth is 1.\nINDEPTH, the data depth is 1</description>
                    <value>0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>INDEPTH[0], the data depth is 2.\nINDEPTH, the data depth is 2</description>
                    <value>1</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>INDEPTH, the data depth is 3</description>
                    <value>2</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>INDEPTH, the data depth is 4</description>
                    <value>3</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
