wosayttn/sdk-bsp-numaker-m55m1/Debug/svd/M55M1.svd
       <register derivedFrom="PSIO0_DATCTL">
          <name>PSIO1_DATCTL</name>
          <displayName>PSIO1_DATCTL</displayName>
          <description>PSIOn Data Control Register</description>
          <addressOffset>0x64</addressOffset>
       </register>
       <register derivedFrom="PSIO0_DATCTL">
          <name>PSIO2_DATCTL</name>
          <displayName>PSIO2_DATCTL</displayName>
          <description>PSIOn Data Control Register</description>
          <addressOffset>0x84</addressOffset>
       </register>
       <register derivedFrom="PSIO0_DATCTL">
          <name>PSIO3_DATCTL</name>
          <displayName>PSIO3_DATCTL</displayName>
          <description>PSIOn Data Control Register</description>
          <addressOffset>0xA4</addressOffset>
       </register>
       <register derivedFrom="PSIO0_DATCTL">
          <name>PSIO4_DATCTL</name>
          <displayName>PSIO4_DATCTL</displayName>
          <description>PSIOn Data Control Register</description>
          <addressOffset>0xC4</addressOffset>
       </register>
       <register derivedFrom="PSIO0_DATCTL">
          <name>PSIO5_DATCTL</name>
          <displayName>PSIO5_DATCTL</displayName>
          <description>PSIOn Data Control Register</description>
          <addressOffset>0xE4</addressOffset>
       </register>
       <register derivedFrom="PSIO0_DATCTL">
          <name>PSIO6_DATCTL</name>
          <displayName>PSIO6_DATCTL</displayName>
          <description>PSIOn Data Control Register</description>
          <addressOffset>0x104</addressOffset>
       </register>
       <register derivedFrom="PSIO0_DATCTL">
          <name>PSIO7_DATCTL</name>
          <displayName>PSIO7_DATCTL</displayName>
          <description>PSIOn Data Control Register</description>
          <addressOffset>0x124</addressOffset>
       </register>
       <register>
          <name>PSIO0_INSTS</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PSIO0_INSTS</displayName>
          <description>PSIOn Input Status Register</description>
          <addressOffset>0x48</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INSTS</name>
              <description>Input Status\nStatus input buffer. This register can be read clear.\nNote: When the valid bit is set, the valid bits number of INSTS is equal to the number of check points from the previous time INSTS update to the current INSTS update.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="PSIO0_INSTS">
          <name>PSIO1_INSTS</name>
          <displayName>PSIO1_INSTS</displayName>
          <description>PSIOn Input Status Register</description>
          <addressOffset>0x68</addressOffset>
       </register>
       <register derivedFrom="PSIO0_INSTS">
          <name>PSIO2_INSTS</name>
          <displayName>PSIO2_INSTS</displayName>
          <description>PSIOn Input Status Register</description>
          <addressOffset>0x88</addressOffset>
       </register>
       <register derivedFrom="PSIO0_INSTS">
          <name>PSIO3_INSTS</name>
          <displayName>PSIO3_INSTS</displayName>
          <description>PSIOn Input Status Register</description>
          <addressOffset>0xA8</addressOffset>
       </register>
       <register derivedFrom="PSIO0_INSTS">
          <name>PSIO4_INSTS</name>
          <displayName>PSIO4_INSTS</displayName>
          <description>PSIOn Input Status Register</description>
          <addressOffset>0xC8</addressOffset>
       </register>
       <register derivedFrom="PSIO0_INSTS">
          <name>PSIO5_INSTS</name>
          <displayName>PSIO5_INSTS</displayName>
          <description>PSIOn Input Status Register</description>
          <addressOffset>0xE8</addressOffset>
       </register>
       <register derivedFrom="PSIO0_INSTS">
          <name>PSIO6_INSTS</name>
          <displayName>PSIO6_INSTS</displayName>
          <description>PSIOn Input Status Register</description>
          <addressOffset>0x108</addressOffset>
       </register>
       <register derivedFrom="PSIO0_INSTS">
          <name>PSIO7_INSTS</name>
          <displayName>PSIO7_INSTS</displayName>
          <description>PSIOn Input Status Register</description>
          <addressOffset>0x128</addressOffset>
       </register>
       <register>
          <name>PSIO0_INDAT</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PSIO0_INDAT</displayName>
          <description>PSIOn Input Data Register</description>
          <addressOffset>0x4C</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INDAT</name>
              <description>Input Data Buffer\nThis register can be read clear.\nNote: The input data sample time is according to the slot length. The sampling time is near 3/4 slot. When the slot length is 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, PSIO sample input data when the slot controller count to 1, 2, 2, 3, 4, 5, 5, 6, 6, 7, 7, 8, 8, 9, 9.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="PSIO0_INDAT">
          <name>PSIO1_INDAT</name>
          <displayName>PSIO1_INDAT</displayName>
          <description>PSIOn Input Data Register</description>
          <addressOffset>0x6C</addressOffset>
       </register>
       <register derivedFrom="PSIO0_INDAT">
          <name>PSIO2_INDAT</name>
          <displayName>PSIO2_INDAT</displayName>
          <description>PSIOn Input Data Register</description>
          <addressOffset>0x8C</addressOffset>
       </register>
       <register derivedFrom="PSIO0_INDAT">
          <name>PSIO3_INDAT</name>
          <displayName>PSIO3_INDAT</displayName>
          <description>PSIOn Input Data Register</description>
          <addressOffset>0xAC</addressOffset>
       </register>
       <register derivedFrom="PSIO0_INDAT">
          <name>PSIO4_INDAT</name>
          <displayName>PSIO4_INDAT</displayName>
          <description>PSIOn Input Data Register</description>
          <addressOffset>0xCC</addressOffset>
       </register>
       <register derivedFrom="PSIO0_INDAT">
          <name>PSIO5_INDAT</name>
          <displayName>PSIO5_INDAT</displayName>
          <description>PSIOn Input Data Register</description>
          <addressOffset>0xEC</addressOffset>
       </register>
       <register derivedFrom="PSIO0_INDAT">
          <name>PSIO6_INDAT</name>
          <displayName>PSIO6_INDAT</displayName>
          <description>PSIOn Input Data Register</description>
          <addressOffset>0x10C</addressOffset>
       </register>
       <register derivedFrom="PSIO0_INDAT">
          <name>PSIO7_INDAT</name>
          <displayName>PSIO7_INDAT</displayName>
          <description>PSIOn Input Data Register</description>
          <addressOffset>0x12C</addressOffset>
       </register>
       <register>
          <name>PSIO0_OUTDAT</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PSIO0_OUTDAT</displayName>
          <description>PSIOn Output Data Register</description>
          <addressOffset>0x50</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OUTDAT</name>
              <description>Output Data Buffer\nThis field is used to configure output data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="PSIO0_OUTDAT">
          <name>PSIO1_OUTDAT</name>
          <displayName>PSIO1_OUTDAT</displayName>
          <description>PSIOn Output Data Register</description>
          <addressOffset>0x70</addressOffset>
       </register>
       <register derivedFrom="PSIO0_OUTDAT">
          <name>PSIO2_OUTDAT</name>
          <displayName>PSIO2_OUTDAT</displayName>
          <description>PSIOn Output Data Register</description>
          <addressOffset>0x90</addressOffset>
       </register>
       <register derivedFrom="PSIO0_OUTDAT">
          <name>PSIO3_OUTDAT</name>
          <displayName>PSIO3_OUTDAT</displayName>
          <description>PSIOn Output Data Register</description>
          <addressOffset>0xB0</addressOffset>
       </register>
       <register derivedFrom="PSIO0_OUTDAT">
          <name>PSIO4_OUTDAT</name>
          <displayName>PSIO4_OUTDAT</displayName>
          <description>PSIOn Output Data Register</description>
          <addressOffset>0xD0</addressOffset>
       </register>
       <register derivedFrom="PSIO0_OUTDAT">
          <name>PSIO5_OUTDAT</name>
          <displayName>PSIO5_OUTDAT</displayName>
          <description>PSIOn Output Data Register</description>
          <addressOffset>0xF0</addressOffset>
       </register>
       <register derivedFrom="PSIO0_OUTDAT">
          <name>PSIO6_OUTDAT</name>
          <displayName>PSIO6_OUTDAT</displayName>
          <description>PSIOn Output Data Register</description>
          <addressOffset>0x110</addressOffset>
       </register>
       <register derivedFrom="PSIO0_OUTDAT">
          <name>PSIO7_OUTDAT</name>
          <displayName>PSIO7_OUTDAT</displayName>
          <description>PSIOn Output Data Register</description>
          <addressOffset>0x130</addressOffset>
       </register>
