wosayttn/sdk-bsp-numaker-m55m1/Debug/svd/M55M1.svd
       <register derivedFrom="USBD_MXPLD0">
          <name>USBD_MXPLD19</name>
          <displayName>USBD_MXPLD19</displayName>
          <description>Endpoint 19 Maximal Payload Register</description>
          <addressOffset>0x634</addressOffset>
       </register>
       <register derivedFrom="USBD_CFG0">
          <name>USBD_CFG19</name>
          <displayName>USBD_CFG19</displayName>
          <description>Endpoint 19 Configuration Register</description>
          <addressOffset>0x638</addressOffset>
       </register>
       <register derivedFrom="USBD_CFGP0">
          <name>USBD_CFGP19</name>
          <displayName>USBD_CFGP19</displayName>
          <description>Endpoint 19 Set Stall and Clear In/Out Ready Control Register</description>
          <addressOffset>0x63C</addressOffset>
       </register>
       <register derivedFrom="USBD_BUFSEG0">
          <name>USBD_BUFSEG20</name>
          <displayName>USBD_BUFSEG20</displayName>
          <description>Endpoint 20 Buffer Segmentation Register</description>
          <addressOffset>0x640</addressOffset>
       </register>
       <register derivedFrom="USBD_MXPLD0">
          <name>USBD_MXPLD20</name>
          <displayName>USBD_MXPLD20</displayName>
          <description>Endpoint 20 Maximal Payload Register</description>
          <addressOffset>0x644</addressOffset>
       </register>
       <register derivedFrom="USBD_CFG0">
          <name>USBD_CFG20</name>
          <displayName>USBD_CFG20</displayName>
          <description>Endpoint 20 Configuration Register</description>
          <addressOffset>0x648</addressOffset>
       </register>
       <register derivedFrom="USBD_CFGP0">
          <name>USBD_CFGP20</name>
          <displayName>USBD_CFGP20</displayName>
          <description>Endpoint 20 Set Stall and Clear In/Out Ready Control Register</description>
          <addressOffset>0x64C</addressOffset>
       </register>
       <register derivedFrom="USBD_BUFSEG0">
          <name>USBD_BUFSEG21</name>
          <displayName>USBD_BUFSEG21</displayName>
          <description>Endpoint 21 Buffer Segmentation Register</description>
          <addressOffset>0x650</addressOffset>
       </register>
       <register derivedFrom="USBD_MXPLD0">
          <name>USBD_MXPLD21</name>
          <displayName>USBD_MXPLD21</displayName>
          <description>Endpoint 21 Maximal Payload Register</description>
          <addressOffset>0x654</addressOffset>
       </register>
       <register derivedFrom="USBD_CFG0">
          <name>USBD_CFG21</name>
          <displayName>USBD_CFG21</displayName>
          <description>Endpoint 21 Configuration Register</description>
          <addressOffset>0x658</addressOffset>
       </register>
       <register derivedFrom="USBD_CFGP0">
          <name>USBD_CFGP21</name>
          <displayName>USBD_CFGP21</displayName>
          <description>Endpoint 21 Set Stall and Clear In/Out Ready Control Register</description>
          <addressOffset>0x65C</addressOffset>
       </register>
       <register derivedFrom="USBD_BUFSEG0">
          <name>USBD_BUFSEG22</name>
          <displayName>USBD_BUFSEG22</displayName>
          <description>Endpoint 22 Buffer Segmentation Register</description>
          <addressOffset>0x660</addressOffset>
       </register>
       <register derivedFrom="USBD_MXPLD0">
          <name>USBD_MXPLD22</name>
          <displayName>USBD_MXPLD22</displayName>
          <description>Endpoint 22 Maximal Payload Register</description>
          <addressOffset>0x664</addressOffset>
       </register>
       <register derivedFrom="USBD_CFG0">
          <name>USBD_CFG22</name>
          <displayName>USBD_CFG22</displayName>
          <description>Endpoint 22 Configuration Register</description>
          <addressOffset>0x668</addressOffset>
       </register>
       <register derivedFrom="USBD_CFGP0">
          <name>USBD_CFGP22</name>
          <displayName>USBD_CFGP22</displayName>
          <description>Endpoint 22 Set Stall and Clear In/Out Ready Control Register</description>
          <addressOffset>0x66C</addressOffset>
       </register>
       <register derivedFrom="USBD_BUFSEG0">
          <name>USBD_BUFSEG23</name>
          <displayName>USBD_BUFSEG23</displayName>
          <description>Endpoint 23 Buffer Segmentation Register</description>
          <addressOffset>0x670</addressOffset>
       </register>
       <register derivedFrom="USBD_MXPLD0">
          <name>USBD_MXPLD23</name>
          <displayName>USBD_MXPLD23</displayName>
          <description>Endpoint 23 Maximal Payload Register</description>
          <addressOffset>0x674</addressOffset>
       </register>
       <register derivedFrom="USBD_CFG0">
          <name>USBD_CFG23</name>
          <displayName>USBD_CFG23</displayName>
          <description>Endpoint 23 Configuration Register</description>
          <addressOffset>0x678</addressOffset>
       </register>
       <register derivedFrom="USBD_CFGP0">
          <name>USBD_CFGP23</name>
          <displayName>USBD_CFGP23</displayName>
          <description>Endpoint 23 Set Stall and Clear In/Out Ready Control Register</description>
          <addressOffset>0x67C</addressOffset>
       </register>
       <register derivedFrom="USBD_BUFSEG0">
          <name>USBD_BUFSEG24</name>
          <displayName>USBD_BUFSEG24</displayName>
          <description>Endpoint 24 Buffer Segmentation Register</description>
          <addressOffset>0x680</addressOffset>
       </register>
       <register derivedFrom="USBD_MXPLD0">
          <name>USBD_MXPLD24</name>
          <displayName>USBD_MXPLD24</displayName>
          <description>Endpoint 24 Maximal Payload Register</description>
          <addressOffset>0x684</addressOffset>
       </register>
       <register derivedFrom="USBD_CFG0">
          <name>USBD_CFG24</name>
          <displayName>USBD_CFG24</displayName>
          <description>Endpoint 24 Configuration Register</description>
          <addressOffset>0x688</addressOffset>
       </register>
       <register derivedFrom="USBD_CFGP0">
          <name>USBD_CFGP24</name>
          <displayName>USBD_CFGP24</displayName>
          <description>Endpoint 24 Set Stall and Clear In/Out Ready Control Register</description>
          <addressOffset>0x68C</addressOffset>
       </register>
