wosayttn/sdk-bsp-numaker-m55m1/Debug/svd/M55M1.svd
       <register>
          <name>UTCPD_DTRXEVNT</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>UTCPD_DTRXEVNT</displayName>
          <description>UTCPD Enable Detect RX Event Register</description>
          <addressOffset>0x54</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SOPEN</name>
              <description>Enable SOP message </description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>UTCPD does not detect SOP message (default)</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>UTCPD detects SOP message</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SOPPEN</name>
              <description>Enable SOP' message </description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>UTCPD does not detect SOP' message (default)</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>UTCPD detects SOP' message</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SOPPPEN</name>
              <description>Enable SOP'' message </description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>UTCPD does not detect SOP'' message (default)</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>UTCPD detects SOP'' message</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SDBGPEN</name>
              <description>Enable SOP_DBG' message </description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>UTCPD does not detect SOP_DBG' message (default)</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>UTCPD detects SOP_DBG' message</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SDBGPPEN</name>
              <description>Enable SOP_DBG'' message </description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>UTCPD does not detect SOP_DBG'' message (default)</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>UTCPD detects SOP_DBG'' message</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>HRSTEN</name>
              <description>Enable Hard Reset </description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>UTCPD does not detect Hard Reset signaling (default)</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>UTCPD detects Hard Reset signaling</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>CABRSTEN</name>
              <description>Enable Cable Reset </description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>UTCPD does not detect Cable Reset signaling (default)</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>UTCPD detects Cable Reset signaling</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>UTCPD_RXBCNT</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>UTCPD_RXBCNT</displayName>
          <description>UTCPD RX Byte Count Register</description>
          <addressOffset>0x58</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXBCNT</name>
              <description>Receive Byte Count \nIndicates number of bytes in this register that are not stale. CPU should read the first RXBCNT bytes in this register. This is the number of bytes in the UTCPD_RXDAx plus three (for the RXFTYPE and RXHEAD). \nThe UTCPD shall clear the UTCPD_DTRXEVNT and the UTCPD_RXBCNT register to disable the PD message passing when CPU writes the UTCPD_TXCTL register requesting a Hard Reset.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>UTCPD_RXFTYPE</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>UTCPD_RXFTYPE</displayName>
          <description>UTCPD Received Frame Type Register</description>
          <addressOffset>0x5C</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXFTYPE</name>
              <description>Received Frame Type \nAll others are reserved.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Received SOP</description>
                    <value>#000</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Received SOP'</description>
                    <value>#001</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>Received SOP''</description>
                    <value>#010</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Received SOP_DBG'</description>
                    <value>#011</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>4</name>
                    <description>Received SOP_DBG''</description>
                    <value>#100</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>6</name>
                    <description>Received Cable Reset</description>
                    <value>#110</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>UTCPD_RXHEAD</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>UTCPD_RXHEAD</displayName>
          <description>UTCPD Received Header Data Register</description>
          <addressOffset>0x60</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXHEAD0</name>
              <description>USB PD message header byte 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RXHEAD1</name>
              <description>USB PD message header byte 1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>UTCPD_RXDA0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>UTCPD_RXDA0</displayName>
          <description>UTCPD Received Data0 Register</description>
          <addressOffset>0x70</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXDAB0</name>
              <description>USB PD Received Datax byte 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RXDAB1</name>
              <description>USB PD Received Datax byte 1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RXDAB2</name>
              <description>USB PD Received Datax byte 2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RXDAB3</name>
              <description>USB PD Received Datax byte 3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="UTCPD_RXDA0">
          <name>UTCPD_RXDA1</name>
          <displayName>UTCPD_RXDA1</displayName>
          <description>UTCPD Received Data1 Register</description>
          <addressOffset>0x74</addressOffset>
       </register>
       <register derivedFrom="UTCPD_RXDA0">
          <name>UTCPD_RXDA2</name>
          <displayName>UTCPD_RXDA2</displayName>
          <description>UTCPD Received Data2 Register</description>
          <addressOffset>0x78</addressOffset>
       </register>
       <register derivedFrom="UTCPD_RXDA0">
          <name>UTCPD_RXDA3</name>
          <displayName>UTCPD_RXDA3</displayName>
          <description>UTCPD Received Data3 Register</description>
          <addressOffset>0x7C</addressOffset>
       </register>
       <register derivedFrom="UTCPD_RXDA0">
          <name>UTCPD_RXDA4</name>
          <displayName>UTCPD_RXDA4</displayName>
          <description>UTCPD Received Data4 Register</description>
          <addressOffset>0x80</addressOffset>
       </register>
       <register derivedFrom="UTCPD_RXDA0">
          <name>UTCPD_RXDA5</name>
          <displayName>UTCPD_RXDA5</displayName>
          <description>UTCPD Received Data5 Register</description>
          <addressOffset>0x84</addressOffset>
       </register>
       <register derivedFrom="UTCPD_RXDA0">
          <name>UTCPD_RXDA6</name>
          <displayName>UTCPD_RXDA6</displayName>
          <description>UTCPD Received Data6 Register</description>
          <addressOffset>0x88</addressOffset>
       </register>
       <register>
          <name>UTCPD_TXCTL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>UTCPD_TXCTL</displayName>
          <description>UTCPD TX Control Register</description>
          <addressOffset>0x90</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXSTYPE</name>
              <description>Transmit SOP* message \nThe UTCPD shall ignore the Retry Counter bits when transmitting a Hard Reset, Cable Reset, or BIST Carrier</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Transmit SOP</description>
                    <value>#000</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Transmit SOP'</description>
                    <value>#001</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>Transmit SOP''</description>
                    <value>#010</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Transmit SOP_DBG'</description>
                    <value>#011</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>4</name>
                    <description>Transmit SOP_DBG''</description>
                    <value>#100</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>5</name>
                    <description>Transmit Hard Reset</description>
                    <value>#101</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>6</name>
                    <description>Transmit Cable Reset</description>
                    <value>#110</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>7</name>
                    <description>Transmit BIST Carrier Mode 2</description>
                    <value>#111</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>RETRYCNT</name>
              <description>Retry Counter </description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No message retry is required</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Automatically retry message transmission once</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>Automatically retry message transmission twice</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Automatically retry message transmission three times</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>UTCPD_TXBCNT</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>UTCPD_TXBCNT</displayName>
          <description>UTCPD TX Byte Count Register</description>
          <addressOffset>0x94</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXBCNT</name>
              <description>Transmit Byte Count\nThis is the number of bytes in the UTCPD_TXDA plus two (for the TXHEAD) \nIf a previous transmit request has not yet completed when TX_CTL is written requesting a Hard Reset, the UTCPD shall assert the Transmission Discarded bit(TXDCIS (UTCPD_IS[5])).\nThe UTCPD shall assert both TXOKIS (UTCPD_IS[6]) and TXFALIS (UTCPD_IS[4]) after it completes the sending of a Hard Reset.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>UTCPD_TXHEAD</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>UTCPD_TXHEAD</displayName>
          <description>UTCPD TX Header Data Register</description>
          <addressOffset>0x98</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXHEAD0</name>
              <description>Transmit Header Byte 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXHEAD1</name>
              <description>Transmit Header Byte 1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>UTCPD_TXDA0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>UTCPD_TXDA0</displayName>
          <description>UTCPD Transmit Data0 Register</description>
          <addressOffset>0xA0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXDAB0</name>
              <description>USB PD Transmit Datax byte 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXDAB1</name>
              <description>USB PD Transmit Datax byte 1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXDAB2</name>
              <description>USB PD Transmit Datax byte 2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXDAB3</name>
              <description>USB PD Transmit Datax byte 3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="UTCPD_TXDA0">
          <name>UTCPD_TXDA1</name>
          <displayName>UTCPD_TXDA1</displayName>
          <description>UTCPD Transmit Data1 Register</description>
          <addressOffset>0xA4</addressOffset>
       </register>
       <register derivedFrom="UTCPD_TXDA0">
          <name>UTCPD_TXDA2</name>
          <displayName>UTCPD_TXDA2</displayName>
          <description>UTCPD Transmit Data2 Register</description>
          <addressOffset>0xA8</addressOffset>
       </register>
       <register derivedFrom="UTCPD_TXDA0">
          <name>UTCPD_TXDA3</name>
          <displayName>UTCPD_TXDA3</displayName>
          <description>UTCPD Transmit Data3 Register</description>
          <addressOffset>0xAC</addressOffset>
       </register>
       <register derivedFrom="UTCPD_TXDA0">
          <name>UTCPD_TXDA4</name>
          <displayName>UTCPD_TXDA4</displayName>
          <description>UTCPD Transmit Data4 Register</description>
          <addressOffset>0xB0</addressOffset>
       </register>
       <register derivedFrom="UTCPD_TXDA0">
          <name>UTCPD_TXDA5</name>
          <displayName>UTCPD_TXDA5</displayName>
          <description>UTCPD Transmit Data5 Register</description>
          <addressOffset>0xB4</addressOffset>
       </register>
       <register derivedFrom="UTCPD_TXDA0">
          <name>UTCPD_TXDA6</name>
          <displayName>UTCPD_TXDA6</displayName>
          <description>UTCPD Transmit Data6 Register</description>
          <addressOffset>0xB8</addressOffset>
       </register>
