wosayttn/sdk-bsp-numaker-m55m1/Debug/svd/M55M1.svd
       <register>
          <name>UTCPD_VCDGCTL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>UTCPD_VCDGCTL</displayName>
          <description>UTCPD VCONN Discharge Control Register</description>
          <addressOffset>0xE0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VCDGDTEN</name>
              <description>VCONN Discharge Detect Enable </description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>VCDGEN</name>
              <description>VCONN Discharge Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>UTCPD_PHYSLEW</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>UTCPD_PHYSLEW</displayName>
          <description>UTCPD PHY Slew Rate Control Register</description>
          <addressOffset>0xE4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000024</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXRTRIM</name>
              <description>TX Trim Rising slew rate \nIt is for BMC eye diagram.\nTrim PHY TX Rising slew rate (from ROMMAP)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXFTRIM</name>
              <description>TX Trim Falling slew rate\nIt is for BMC eye diagram.\nTrim PHY TX falling slew rate. (from ROMMAP)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IDLESEL</name>
              <description>Bus Idle Select\nOnly after bus idle, the de-bounce circuit starts.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Digital bus no transaction over 12us</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Digital and analog bus no transaction over 12us</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>Analog bus no transaction over 12us</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>CC pins no activity</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>UTCPD_ADGTM</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>UTCPD_ADGTM</displayName>
          <description>UTCPD Auto Discharge Time Register</description>
          <addressOffset>0xE8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000064</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADGTM</name>
              <description>Auto Discharge time </description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>UTCPD_VSAFE0V</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>UTCPD_VSAFE0V</displayName>
          <description>UTCPD Auto Discharge VSAFE0V Register</description>
          <addressOffset>0xEC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VSAFE0V</name>
              <description>Set the vSafe0V voltage level.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>UTCPD_VSAFE5V</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>UTCPD_VSAFE5V</displayName>
          <description>UTCPD VSAFE5V Register</description>
          <addressOffset>0xF0</addressOffset>
          <access>read-write</access>
          <resetValue>0x000000C8</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VSAFE5V</name>
              <description>Set the vSafe5V voltage level \nFor fast role swap voltage comparison.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>UTCPD_RATIO</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>UTCPD_RATIO</displayName>
          <description>UTCPD DRP Toggle Ratio Register</description>
          <addressOffset>0xF4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DRPRATIO</name>
              <description>The percent of time that a DRP shall advertise source  sink during tDRP </description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>50:50 (Sink : Source)</description>
                    <value>#000</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>40:60 (Sink : Source)</description>
                    <value>#001</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>30:70 (Sink : Source)</description>
                    <value>#010</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>5</name>
                    <description>60:40 (Sink : Source)</description>
                    <value>#101</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>6</name>
                    <description>70:30 (Sink: Source)</description>
                    <value>#110</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>7</name>
                    <description>Reserved.</description>
                    <value>#111</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>VBSEL</name>
              <description>VBUS_VOLTAGE_SEL\nSelect comparing value (vbus_voltage_s) during vbus discharge determines to stop discharging or not. </description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>VBUS voltage value from ADC only when VBMONI (UTCPD_PWRCT[6]) is 1</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>VBUS voltage value from ADC</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>ADCAVG</name>
              <description>ADC moving average enable \nIf enable this bit, average the ADC value for 4 times</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>UTCPD_INTFRAME</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>UTCPD_INTFRAME</displayName>
          <description>UTCPD Inter-Frame Time Register</description>
          <addressOffset>0xF8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000019</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INTFRAME</name>
              <description>USB PD Inter frame gap \nEach unit time: 83ns (12 MHz RC)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>UTCPD_VBOVTH</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>UTCPD_VBOVTH</displayName>
          <description>UTCPD VBUS Over Voltage Threshold Register</description>
          <addressOffset>0xFC</addressOffset>
          <access>read-write</access>
          <resetValue>0x000003FF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VBOVTH</name>
              <description>VBUS Over Voltage Threshold\nThis value defines the VBUS over voltage threshold\n10-bit for voltage threshold with 25mV LSB.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>UTCPD_VNDINIT</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>UTCPD_VNDINIT</displayName>
          <description>UTCPD Vendor Initial Register</description>
          <addressOffset>0x100</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000064</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DVCAPDEF</name>
              <description>Device Capability Default Setting </description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>UTCPD_BMCTXBP</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>UTCPD_BMCTXBP</displayName>
          <description>UTCPD BMC TX Bit Period Register</description>
          <addressOffset>0x104</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000027</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BMCTXBP</name>
              <description>BMC Tx bit period\nIt's for BMC eye diagram.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>UTCPD_BMCTXDU</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>UTCPD_BMCTXDU</displayName>
          <description>UTCPD BMC TX Duty Register</description>
          <addressOffset>0x108</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DUOFFS2</name>
              <description>BMC Tx duty offset parameter 2 \nIt's for BMC eye diagram.\nOffset count value. </description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DUOFFS1</name>
              <description>BMC Tx duty offset parameter 1 \nIt's for BMC eye diagram.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Increase duty offset?. (+)</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Decrease duty offset?. (-)</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>UTCPD_VCPSVOL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>UTCPD_VCPSVOL</displayName>
          <description>VCONN Present Voltage Register</description>
          <addressOffset>0x10C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000060</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VCPSVOL</name>
              <description>VCONN Present voltage</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>UTCPD_VCUV</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>UTCPD_VCUV</displayName>
          <description>VCONN Under Voltage Register</description>
          <addressOffset>0x110</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000020</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VCUV</name>
              <description>VCONN under voltage comparator </description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>UTCPD_BMCSLICE</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>UTCPD_BMCSLICE</displayName>
          <description>UTCPD BMC SLICE Control Register</description>
          <addressOffset>0x118</addressOffset>
          <access>read-write</access>
          <resetValue>0x08248423</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SLICEL</name>
              <description>TX Slice Low Level Control\nLow level slice control (The LSB is 2mV.) </description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>0.18V</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>0.2V</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>0.22V</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>0.24V (Default)</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SLICEH</name>
              <description>TX Slice High Level Control\nHigh level slice control (The LSB is 2mV.) </description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>0.84V (Default)</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>0.86V</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>0.88V</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>0.9V</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SLICEM</name>
              <description>TX Slice Middle Level Control\nMiddle level slice control (The LSB is 2mV.) </description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>0.48V</description>
                    <value>#000</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>4</name>
                    <description>0.56V (Default)</description>
                    <value>#100</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>7</name>
                    <description>0.62V</description>
                    <value>#111</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIMRD</name>
              <description>TRIMRD</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIMRP</name>
              <description>TRIMRP</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIMV1P1</name>
              <description>TRIMV1P1</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIMVBUS10</name>
              <description>TRIMVBUS10</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIMVBUS20</name>
              <description>TRIMVBUS20</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VTRIM</name>
              <description>Reference Voltage TRIM setting for TCPD PHY macro</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>UTCPD_PHYCTL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>UTCPD_PHYCTL</displayName>
          <description>UTCPD PHY Power Control Register</description>
          <addressOffset>0x11C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PHYPWR</name>
              <description>Analog PHY Power</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Power down PHY</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Enable PHY</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>DBCTL</name>
              <description>Dead Battery control</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Dead Battery circuit control internal Rd/Rp</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Role Control Register control internal Rd/Rp</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
