wosayttn/sdk-bsp-numaker-m55m1/Debug/svd/M55M1.svd
       <register derivedFrom="EADC_M4CTL1">
          <name>EADC_M5CTL1</name>
          <displayName>EADC_M5CTL1</displayName>
          <description>EADC Sample Module 5 Control Register 1</description>
          <addressOffset>0x154</addressOffset>
       </register>
       <register derivedFrom="EADC_M4CTL1">
          <name>EADC_M6CTL1</name>
          <displayName>EADC_M6CTL1</displayName>
          <description>EADC Sample Module 6 Control Register 1</description>
          <addressOffset>0x158</addressOffset>
       </register>
       <register derivedFrom="EADC_M4CTL1">
          <name>EADC_M7CTL1</name>
          <displayName>EADC_M7CTL1</displayName>
          <description>EADC Sample Module 7 Control Register 1</description>
          <addressOffset>0x15C</addressOffset>
       </register>
       <register derivedFrom="EADC_M4CTL1">
          <name>EADC_M8CTL1</name>
          <displayName>EADC_M8CTL1</displayName>
          <description>EADC Sample Module 8 Control Register 1</description>
          <addressOffset>0x160</addressOffset>
       </register>
       <register derivedFrom="EADC_M4CTL1">
          <name>EADC_M9CTL1</name>
          <displayName>EADC_M9CTL1</displayName>
          <description>EADC Sample Module 9 Control Register 1</description>
          <addressOffset>0x164</addressOffset>
       </register>
       <register derivedFrom="EADC_M4CTL1">
          <name>EADC_M10CTL1</name>
          <displayName>EADC_M10CTL1</displayName>
          <description>EADC Sample Module 10 Control Register 1</description>
          <addressOffset>0x168</addressOffset>
       </register>
       <register derivedFrom="EADC_M4CTL1">
          <name>EADC_M11CTL1</name>
          <displayName>EADC_M11CTL1</displayName>
          <description>EADC Sample Module 11 Control Register 1</description>
          <addressOffset>0x16C</addressOffset>
       </register>
       <register derivedFrom="EADC_M4CTL1">
          <name>EADC_M12CTL1</name>
          <displayName>EADC_M12CTL1</displayName>
          <description>EADC Sample Module 12 Control Register 1</description>
          <addressOffset>0x170</addressOffset>
       </register>
       <register derivedFrom="EADC_M4CTL1">
          <name>EADC_M13CTL1</name>
          <displayName>EADC_M13CTL1</displayName>
          <description>EADC Sample Module 13 Control Register 1</description>
          <addressOffset>0x174</addressOffset>
       </register>
       <register derivedFrom="EADC_M4CTL1">
          <name>EADC_M14CTL1</name>
          <displayName>EADC_M14CTL1</displayName>
          <description>EADC Sample Module 14 Control Register 1</description>
          <addressOffset>0x178</addressOffset>
       </register>
       <register derivedFrom="EADC_M4CTL1">
          <name>EADC_M15CTL1</name>
          <displayName>EADC_M15CTL1</displayName>
          <description>EADC Sample Module 15 Control Register 1</description>
          <addressOffset>0x17C</addressOffset>
       </register>
       <register derivedFrom="EADC_M4CTL1">
          <name>EADC_M16CTL1</name>
          <displayName>EADC_M16CTL1</displayName>
          <description>EADC Sample Module 16 Control Register 1</description>
          <addressOffset>0x180</addressOffset>
       </register>
       <register derivedFrom="EADC_M4CTL1">
          <name>EADC_M17CTL1</name>
          <displayName>EADC_M17CTL1</displayName>
          <description>EADC Sample Module 17 Control Register 1</description>
          <addressOffset>0x184</addressOffset>
       </register>
       <register derivedFrom="EADC_M4CTL1">
          <name>EADC_M18CTL1</name>
          <displayName>EADC_M18CTL1</displayName>
          <description>EADC Sample Module 18 Control Register 1</description>
          <addressOffset>0x188</addressOffset>
       </register>
       <register>
          <name>EADC_DAT19</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>EADC_DAT19</displayName>
          <description>EADC Data Register 19 for Sample Module 19</description>
          <addressOffset>0x200</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RESULT</name>
              <description>EADC Conversion Result\nThis field contains 12 bits conversion result. The 12-bit EADC conversion result with unsigned format will be filled in RESULT[11:0] and zero will be filled in RESULT[15:12].\nNote: When operating in oversampling mode, RESULT[15:0] can represent oversampling results.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OV</name>
              <description>Overrun Flag\nIf converted data in RESULT[11:0] has not been read before new conversion result is loaded to this register, OV is set to 1.\nNote: It is cleared by hardware after EADC_DAT register is read.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Data in RESULT[11:0] is recent conversion result</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Data in RESULT[11:0] is overwrite</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>VALID</name>
              <description>Valid Flag\nThis bit is set to 1 when corresponding sample module channel analog input conversion is completed and cleared by hardware after EADC_DAT register is read.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Data in RESULT[11:0] bits is not valid</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Data in RESULT[11:0] bits is valid</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="EADC_DAT19">
          <name>EADC_DAT20</name>
          <displayName>EADC_DAT20</displayName>
          <description>EADC Data Register 20 for Sample Module 20</description>
          <addressOffset>0x204</addressOffset>
       </register>
       <register derivedFrom="EADC_DAT19">
          <name>EADC_DAT21</name>
          <displayName>EADC_DAT21</displayName>
          <description>EADC Data Register 21 for Sample Module 21</description>
          <addressOffset>0x208</addressOffset>
       </register>
       <register derivedFrom="EADC_DAT19">
          <name>EADC_DAT22</name>
          <displayName>EADC_DAT22</displayName>
          <description>EADC Data Register 22 for Sample Module 22</description>
          <addressOffset>0x20C</addressOffset>
       </register>
       <register derivedFrom="EADC_DAT19">
          <name>EADC_DAT23</name>
          <displayName>EADC_DAT23</displayName>
          <description>EADC Data Register 23 for Sample Module 23</description>
          <addressOffset>0x210</addressOffset>
       </register>
       <register derivedFrom="EADC_DAT19">
          <name>EADC_DAT24</name>
          <displayName>EADC_DAT24</displayName>
          <description>EADC Data Register 24 for Sample Module 24</description>
          <addressOffset>0x214</addressOffset>
       </register>
       <register derivedFrom="EADC_DAT19">
          <name>EADC_DAT25</name>
          <displayName>EADC_DAT25</displayName>
          <description>EADC Data Register 25 for Sample Module 25</description>
          <addressOffset>0x218</addressOffset>
       </register>
       <register derivedFrom="EADC_DAT19">
          <name>EADC_DAT26</name>
          <displayName>EADC_DAT26</displayName>
          <description>EADC Data Register 26 for Sample Module 26</description>
          <addressOffset>0x21C</addressOffset>
       </register>
       <register derivedFrom="EADC_DAT19">
          <name>EADC_DAT27</name>
          <displayName>EADC_DAT27</displayName>
          <description>EADC Data Register 27 for Sample Module 27</description>
          <addressOffset>0x220</addressOffset>
       </register>
       <register>
          <name>EADC_SCTL19</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>EADC_SCTL19</displayName>
          <description>EADC Sample Module 19 Control Register</description>
          <addressOffset>0x230</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CHSEL</name>
              <description>EADC Sample Module Channel Selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTPOS</name>
              <description>Interrupt Flag Position Select</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Set ADIFn (EADC_STATUS2[n], n=0~3) at EADC end of conversion</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Set ADIFn (EADC_STATUS2[n], n=0~3) at EADC start of conversion</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>TRGDLDIV</name>
              <description>EADC Sample Module Start of Conversion Trigger Delay Clock Divider Selection\nTrigger delay clock frequency:</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>EADC_CLK/1</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>EADC_CLK/2</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>EADC_CLK/4</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>EADC_CLK/16</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>TRGDLCNT</name>
              <description>EADC Sample Module Start of Conversion Trigger Delay Time</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRGSEL</name>
              <description>EADC Sample Module Start of Conversion Trigger Source Selection</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTREN</name>
              <description>EADC External Trigger Rising Edge Enable Bit</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Rising edge Disabled when EADC selects EADC_ST(x=0, 1) as trigger source</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Rising edge Enabled when EADC selects EADC_ST(x=0, 1) as trigger source</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTFEN</name>
              <description>EADC External Trigger Falling Edge Enable Bit</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Falling edge Disabled when EADC selects EADC_ST(x=0, 1) as trigger source</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Falling edge Enabled when EADC selects EADC_ST(x=0, 1) as trigger source</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTSMPT</name>
              <description>EADC Sampling Time Extend\nWhen EADC converting at high conversion rate, the sampling time of analog input voltage may not be enough if input channel loading is heavy, and software can extend EADC sampling time after trigger source is coming to get enough sampling time.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="EADC_SCTL19">
          <name>EADC_SCTL20</name>
          <displayName>EADC_SCTL20</displayName>
          <description>EADC Sample Module 20 Control Register</description>
          <addressOffset>0x234</addressOffset>
       </register>
       <register derivedFrom="EADC_SCTL19">
          <name>EADC_SCTL21</name>
          <displayName>EADC_SCTL21</displayName>
          <description>EADC Sample Module 21 Control Register</description>
          <addressOffset>0x238</addressOffset>
       </register>
       <register derivedFrom="EADC_SCTL19">
          <name>EADC_SCTL22</name>
          <displayName>EADC_SCTL22</displayName>
          <description>EADC Sample Module 22 Control Register</description>
          <addressOffset>0x23C</addressOffset>
       </register>
       <register derivedFrom="EADC_SCTL19">
          <name>EADC_SCTL23</name>
          <displayName>EADC_SCTL23</displayName>
          <description>EADC Sample Module 23 Control Register</description>
          <addressOffset>0x240</addressOffset>
       </register>
       <register>
          <name>EADC_SCTL24</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>EADC_SCTL24</displayName>
          <description>EADC Sample Module 24 Control Register</description>
          <addressOffset>0x244</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EXTSMPT</name>
              <description>ADC Sampling Time Extend\nWhen EADC converting at high conversion rate, the sampling time of analog input voltage may not be enough if input channel loading is heavy, and software can extend EADC sampling time after trigger source is coming to get enough sampling time.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
