wosayttn/sdk-bsp-numaker-m55m1/Debug/svd/M55M1.svd
       <register derivedFrom="CRYPTO_HMAC_FDBCK0">
          <name>CRYPTO_HMAC_FDBCK21</name>
          <displayName>CRYPTO_HMAC_FDBCK21</displayName>
          <description>SHA/HMAC Output Feedback Data 21 After SHA/HMAC Operation</description>
          <addressOffset>0x3AC</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_FDBCK0">
          <name>CRYPTO_HMAC_FDBCK22</name>
          <displayName>CRYPTO_HMAC_FDBCK22</displayName>
          <description>SHA/HMAC Output Feedback Data 22 After SHA/HMAC Operation</description>
          <addressOffset>0x3B0</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_FDBCK0">
          <name>CRYPTO_HMAC_FDBCK23</name>
          <displayName>CRYPTO_HMAC_FDBCK23</displayName>
          <description>SHA/HMAC Output Feedback Data 23 After SHA/HMAC Operation</description>
          <addressOffset>0x3B4</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_FDBCK0">
          <name>CRYPTO_HMAC_FDBCK24</name>
          <displayName>CRYPTO_HMAC_FDBCK24</displayName>
          <description>SHA/HMAC Output Feedback Data 24 After SHA/HMAC Operation</description>
          <addressOffset>0x3B8</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_FDBCK0">
          <name>CRYPTO_HMAC_FDBCK25</name>
          <displayName>CRYPTO_HMAC_FDBCK25</displayName>
          <description>SHA/HMAC Output Feedback Data 25 After SHA/HMAC Operation</description>
          <addressOffset>0x3BC</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_FDBCK0">
          <name>CRYPTO_HMAC_FDBCK26</name>
          <displayName>CRYPTO_HMAC_FDBCK26</displayName>
          <description>SHA/HMAC Output Feedback Data 26 After SHA/HMAC Operation</description>
          <addressOffset>0x3C0</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_FDBCK0">
          <name>CRYPTO_HMAC_FDBCK27</name>
          <displayName>CRYPTO_HMAC_FDBCK27</displayName>
          <description>SHA/HMAC Output Feedback Data 27 After SHA/HMAC Operation</description>
          <addressOffset>0x3C4</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_FDBCK0">
          <name>CRYPTO_HMAC_FDBCK28</name>
          <displayName>CRYPTO_HMAC_FDBCK28</displayName>
          <description>SHA/HMAC Output Feedback Data 28 After SHA/HMAC Operation</description>
          <addressOffset>0x3C8</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_FDBCK0">
          <name>CRYPTO_HMAC_FDBCK29</name>
          <displayName>CRYPTO_HMAC_FDBCK29</displayName>
          <description>SHA/HMAC Output Feedback Data 29 After SHA/HMAC Operation</description>
          <addressOffset>0x3CC</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_FDBCK0">
          <name>CRYPTO_HMAC_FDBCK30</name>
          <displayName>CRYPTO_HMAC_FDBCK30</displayName>
          <description>SHA/HMAC Output Feedback Data 30 After SHA/HMAC Operation</description>
          <addressOffset>0x3D0</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_FDBCK0">
          <name>CRYPTO_HMAC_FDBCK31</name>
          <displayName>CRYPTO_HMAC_FDBCK31</displayName>
          <description>SHA/HMAC Output Feedback Data 31 After SHA/HMAC Operation</description>
          <addressOffset>0x3D4</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_FDBCK0">
          <name>CRYPTO_HMAC_FDBCK32</name>
          <displayName>CRYPTO_HMAC_FDBCK32</displayName>
          <description>SHA/HMAC Output Feedback Data 32 After SHA/HMAC Operation</description>
          <addressOffset>0x3D8</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_FDBCK0">
          <name>CRYPTO_HMAC_FDBCK33</name>
          <displayName>CRYPTO_HMAC_FDBCK33</displayName>
          <description>SHA/HMAC Output Feedback Data 33 After SHA/HMAC Operation</description>
          <addressOffset>0x3DC</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_FDBCK0">
          <name>CRYPTO_HMAC_FDBCK34</name>
          <displayName>CRYPTO_HMAC_FDBCK34</displayName>
          <description>SHA/HMAC Output Feedback Data 34 After SHA/HMAC Operation</description>
          <addressOffset>0x3E0</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_FDBCK0">
          <name>CRYPTO_HMAC_FDBCK35</name>
          <displayName>CRYPTO_HMAC_FDBCK35</displayName>
          <description>SHA/HMAC Output Feedback Data 35 After SHA/HMAC Operation</description>
          <addressOffset>0x3E4</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_FDBCK0">
          <name>CRYPTO_HMAC_FDBCK36</name>
          <displayName>CRYPTO_HMAC_FDBCK36</displayName>
          <description>SHA/HMAC Output Feedback Data 36 After SHA/HMAC Operation</description>
          <addressOffset>0x3E8</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_FDBCK0">
          <name>CRYPTO_HMAC_FDBCK37</name>
          <displayName>CRYPTO_HMAC_FDBCK37</displayName>
          <description>SHA/HMAC Output Feedback Data 37 After SHA/HMAC Operation</description>
          <addressOffset>0x3EC</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_FDBCK0">
          <name>CRYPTO_HMAC_FDBCK38</name>
          <displayName>CRYPTO_HMAC_FDBCK38</displayName>
          <description>SHA/HMAC Output Feedback Data 38 After SHA/HMAC Operation</description>
          <addressOffset>0x3F0</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_FDBCK0">
          <name>CRYPTO_HMAC_FDBCK39</name>
          <displayName>CRYPTO_HMAC_FDBCK39</displayName>
          <description>SHA/HMAC Output Feedback Data 39 After SHA/HMAC Operation</description>
          <addressOffset>0x3F4</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_FDBCK0">
          <name>CRYPTO_HMAC_FDBCK40</name>
          <displayName>CRYPTO_HMAC_FDBCK40</displayName>
          <description>SHA/HMAC Output Feedback Data 40 After SHA/HMAC Operation</description>
          <addressOffset>0x3F8</addressOffset>
       </register>
