wosayttn/sdk-bsp-numaker-m55m1/Debug/svd/M55M1.svd
       <register derivedFrom="CRYPTO_HMAC_FDBCK0">
          <name>CRYPTO_HMAC_FDBCK41</name>
          <displayName>CRYPTO_HMAC_FDBCK41</displayName>
          <description>SHA/HMAC Output Feedback Data 41 After SHA/HMAC Operation</description>
          <addressOffset>0x3FC</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_FDBCK0">
          <name>CRYPTO_HMAC_FDBCK42</name>
          <displayName>CRYPTO_HMAC_FDBCK42</displayName>
          <description>SHA/HMAC Output Feedback Data 42 After SHA/HMAC Operation</description>
          <addressOffset>0x400</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_FDBCK0">
          <name>CRYPTO_HMAC_FDBCK43</name>
          <displayName>CRYPTO_HMAC_FDBCK43</displayName>
          <description>SHA/HMAC Output Feedback Data 43 After SHA/HMAC Operation</description>
          <addressOffset>0x404</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_FDBCK0">
          <name>CRYPTO_HMAC_FDBCK44</name>
          <displayName>CRYPTO_HMAC_FDBCK44</displayName>
          <description>SHA/HMAC Output Feedback Data 44 After SHA/HMAC Operation</description>
          <addressOffset>0x408</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_FDBCK0">
          <name>CRYPTO_HMAC_FDBCK45</name>
          <displayName>CRYPTO_HMAC_FDBCK45</displayName>
          <description>SHA/HMAC Output Feedback Data 45 After SHA/HMAC Operation</description>
          <addressOffset>0x40C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_FDBCK0">
          <name>CRYPTO_HMAC_FDBCK46</name>
          <displayName>CRYPTO_HMAC_FDBCK46</displayName>
          <description>SHA/HMAC Output Feedback Data 46 After SHA/HMAC Operation</description>
          <addressOffset>0x410</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_FDBCK0">
          <name>CRYPTO_HMAC_FDBCK47</name>
          <displayName>CRYPTO_HMAC_FDBCK47</displayName>
          <description>SHA/HMAC Output Feedback Data 47 After SHA/HMAC Operation</description>
          <addressOffset>0x414</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_FDBCK0">
          <name>CRYPTO_HMAC_FDBCK48</name>
          <displayName>CRYPTO_HMAC_FDBCK48</displayName>
          <description>SHA/HMAC Output Feedback Data 48 After SHA/HMAC Operation</description>
          <addressOffset>0x418</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_FDBCK0">
          <name>CRYPTO_HMAC_FDBCK49</name>
          <displayName>CRYPTO_HMAC_FDBCK49</displayName>
          <description>SHA/HMAC Output Feedback Data 49 After SHA/HMAC Operation</description>
          <addressOffset>0x41C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_FDBCK0">
          <name>CRYPTO_HMAC_FDBCK50</name>
          <displayName>CRYPTO_HMAC_FDBCK50</displayName>
          <description>SHA/HMAC Output Feedback Data 50 After SHA/HMAC Operation</description>
          <addressOffset>0x420</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_FDBCK0">
          <name>CRYPTO_HMAC_FDBCK51</name>
          <displayName>CRYPTO_HMAC_FDBCK51</displayName>
          <description>SHA/HMAC Output Feedback Data 51 After SHA/HMAC Operation</description>
          <addressOffset>0x424</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_FDBCK0">
          <name>CRYPTO_HMAC_FDBCK52</name>
          <displayName>CRYPTO_HMAC_FDBCK52</displayName>
          <description>SHA/HMAC Output Feedback Data 52 After SHA/HMAC Operation</description>
          <addressOffset>0x428</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_FDBCK0">
          <name>CRYPTO_HMAC_FDBCK53</name>
          <displayName>CRYPTO_HMAC_FDBCK53</displayName>
          <description>SHA/HMAC Output Feedback Data 53 After SHA/HMAC Operation</description>
          <addressOffset>0x42C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_FDBCK0">
          <name>CRYPTO_HMAC_FDBCK54</name>
          <displayName>CRYPTO_HMAC_FDBCK54</displayName>
          <description>SHA/HMAC Output Feedback Data 54 After SHA/HMAC Operation</description>
          <addressOffset>0x430</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_FDBCK0">
          <name>CRYPTO_HMAC_FDBCK55</name>
          <displayName>CRYPTO_HMAC_FDBCK55</displayName>
          <description>SHA/HMAC Output Feedback Data 55 After SHA/HMAC Operation</description>
          <addressOffset>0x434</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_FDBCK0">
          <name>CRYPTO_HMAC_FDBCK56</name>
          <displayName>CRYPTO_HMAC_FDBCK56</displayName>
          <description>SHA/HMAC Output Feedback Data 56 After SHA/HMAC Operation</description>
          <addressOffset>0x438</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_FDBCK0">
          <name>CRYPTO_HMAC_FDBCK57</name>
          <displayName>CRYPTO_HMAC_FDBCK57</displayName>
          <description>SHA/HMAC Output Feedback Data 57 After SHA/HMAC Operation</description>
          <addressOffset>0x43C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_FDBCK0">
          <name>CRYPTO_HMAC_FDBCK58</name>
          <displayName>CRYPTO_HMAC_FDBCK58</displayName>
          <description>SHA/HMAC Output Feedback Data 58 After SHA/HMAC Operation</description>
          <addressOffset>0x440</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_FDBCK0">
          <name>CRYPTO_HMAC_FDBCK59</name>
          <displayName>CRYPTO_HMAC_FDBCK59</displayName>
          <description>SHA/HMAC Output Feedback Data 59 After SHA/HMAC Operation</description>
          <addressOffset>0x444</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_FDBCK0">
          <name>CRYPTO_HMAC_FDBCK60</name>
          <displayName>CRYPTO_HMAC_FDBCK60</displayName>
          <description>SHA/HMAC Output Feedback Data 60 After SHA/HMAC Operation</description>
          <addressOffset>0x448</addressOffset>
       </register>
