wosayttn/sdk-bsp-numaker-m55m1/Debug/svd/M55M1.svd
       <register derivedFrom="CRYPTO_HMAC_FDBCK0">
          <name>CRYPTO_HMAC_FDBCK61</name>
          <displayName>CRYPTO_HMAC_FDBCK61</displayName>
          <description>SHA/HMAC Output Feedback Data 61 After SHA/HMAC Operation</description>
          <addressOffset>0x44C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_FDBCK0">
          <name>CRYPTO_HMAC_FDBCK62</name>
          <displayName>CRYPTO_HMAC_FDBCK62</displayName>
          <description>SHA/HMAC Output Feedback Data 62 After SHA/HMAC Operation</description>
          <addressOffset>0x450</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_FDBCK0">
          <name>CRYPTO_HMAC_FDBCK63</name>
          <displayName>CRYPTO_HMAC_FDBCK63</displayName>
          <description>SHA/HMAC Output Feedback Data 63 After SHA/HMAC Operation</description>
          <addressOffset>0x454</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_FDBCK0">
          <name>CRYPTO_HMAC_FDBCK64</name>
          <displayName>CRYPTO_HMAC_FDBCK64</displayName>
          <description>SHA/HMAC Output Feedback Data 64 After SHA/HMAC Operation</description>
          <addressOffset>0x458</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_FDBCK0">
          <name>CRYPTO_HMAC_FDBCK65</name>
          <displayName>CRYPTO_HMAC_FDBCK65</displayName>
          <description>SHA/HMAC Output Feedback Data 65 After SHA/HMAC Operation</description>
          <addressOffset>0x45C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_FDBCK0">
          <name>CRYPTO_HMAC_FDBCK66</name>
          <displayName>CRYPTO_HMAC_FDBCK66</displayName>
          <description>SHA/HMAC Output Feedback Data 66 After SHA/HMAC Operation</description>
          <addressOffset>0x460</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_FDBCK0">
          <name>CRYPTO_HMAC_FDBCK67</name>
          <displayName>CRYPTO_HMAC_FDBCK67</displayName>
          <description>SHA/HMAC Output Feedback Data 67 After SHA/HMAC Operation</description>
          <addressOffset>0x464</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_FDBCK0">
          <name>CRYPTO_HMAC_FDBCK68</name>
          <displayName>CRYPTO_HMAC_FDBCK68</displayName>
          <description>SHA/HMAC Output Feedback Data 68 After SHA/HMAC Operation</description>
          <addressOffset>0x468</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_FDBCK0">
          <name>CRYPTO_HMAC_FDBCK69</name>
          <displayName>CRYPTO_HMAC_FDBCK69</displayName>
          <description>SHA/HMAC Output Feedback Data 69 After SHA/HMAC Operation</description>
          <addressOffset>0x46C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_FDBCK0">
          <name>CRYPTO_HMAC_FDBCK70</name>
          <displayName>CRYPTO_HMAC_FDBCK70</displayName>
          <description>SHA/HMAC Output Feedback Data 70 After SHA/HMAC Operation</description>
          <addressOffset>0x470</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_FDBCK0">
          <name>CRYPTO_HMAC_FDBCK71</name>
          <displayName>CRYPTO_HMAC_FDBCK71</displayName>
          <description>SHA/HMAC Output Feedback Data 71 After SHA/HMAC Operation</description>
          <addressOffset>0x474</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_FDBCK0">
          <name>CRYPTO_HMAC_FDBCK72</name>
          <displayName>CRYPTO_HMAC_FDBCK72</displayName>
          <description>SHA/HMAC Output Feedback Data 72 After SHA/HMAC Operation</description>
          <addressOffset>0x478</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_FDBCK0">
          <name>CRYPTO_HMAC_FDBCK73</name>
          <displayName>CRYPTO_HMAC_FDBCK73</displayName>
          <description>SHA/HMAC Output Feedback Data 73 After SHA/HMAC Operation</description>
          <addressOffset>0x47C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_FDBCK0">
          <name>CRYPTO_HMAC_FDBCK74</name>
          <displayName>CRYPTO_HMAC_FDBCK74</displayName>
          <description>SHA/HMAC Output Feedback Data 74 After SHA/HMAC Operation</description>
          <addressOffset>0x480</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_FDBCK0">
          <name>CRYPTO_HMAC_FDBCK75</name>
          <displayName>CRYPTO_HMAC_FDBCK75</displayName>
          <description>SHA/HMAC Output Feedback Data 75 After SHA/HMAC Operation</description>
          <addressOffset>0x484</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_FDBCK0">
          <name>CRYPTO_HMAC_FDBCK76</name>
          <displayName>CRYPTO_HMAC_FDBCK76</displayName>
          <description>SHA/HMAC Output Feedback Data 76 After SHA/HMAC Operation</description>
          <addressOffset>0x488</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_FDBCK0">
          <name>CRYPTO_HMAC_FDBCK77</name>
          <displayName>CRYPTO_HMAC_FDBCK77</displayName>
          <description>SHA/HMAC Output Feedback Data 77 After SHA/HMAC Operation</description>
          <addressOffset>0x48C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_FDBCK0">
          <name>CRYPTO_HMAC_FDBCK78</name>
          <displayName>CRYPTO_HMAC_FDBCK78</displayName>
          <description>SHA/HMAC Output Feedback Data 78 After SHA/HMAC Operation</description>
          <addressOffset>0x490</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_FDBCK0">
          <name>CRYPTO_HMAC_FDBCK79</name>
          <displayName>CRYPTO_HMAC_FDBCK79</displayName>
          <description>SHA/HMAC Output Feedback Data 79 After SHA/HMAC Operation</description>
          <addressOffset>0x494</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_FDBCK0">
          <name>CRYPTO_HMAC_FDBCK80</name>
          <displayName>CRYPTO_HMAC_FDBCK80</displayName>
          <description>SHA/HMAC Output Feedback Data 80 After SHA/HMAC Operation</description>
          <addressOffset>0x498</addressOffset>
       </register>
