wosayttn/sdk-bsp-numaker-m55m1/Debug/svd/M55M1.svd
       <register derivedFrom="CRYPTO_HMAC_SHAKEDGST0">
          <name>CRYPTO_HMAC_SHAKEDGST22</name>
          <displayName>CRYPTO_HMAC_SHAKEDGST22</displayName>
          <description>SHA/HMAC SHAKE Digest Message 22</description>
          <addressOffset>0x558</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_SHAKEDGST0">
          <name>CRYPTO_HMAC_SHAKEDGST23</name>
          <displayName>CRYPTO_HMAC_SHAKEDGST23</displayName>
          <description>SHA/HMAC SHAKE Digest Message 23</description>
          <addressOffset>0x55C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_SHAKEDGST0">
          <name>CRYPTO_HMAC_SHAKEDGST24</name>
          <displayName>CRYPTO_HMAC_SHAKEDGST24</displayName>
          <description>SHA/HMAC SHAKE Digest Message 24</description>
          <addressOffset>0x560</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_SHAKEDGST0">
          <name>CRYPTO_HMAC_SHAKEDGST25</name>
          <displayName>CRYPTO_HMAC_SHAKEDGST25</displayName>
          <description>SHA/HMAC SHAKE Digest Message 25</description>
          <addressOffset>0x564</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_SHAKEDGST0">
          <name>CRYPTO_HMAC_SHAKEDGST26</name>
          <displayName>CRYPTO_HMAC_SHAKEDGST26</displayName>
          <description>SHA/HMAC SHAKE Digest Message 26</description>
          <addressOffset>0x568</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_SHAKEDGST0">
          <name>CRYPTO_HMAC_SHAKEDGST27</name>
          <displayName>CRYPTO_HMAC_SHAKEDGST27</displayName>
          <description>SHA/HMAC SHAKE Digest Message 27</description>
          <addressOffset>0x56C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_SHAKEDGST0">
          <name>CRYPTO_HMAC_SHAKEDGST28</name>
          <displayName>CRYPTO_HMAC_SHAKEDGST28</displayName>
          <description>SHA/HMAC SHAKE Digest Message 28</description>
          <addressOffset>0x570</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_SHAKEDGST0">
          <name>CRYPTO_HMAC_SHAKEDGST29</name>
          <displayName>CRYPTO_HMAC_SHAKEDGST29</displayName>
          <description>SHA/HMAC SHAKE Digest Message 29</description>
          <addressOffset>0x574</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_SHAKEDGST0">
          <name>CRYPTO_HMAC_SHAKEDGST30</name>
          <displayName>CRYPTO_HMAC_SHAKEDGST30</displayName>
          <description>SHA/HMAC SHAKE Digest Message 30</description>
          <addressOffset>0x578</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_SHAKEDGST0">
          <name>CRYPTO_HMAC_SHAKEDGST31</name>
          <displayName>CRYPTO_HMAC_SHAKEDGST31</displayName>
          <description>SHA/HMAC SHAKE Digest Message 31</description>
          <addressOffset>0x57C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_SHAKEDGST0">
          <name>CRYPTO_HMAC_SHAKEDGST32</name>
          <displayName>CRYPTO_HMAC_SHAKEDGST32</displayName>
          <description>SHA/HMAC SHAKE Digest Message 32</description>
          <addressOffset>0x580</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_SHAKEDGST0">
          <name>CRYPTO_HMAC_SHAKEDGST33</name>
          <displayName>CRYPTO_HMAC_SHAKEDGST33</displayName>
          <description>SHA/HMAC SHAKE Digest Message 33</description>
          <addressOffset>0x584</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_SHAKEDGST0">
          <name>CRYPTO_HMAC_SHAKEDGST34</name>
          <displayName>CRYPTO_HMAC_SHAKEDGST34</displayName>
          <description>SHA/HMAC SHAKE Digest Message 34</description>
          <addressOffset>0x588</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_SHAKEDGST0">
          <name>CRYPTO_HMAC_SHAKEDGST35</name>
          <displayName>CRYPTO_HMAC_SHAKEDGST35</displayName>
          <description>SHA/HMAC SHAKE Digest Message 35</description>
          <addressOffset>0x58C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_SHAKEDGST0">
          <name>CRYPTO_HMAC_SHAKEDGST36</name>
          <displayName>CRYPTO_HMAC_SHAKEDGST36</displayName>
          <description>SHA/HMAC SHAKE Digest Message 36</description>
          <addressOffset>0x590</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_SHAKEDGST0">
          <name>CRYPTO_HMAC_SHAKEDGST37</name>
          <displayName>CRYPTO_HMAC_SHAKEDGST37</displayName>
          <description>SHA/HMAC SHAKE Digest Message 37</description>
          <addressOffset>0x594</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_SHAKEDGST0">
          <name>CRYPTO_HMAC_SHAKEDGST38</name>
          <displayName>CRYPTO_HMAC_SHAKEDGST38</displayName>
          <description>SHA/HMAC SHAKE Digest Message 38</description>
          <addressOffset>0x598</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_SHAKEDGST0">
          <name>CRYPTO_HMAC_SHAKEDGST39</name>
          <displayName>CRYPTO_HMAC_SHAKEDGST39</displayName>
          <description>SHA/HMAC SHAKE Digest Message 39</description>
          <addressOffset>0x59C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_SHAKEDGST0">
          <name>CRYPTO_HMAC_SHAKEDGST40</name>
          <displayName>CRYPTO_HMAC_SHAKEDGST40</displayName>
          <description>SHA/HMAC SHAKE Digest Message 40</description>
          <addressOffset>0x5A0</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_SHAKEDGST0">
          <name>CRYPTO_HMAC_SHAKEDGST41</name>
          <displayName>CRYPTO_HMAC_SHAKEDGST41</displayName>
          <description>SHA/HMAC SHAKE Digest Message 41</description>
          <addressOffset>0x5A4</addressOffset>
       </register>
       <register>
          <name>CRYPTO_ECC_CTL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_ECC_CTL</displayName>
          <description>ECC Control Register</description>
          <addressOffset>0x800</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>START</name>
              <description>ECC Accelerator Start\nThis bit is always 0 when it is read back.\nECC accelerator will ignore this START signal when BUSY flag is 1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No effect</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Start ECC accelerator. BUSY flag will be set</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>STOP</name>
              <description>ECC Accelerator Stop\nThis bit is always 0 when it is read back.\nRemember to clear ECC interrupt flag after stopping ECC accelerator.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No effect</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Abort ECC accelerator and make it into idle state</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SMOD</name>
              <description>Special Modulus Operation in Prime Field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Normal modulus operation</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Special modulus operation</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>ECDSAS</name>
              <description>Generate S in ECDSA Signature Generation</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No effect</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Formula for generating S</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>ECDSAR</name>
              <description>Generate R in ECDSA Signature Generation</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No effect</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Formula for generating R</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>DFAP</name>
              <description>Differential Fault Attack Protection</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>ECC engine differential fault attack protection Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>ECC engine differential fault attack protection Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>DMAEN</name>
              <description>ECC Accelerator DMA Enable Bit\nOnly when START and DMAEN are 1, ECC DMA engine will be active.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>ECC DMA engine Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>ECC DMA engine Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>FSEL</name>
              <description>Field Selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Binary Field (GF(2m ))</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Prime Field (GF(p))</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>ECCOP</name>
              <description>Point Operation for BF and PF\nBesides above three input data, point operations still need the parameters of elliptic curve (CURVEA, CURVEB, CURVEN and CURVEM) as shown in Figure 6.27-11.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Point multiplication:</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Modulus operation: choose by MODOP (CRYPTO_ECC_CTL[12:11])</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>Point addition:</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Point doubling:</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>MODOP</name>
              <description>Modulus Operation for PF\nWhen SMOD is 0,</description>
              <bitOffset>11</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Division:.\nModulo:</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Multiplication:.\nExponential:</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>Addition:.\nSquare root:</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Subtraction:</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SPCEN</name>
              <description>Special Curve Enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>NIST suggested or SM2 curve</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Montgomery curve or Edwards curve</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SCAP</name>
              <description>Side-channel Attack Protection</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Full speed without side-channel protection</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Less speed with side-channel protection</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SPCSEL</name>
              <description>Special Curve Selection</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Montgomery curve when SPCEN is 1</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Edwards curve when SPCEN is 1.\nSM2 curve when SPCEN is 0</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>CURVEM</name>
              <description>The key length of elliptic curve.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CRYPTO_ECC_STS</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_ECC_STS</displayName>
          <description>ECC Status Register</description>
          <addressOffset>0x804</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BUSY</name>
              <description>ECC Accelerator Busy Flag\nNote: Remember to clear ECC interrupt flag after ECC accelerator is finished</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>The ECC accelerator is idle or finished</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The ECC accelerator is under processing and protects all registers</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>DMABUSY</name>
              <description>ECC DMA Busy Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>ECC DMA is idle or finished</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>ECC DMA is busy</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>BUSERR</name>
              <description>ECC DMA Access Bus Error Flag</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No error</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Bus error will stop DMA operation and ECC accelerator</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>KSERR</name>
              <description>ECC Engine Access Key Store Error Flag</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No error</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Access error will stop ECC engine</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>DFAERR</name>
              <description>ECC Engine Differential Fault Attack Error Flag</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No error</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Differential Fault Attack happened in ECC engine. The results from ECC engine are incorrect</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
          </fields>
       </register>
