wosayttn/sdk-bsp-numaker-m55m1/Debug/svd/M55M1.svd
       <register>
          <name>CRYPTO_ECC_X1_00</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_ECC_X1_00</displayName>
          <description>ECC the X-coordinate Word0 of the First Point</description>
          <addressOffset>0x808</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>POINTX1</name>
              <description>ECC the X-coordinate Value of the First Point \nFor B-163 or K-163, POINTX1 is stored in CRYPTO_ECC_X1_00~CRYPTO_ECC_X1_05\nFor B-233 or K-233, POINTX1 is stored in CRYPTO_ECC_X1_00~CRYPTO_ECC_X1_07\nFor B-283 or K-283, POINTX1 is stored in CRYPTO_ECC_X1_00~CRYPTO_ECC_X1_08\nFor B-409 or K-409, POINTX1 is stored in CRYPTO_ECC_X1_00~CRYPTO_ECC_X1_12\nFor B-571 or K-571, POINTX1 is stored in CRYPTO_ECC_X1_00~CRYPTO_ECC_X1_17\nFor P-192, POINTX1 is stored in CRYPTO_ECC_X1_00~CRYPTO_ECC_X1_05\nFor P-224, POINTX1 is stored in CRYPTO_ECC_X1_00~CRYPTO_ECC_X1_06\nFor P-256 or SM2, POINTX1 is stored in CRYPTO_ECC_X1_00~CRYPTO_ECC_X1_07\nFor P-384, POINTX1 is stored in CRYPTO_ECC_X1_00~CRYPTO_ECC_X1_11\nFor P-521, POINTX1 is stored in CRYPTO_ECC_X1_00~CRYPTO_ECC_X1_16</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="CRYPTO_ECC_X1_00">
          <name>CRYPTO_ECC_X1_01</name>
          <displayName>CRYPTO_ECC_X1_01</displayName>
          <description>ECC the X-coordinate Word1 of the First Point</description>
          <addressOffset>0x80C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X1_00">
          <name>CRYPTO_ECC_X1_02</name>
          <displayName>CRYPTO_ECC_X1_02</displayName>
          <description>ECC the X-coordinate Word2 of the First Point</description>
          <addressOffset>0x810</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X1_00">
          <name>CRYPTO_ECC_X1_03</name>
          <displayName>CRYPTO_ECC_X1_03</displayName>
          <description>ECC the X-coordinate Word3 of the First Point</description>
          <addressOffset>0x814</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X1_00">
          <name>CRYPTO_ECC_X1_04</name>
          <displayName>CRYPTO_ECC_X1_04</displayName>
          <description>ECC the X-coordinate Word4 of the First Point</description>
          <addressOffset>0x818</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X1_00">
          <name>CRYPTO_ECC_X1_05</name>
          <displayName>CRYPTO_ECC_X1_05</displayName>
          <description>ECC the X-coordinate Word5 of the First Point</description>
          <addressOffset>0x81C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X1_00">
          <name>CRYPTO_ECC_X1_06</name>
          <displayName>CRYPTO_ECC_X1_06</displayName>
          <description>ECC the X-coordinate Word6 of the First Point</description>
          <addressOffset>0x820</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X1_00">
          <name>CRYPTO_ECC_X1_07</name>
          <displayName>CRYPTO_ECC_X1_07</displayName>
          <description>ECC the X-coordinate Word7 of the First Point</description>
          <addressOffset>0x824</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X1_00">
          <name>CRYPTO_ECC_X1_08</name>
          <displayName>CRYPTO_ECC_X1_08</displayName>
          <description>ECC the X-coordinate Word8 of the First Point</description>
          <addressOffset>0x828</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X1_00">
          <name>CRYPTO_ECC_X1_09</name>
          <displayName>CRYPTO_ECC_X1_09</displayName>
          <description>ECC the X-coordinate Word9 of the First Point</description>
          <addressOffset>0x82C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X1_00">
          <name>CRYPTO_ECC_X1_10</name>
          <displayName>CRYPTO_ECC_X1_10</displayName>
          <description>ECC the X-coordinate Word10 of the First Point</description>
          <addressOffset>0x830</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X1_00">
          <name>CRYPTO_ECC_X1_11</name>
          <displayName>CRYPTO_ECC_X1_11</displayName>
          <description>ECC the X-coordinate Word11 of the First Point</description>
          <addressOffset>0x834</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X1_00">
          <name>CRYPTO_ECC_X1_12</name>
          <displayName>CRYPTO_ECC_X1_12</displayName>
          <description>ECC the X-coordinate Word12 of the First Point</description>
          <addressOffset>0x838</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X1_00">
          <name>CRYPTO_ECC_X1_13</name>
          <displayName>CRYPTO_ECC_X1_13</displayName>
          <description>ECC the X-coordinate Word13 of the First Point</description>
          <addressOffset>0x83C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X1_00">
          <name>CRYPTO_ECC_X1_14</name>
          <displayName>CRYPTO_ECC_X1_14</displayName>
          <description>ECC the X-coordinate Word14 of the First Point</description>
          <addressOffset>0x840</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X1_00">
          <name>CRYPTO_ECC_X1_15</name>
          <displayName>CRYPTO_ECC_X1_15</displayName>
          <description>ECC the X-coordinate Word15 of the First Point</description>
          <addressOffset>0x844</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X1_00">
          <name>CRYPTO_ECC_X1_16</name>
          <displayName>CRYPTO_ECC_X1_16</displayName>
          <description>ECC the X-coordinate Word16 of the First Point</description>
          <addressOffset>0x848</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X1_00">
          <name>CRYPTO_ECC_X1_17</name>
          <displayName>CRYPTO_ECC_X1_17</displayName>
          <description>ECC the X-coordinate Word17 of the First Point</description>
          <addressOffset>0x84C</addressOffset>
       </register>
       <register>
          <name>CRYPTO_ECC_Y1_00</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_ECC_Y1_00</displayName>
          <description>ECC the Y-coordinate Word0 of the First Point</description>
          <addressOffset>0x850</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>POINTY1</name>
              <description>ECC the Y-coordinate Value of the First Point \nFor B-163 or K-163, POINTY1 is stored in CRYPTO_ECC_Y1_00~CRYPTO_ECC_Y1_05\nFor B-233 or K-233, POINTY1 is stored in CRYPTO_ECC_Y1_00~CRYPTO_ECC_Y1_07\nFor B-283 or K-283, POINTY1 is stored in CRYPTO_ECC_Y1_00~CRYPTO_ECC_Y1_08\nFor B-409 or K-409, POINTY1 is stored in CRYPTO_ECC_Y1_00~CRYPTO_ECC_Y1_12\nFor B-571 or K-571, POINTY1 is stored in CRYPTO_ECC_Y1_00~CRYPTO_ECC_Y1_17\nFor P-192, POINTY1 is stored in CRYPTO_ECC_Y1_00~CRYPTO_ECC_Y1_05\nFor P-224, POINTY1 is stored in CRYPTO_ECC_Y1_00~CRYPTO_ECC_Y1_06\nFor P-256 or SM2, POINTY1 is stored in CRYPTO_ECC_Y1_00~CRYPTO_ECC_Y1_07\nFor P-384, POINTY1 is stored in CRYPTO_ECC_Y1_00~CRYPTO_ECC_Y1_11\nFor P-521, POINTY1 is stored in CRYPTO_ECC_Y1_00~CRYPTO_ECC_Y1_16</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y1_00">
          <name>CRYPTO_ECC_Y1_01</name>
          <displayName>CRYPTO_ECC_Y1_01</displayName>
          <description>ECC the Y-coordinate Word1 of the First Point</description>
          <addressOffset>0x854</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y1_00">
          <name>CRYPTO_ECC_Y1_02</name>
          <displayName>CRYPTO_ECC_Y1_02</displayName>
          <description>ECC the Y-coordinate Word2 of the First Point</description>
          <addressOffset>0x858</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y1_00">
          <name>CRYPTO_ECC_Y1_03</name>
          <displayName>CRYPTO_ECC_Y1_03</displayName>
          <description>ECC the Y-coordinate Word3 of the First Point</description>
          <addressOffset>0x85C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y1_00">
          <name>CRYPTO_ECC_Y1_04</name>
          <displayName>CRYPTO_ECC_Y1_04</displayName>
          <description>ECC the Y-coordinate Word4 of the First Point</description>
          <addressOffset>0x860</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y1_00">
          <name>CRYPTO_ECC_Y1_05</name>
          <displayName>CRYPTO_ECC_Y1_05</displayName>
          <description>ECC the Y-coordinate Word5 of the First Point</description>
          <addressOffset>0x864</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y1_00">
          <name>CRYPTO_ECC_Y1_06</name>
          <displayName>CRYPTO_ECC_Y1_06</displayName>
          <description>ECC the Y-coordinate Word6 of the First Point</description>
          <addressOffset>0x868</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y1_00">
          <name>CRYPTO_ECC_Y1_07</name>
          <displayName>CRYPTO_ECC_Y1_07</displayName>
          <description>ECC the Y-coordinate Word7 of the First Point</description>
          <addressOffset>0x86C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y1_00">
          <name>CRYPTO_ECC_Y1_08</name>
          <displayName>CRYPTO_ECC_Y1_08</displayName>
          <description>ECC the Y-coordinate Word8 of the First Point</description>
          <addressOffset>0x870</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y1_00">
          <name>CRYPTO_ECC_Y1_09</name>
          <displayName>CRYPTO_ECC_Y1_09</displayName>
          <description>ECC the Y-coordinate Word9 of the First Point</description>
          <addressOffset>0x874</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y1_00">
          <name>CRYPTO_ECC_Y1_10</name>
          <displayName>CRYPTO_ECC_Y1_10</displayName>
          <description>ECC the Y-coordinate Word10 of the First Point</description>
          <addressOffset>0x878</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y1_00">
          <name>CRYPTO_ECC_Y1_11</name>
          <displayName>CRYPTO_ECC_Y1_11</displayName>
          <description>ECC the Y-coordinate Word11 of the First Point</description>
          <addressOffset>0x87C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y1_00">
          <name>CRYPTO_ECC_Y1_12</name>
          <displayName>CRYPTO_ECC_Y1_12</displayName>
          <description>ECC the Y-coordinate Word12 of the First Point</description>
          <addressOffset>0x880</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y1_00">
          <name>CRYPTO_ECC_Y1_13</name>
          <displayName>CRYPTO_ECC_Y1_13</displayName>
          <description>ECC the Y-coordinate Word13 of the First Point</description>
          <addressOffset>0x884</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y1_00">
          <name>CRYPTO_ECC_Y1_14</name>
          <displayName>CRYPTO_ECC_Y1_14</displayName>
          <description>ECC the Y-coordinate Word14 of the First Point</description>
          <addressOffset>0x888</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y1_00">
          <name>CRYPTO_ECC_Y1_15</name>
          <displayName>CRYPTO_ECC_Y1_15</displayName>
          <description>ECC the Y-coordinate Word15 of the First Point</description>
          <addressOffset>0x88C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y1_00">
          <name>CRYPTO_ECC_Y1_16</name>
          <displayName>CRYPTO_ECC_Y1_16</displayName>
          <description>ECC the Y-coordinate Word16 of the First Point</description>
          <addressOffset>0x890</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y1_00">
          <name>CRYPTO_ECC_Y1_17</name>
          <displayName>CRYPTO_ECC_Y1_17</displayName>
          <description>ECC the Y-coordinate Word17 of the First Point</description>
          <addressOffset>0x894</addressOffset>
       </register>
       <register>
          <name>CRYPTO_ECC_X2_00</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_ECC_X2_00</displayName>
          <description>ECC the X-coordinate Word0 of the Second Point</description>
          <addressOffset>0x898</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>POINTX2</name>
              <description>ECC the X-coordinate Value of the Second Point \nFor B-163 or K-163, POINTX2 is stored in CRYPTO_ECC_X2_00~CRYPTO_ECC_X2_05\nFor B-233 or K-233, POINTX2 is stored in CRYPTO_ECC_X2_00~CRYPTO_ECC_X2_07\nFor B-283 or K-283, POINTX2 is stored in CRYPTO_ECC_X2_00~CRYPTO_ECC_X2_08\nFor B-409 or K-409, POINTX2 is stored in CRYPTO_ECC_X2_00~CRYPTO_ECC_X2_12\nFor B-571 or K-571, POINTX2 is stored in CRYPTO_ECC_X2_00~CRYPTO_ECC_X2_17\nFor P-192, POINTX2 is stored in CRYPTO_ECC_X2_00~CRYPTO_ECC_X2_05\nFor P-224, POINTX2 is stored in CRYPTO_ECC_X2_00~CRYPTO_ECC_X2_06\nFor P-256 or SM2, POINTX2 is stored in CRYPTO_ECC_X2_00~CRYPTO_ECC_X2_07\nFor P-384, POINTX2 is stored in CRYPTO_ECC_X2_00~CRYPTO_ECC_X2_11\nFor P-521, POINTX2 is stored in CRYPTO_ECC_X2_00~CRYPTO_ECC_X2_16</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="CRYPTO_ECC_X2_00">
          <name>CRYPTO_ECC_X2_01</name>
          <displayName>CRYPTO_ECC_X2_01</displayName>
          <description>ECC the X-coordinate Word1 of the Second Point</description>
          <addressOffset>0x89C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X2_00">
          <name>CRYPTO_ECC_X2_02</name>
          <displayName>CRYPTO_ECC_X2_02</displayName>
          <description>ECC the X-coordinate Word2 of the Second Point</description>
          <addressOffset>0x8A0</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X2_00">
          <name>CRYPTO_ECC_X2_03</name>
          <displayName>CRYPTO_ECC_X2_03</displayName>
          <description>ECC the X-coordinate Word3 of the Second Point</description>
          <addressOffset>0x8A4</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X2_00">
          <name>CRYPTO_ECC_X2_04</name>
          <displayName>CRYPTO_ECC_X2_04</displayName>
          <description>ECC the X-coordinate Word4 of the Second Point</description>
          <addressOffset>0x8A8</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X2_00">
          <name>CRYPTO_ECC_X2_05</name>
          <displayName>CRYPTO_ECC_X2_05</displayName>
          <description>ECC the X-coordinate Word5 of the Second Point</description>
          <addressOffset>0x8AC</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X2_00">
          <name>CRYPTO_ECC_X2_06</name>
          <displayName>CRYPTO_ECC_X2_06</displayName>
          <description>ECC the X-coordinate Word6 of the Second Point</description>
          <addressOffset>0x8B0</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X2_00">
          <name>CRYPTO_ECC_X2_07</name>
          <displayName>CRYPTO_ECC_X2_07</displayName>
          <description>ECC the X-coordinate Word7 of the Second Point</description>
          <addressOffset>0x8B4</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X2_00">
          <name>CRYPTO_ECC_X2_08</name>
          <displayName>CRYPTO_ECC_X2_08</displayName>
          <description>ECC the X-coordinate Word8 of the Second Point</description>
          <addressOffset>0x8B8</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X2_00">
          <name>CRYPTO_ECC_X2_09</name>
          <displayName>CRYPTO_ECC_X2_09</displayName>
          <description>ECC the X-coordinate Word9 of the Second Point</description>
          <addressOffset>0x8BC</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X2_00">
          <name>CRYPTO_ECC_X2_10</name>
          <displayName>CRYPTO_ECC_X2_10</displayName>
          <description>ECC the X-coordinate Word10 of the Second Point</description>
          <addressOffset>0x8C0</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X2_00">
          <name>CRYPTO_ECC_X2_11</name>
          <displayName>CRYPTO_ECC_X2_11</displayName>
          <description>ECC the X-coordinate Word11 of the Second Point</description>
          <addressOffset>0x8C4</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X2_00">
          <name>CRYPTO_ECC_X2_12</name>
          <displayName>CRYPTO_ECC_X2_12</displayName>
          <description>ECC the X-coordinate Word12 of the Second Point</description>
          <addressOffset>0x8C8</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X2_00">
          <name>CRYPTO_ECC_X2_13</name>
          <displayName>CRYPTO_ECC_X2_13</displayName>
          <description>ECC the X-coordinate Word13 of the Second Point</description>
          <addressOffset>0x8CC</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X2_00">
          <name>CRYPTO_ECC_X2_14</name>
          <displayName>CRYPTO_ECC_X2_14</displayName>
          <description>ECC the X-coordinate Word14 of the Second Point</description>
          <addressOffset>0x8D0</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X2_00">
          <name>CRYPTO_ECC_X2_15</name>
          <displayName>CRYPTO_ECC_X2_15</displayName>
          <description>ECC the X-coordinate Word15 of the Second Point</description>
          <addressOffset>0x8D4</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X2_00">
          <name>CRYPTO_ECC_X2_16</name>
          <displayName>CRYPTO_ECC_X2_16</displayName>
          <description>ECC the X-coordinate Word16 of the Second Point</description>
          <addressOffset>0x8D8</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X2_00">
          <name>CRYPTO_ECC_X2_17</name>
          <displayName>CRYPTO_ECC_X2_17</displayName>
          <description>ECC the X-coordinate Word17 of the Second Point</description>
          <addressOffset>0x8DC</addressOffset>
       </register>
       <register>
          <name>CRYPTO_ECC_Y2_00</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_ECC_Y2_00</displayName>
          <description>ECC the Y-coordinate Word0 of the Second Point</description>
          <addressOffset>0x8E0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>POINTY2</name>
              <description>ECC the Y-coordinate Value of the Second Point \nFor B-163 or K-163, POINTY2 is stored in CRYPTO_ECC_Y2_00~CRYPTO_ECC_Y2_05\nFor B-233 or K-233, POINTY2 is stored in CRYPTO_ECC_Y2_00~CRYPTO_ECC_Y2_07\nFor B-283 or K-283, POINTY2 is stored in CRYPTO_ECC_Y2_00~CRYPTO_ECC_Y2_08\nFor B-409 or K-409, POINTY2 is stored in CRYPTO_ECC_Y2_00~CRYPTO_ECC_Y2_12\nFor B-571 or K-571, POINTY2 is stored in CRYPTO_ECC_Y2_00~CRYPTO_ECC_Y2_17\nFor P-192, POINTY2 is stored in CRYPTO_ECC_Y2_00~CRYPTO_ECC_Y2_05\nFor P-224, POINTY2 is stored in CRYPTO_ECC_Y2_00~CRYPTO_ECC_Y2_06\nFor P-256 or SM2, POINTY2 is stored in CRYPTO_ECC_Y2_00~CRYPTO_ECC_Y2_07\nFor P-384, POINTY2 is stored in CRYPTO_ECC_Y2_00~CRYPTO_ECC_Y2_11\nFor P-521, POINTY2 is stored in CRYPTO_ECC_Y2_00~CRYPTO_ECC_Y2_16</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y2_00">
          <name>CRYPTO_ECC_Y2_01</name>
          <displayName>CRYPTO_ECC_Y2_01</displayName>
          <description>ECC the Y-coordinate Word1 of the Second Point</description>
          <addressOffset>0x8E4</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y2_00">
          <name>CRYPTO_ECC_Y2_02</name>
          <displayName>CRYPTO_ECC_Y2_02</displayName>
          <description>ECC the Y-coordinate Word2 of the Second Point</description>
          <addressOffset>0x8E8</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y2_00">
          <name>CRYPTO_ECC_Y2_03</name>
          <displayName>CRYPTO_ECC_Y2_03</displayName>
          <description>ECC the Y-coordinate Word3 of the Second Point</description>
          <addressOffset>0x8EC</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y2_00">
          <name>CRYPTO_ECC_Y2_04</name>
          <displayName>CRYPTO_ECC_Y2_04</displayName>
          <description>ECC the Y-coordinate Word4 of the Second Point</description>
          <addressOffset>0x8F0</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y2_00">
          <name>CRYPTO_ECC_Y2_05</name>
          <displayName>CRYPTO_ECC_Y2_05</displayName>
          <description>ECC the Y-coordinate Word5 of the Second Point</description>
          <addressOffset>0x8F4</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y2_00">
          <name>CRYPTO_ECC_Y2_06</name>
          <displayName>CRYPTO_ECC_Y2_06</displayName>
          <description>ECC the Y-coordinate Word6 of the Second Point</description>
          <addressOffset>0x8F8</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y2_00">
          <name>CRYPTO_ECC_Y2_07</name>
          <displayName>CRYPTO_ECC_Y2_07</displayName>
          <description>ECC the Y-coordinate Word7 of the Second Point</description>
          <addressOffset>0x8FC</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y2_00">
          <name>CRYPTO_ECC_Y2_08</name>
          <displayName>CRYPTO_ECC_Y2_08</displayName>
          <description>ECC the Y-coordinate Word8 of the Second Point</description>
          <addressOffset>0x900</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y2_00">
          <name>CRYPTO_ECC_Y2_09</name>
          <displayName>CRYPTO_ECC_Y2_09</displayName>
          <description>ECC the Y-coordinate Word9 of the Second Point</description>
          <addressOffset>0x904</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y2_00">
          <name>CRYPTO_ECC_Y2_10</name>
          <displayName>CRYPTO_ECC_Y2_10</displayName>
          <description>ECC the Y-coordinate Word10 of the Second Point</description>
          <addressOffset>0x908</addressOffset>
       </register>
