wosayttn/sdk-bsp-numaker-m55m1/Debug/svd/M55M1.svd
       <register derivedFrom="CRYPTO_ECC_K_00">
          <name>CRYPTO_ECC_K_04</name>
          <displayName>CRYPTO_ECC_K_04</displayName>
          <description>ECC the Scalar SCALARK Word4 of Point Multiplication</description>
          <addressOffset>0xA10</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_K_00">
          <name>CRYPTO_ECC_K_05</name>
          <displayName>CRYPTO_ECC_K_05</displayName>
          <description>ECC the Scalar SCALARK Word5 of Point Multiplication</description>
          <addressOffset>0xA14</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_K_00">
          <name>CRYPTO_ECC_K_06</name>
          <displayName>CRYPTO_ECC_K_06</displayName>
          <description>ECC the Scalar SCALARK Word6 of Point Multiplication</description>
          <addressOffset>0xA18</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_K_00">
          <name>CRYPTO_ECC_K_07</name>
          <displayName>CRYPTO_ECC_K_07</displayName>
          <description>ECC the Scalar SCALARK Word7 of Point Multiplication</description>
          <addressOffset>0xA1C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_K_00">
          <name>CRYPTO_ECC_K_08</name>
          <displayName>CRYPTO_ECC_K_08</displayName>
          <description>ECC the Scalar SCALARK Word8 of Point Multiplication</description>
          <addressOffset>0xA20</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_K_00">
          <name>CRYPTO_ECC_K_09</name>
          <displayName>CRYPTO_ECC_K_09</displayName>
          <description>ECC the Scalar SCALARK Word9 of Point Multiplication</description>
          <addressOffset>0xA24</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_K_00">
          <name>CRYPTO_ECC_K_10</name>
          <displayName>CRYPTO_ECC_K_10</displayName>
          <description>ECC the Scalar SCALARK Word10 of Point Multiplication</description>
          <addressOffset>0xA28</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_K_00">
          <name>CRYPTO_ECC_K_11</name>
          <displayName>CRYPTO_ECC_K_11</displayName>
          <description>ECC the Scalar SCALARK Word11 of Point Multiplication</description>
          <addressOffset>0xA2C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_K_00">
          <name>CRYPTO_ECC_K_12</name>
          <displayName>CRYPTO_ECC_K_12</displayName>
          <description>ECC the Scalar SCALARK Word12 of Point Multiplication</description>
          <addressOffset>0xA30</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_K_00">
          <name>CRYPTO_ECC_K_13</name>
          <displayName>CRYPTO_ECC_K_13</displayName>
          <description>ECC the Scalar SCALARK Word13 of Point Multiplication</description>
          <addressOffset>0xA34</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_K_00">
          <name>CRYPTO_ECC_K_14</name>
          <displayName>CRYPTO_ECC_K_14</displayName>
          <description>ECC the Scalar SCALARK Word14 of Point Multiplication</description>
          <addressOffset>0xA38</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_K_00">
          <name>CRYPTO_ECC_K_15</name>
          <displayName>CRYPTO_ECC_K_15</displayName>
          <description>ECC the Scalar SCALARK Word15 of Point Multiplication</description>
          <addressOffset>0xA3C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_K_00">
          <name>CRYPTO_ECC_K_16</name>
          <displayName>CRYPTO_ECC_K_16</displayName>
          <description>ECC the Scalar SCALARK Word16 of Point Multiplication</description>
          <addressOffset>0xA40</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_K_00">
          <name>CRYPTO_ECC_K_17</name>
          <displayName>CRYPTO_ECC_K_17</displayName>
          <description>ECC the Scalar SCALARK Word17 of Point Multiplication</description>
          <addressOffset>0xA44</addressOffset>
       </register>
       <register>
          <name>CRYPTO_ECC_SADDR</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_ECC_SADDR</displayName>
          <description>ECC DMA Source Address Register</description>
          <addressOffset>0xA48</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
          </fields>
       </register>
       <register>
          <name>CRYPTO_ECC_DADDR</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_ECC_DADDR</displayName>
          <description>ECC DMA Destination Address Register</description>
          <addressOffset>0xA4C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DADDR</name>
              <description>ECC DMA Destination Address \nThe ECC accelerator supports DMA function to transfer the DATA and PARAMETER between SRAM memory and ECC accelerator. The DADDR keeps the destination address of the data buffer where output data of ECC engine will be stored. Based on the destination address, the ECC accelerator can write the result data back to SRAM memory space after the ECC operation is finished. The start of destination address should be located at word boundary. That is, bit 1 and 0 of DADDR are ignored. DADDR can be read and written. In DMA mode, software must update the CRYPTO_ECC_DADDR before triggering START.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CRYPTO_ECC_STARTREG</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_ECC_STARTREG</displayName>
          <description>ECC Starting Address of Updated Registers</description>
          <addressOffset>0xA50</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STARTREG</name>
              <description>ECC Starting Address of Updated Registers\nThe address of the updated registers that DMA feeds the first data or parameter to ECC engine. When ECC engine is active, ECC accelerator does not allow users to modify STARTRE.G. For example, to update input data from register CRYPTO_ECC POINTX1. Thus, the value of STARTREG is 0x808.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CRYPTO_ECC_WORDCNT</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_ECC_WORDCNT</displayName>
          <description>ECC DMA Word Count</description>
          <addressOffset>0xA54</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WORDCNT</name>
              <description>ECC DMA Word Count \nThe CRYPTO_ECC_WORDCNT keeps the word count of source data that is for the required input data of ECC accelerator with various operations in DMA mode. Although CRYPTO_ECC_WORDCNT is 32-bit, the maximum of word count in ECC accelerator is 144 words. CRYPTO_ECC_WORDCNT can be read and written.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CRYPTO_ECC_DMA_CTL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_ECC_DMA_CTL</displayName>
          <description>ECC DMA Control Register</description>
          <addressOffset>0xA58</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LDP1</name>
              <description>The Control Signal of Register POINTX1 and POINTY1 for the x and Y Coordinate of the First Point </description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>The register for POINTX1 and POINTY1 is not modified by DMA or user</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The register for POINTX1 and POINTY1 is modified by DMA or user</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>LDP2</name>
              <description>The Control Signal of Register POINTX2 and POINTY2 for the x and Y Coordinate of the Second Point</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>The register for POINTX2 and POINTY2 is not modified by DMA or user</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The register for POINTX2 and POINTY2 is modified by DMA or user</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>LDA</name>
              <description>The Control Signal of Register for the Parameter CURVEA of Elliptic Curve</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>The register for CURVEA is not modified by DMA or user</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The register for CURVEA is modified by DMA or user</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>LDB</name>
              <description>The Control Signal of Register for the Parameter CURVEB of Elliptic Curve </description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>The register for CURVEB is not modified by DMA or user</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The register for CURVEB is modified by DMA or user</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>LDN</name>
              <description>The Control Signal of Register for the Parameter CURVEN of Elliptic Curve </description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>The register for CURVEN is not modified by DMA or user</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The register for CURVEN is modified by DMA or user</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>LDK</name>
              <description>The Control Signal of Register for SCALARK </description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>The register for SCALARK is not modified by DMA or user</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The register for SCALARK is modified by DMA or user</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CRYPTO_RSA_CTL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_RSA_CTL</displayName>
          <description>RSA Control Register</description>
          <addressOffset>0xB00</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>START</name>
              <description>RSA Accelerator Start\nThis bit is always 0 when it is read back.\nRSA accelerator will ignore this START signal when BUSY flag is 1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No effect</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Start RSA accelerator. BUSY flag will be set</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>STOP</name>
              <description>RSA Accelerator Stop\nThis bit is always 0 when it is read back.\nRemember to clear RSA interrupt flag after stopping RSA accelerator.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No effect</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Abort RSA accelerator and make it into initial state</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>CRT</name>
              <description>CRT Enable Control\nCRT is only used in decryption with key length 2048, 3072,4096 bits.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>CRT Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>CRT Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>CRTBYP</name>
              <description>CRT Bypass Enable Control\nCRT bypass is only used in CRT decryption with the same key.\nCRT mode saved the data when the first time CRT decryption (CRTBYP is 0), then users can use these already known data to bypass some operation when the second time to the latest time CRT decryption (CRTBYP is 1) for improve performance.\nNote: Users cannot set CRTBYP to 1 in non-CRT mode (CRT (CRYPTO_RSA_CTL[2]) is 0).</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>CRT Bypass Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>CRT Bypass Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>KEYLENG</name>
              <description>The Key Length of RSA Operation</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>1024-bits</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>2048-bits</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>3072-bits</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>4096-bits</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SCAP</name>
              <description>Side Channel Attack Protection Enable Control</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Side Channel Attack Protection Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Side Channel Attack Protection Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
