wosayttn/sdk-bsp-numaker-m55m1/Debug/svd/M55M1.svd
       <register>
          <name>CRYPTO_RSA_STS</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_RSA_STS</displayName>
          <description>RSA Status Register</description>
          <addressOffset>0xB04</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BUSY</name>
              <description>RSA Accelerator Busy Flag\nRemember to clear RSA interrupt flag after RSA accelerator finished.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>The RSA accelerator is idle or finished</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The RSA accelerator is under processing and protects all registers</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>DMABUSY</name>
              <description>RSA DMA Busy Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>RSA DMA is idle or finished</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>RSA DMA is busy</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>BUSERR</name>
              <description>RSA DMA Access Bus Error Flag</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No error</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Bus error will stop DMA operation and RSA accelerator</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>CTLERR</name>
              <description>RSA Control Register Error Flag\nNote: If users use the error combination of control, even though they don't set START(CRYPTO_RSA_CTL[0]) to 1, CTLERR still be set to 1.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No error</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>RSA control error. RSA will not start in the unsupported situation</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>KSERR</name>
              <description>RSA Engine Access Key Store Error Flag</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No error</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Access error will stop RSA engine</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CRYPTO_RSA_SADDR0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_RSA_SADDR0</displayName>
          <description>RSA DMA Source Address Register0</description>
          <addressOffset>0xB08</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SADDR0</name>
              <description>RSA DMA Source Address Register0\nThe RSA accelerator supports DMA function to transfer the DATA and PARAMETER between SRAM memory space and RSA accelerator.\nThis register is stored the address of RSA the Base of Exponentiation (M).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CRYPTO_RSA_SADDR1</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_RSA_SADDR1</displayName>
          <description>RSA DMA Source Address Register1</description>
          <addressOffset>0xB0C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SADDR1</name>
              <description>RSA DMA Source Address Register1\nThe RSA accelerator supports DMA function to transfer the DATA and PARAMETER between SRAM memory space and RSA accelerator.\nThis register is stored the address of RSA the Base of Modulus Operation (N).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CRYPTO_RSA_SADDR2</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_RSA_SADDR2</displayName>
          <description>RSA DMA Source Address Register2</description>
          <addressOffset>0xB10</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SADDR2</name>
              <description>RSA DMA Source Address Register2\nThe RSA accelerator supports DMA function to transfer the DATA and PARAMETER between SRAM memory space and RSA accelerator.\nThis register is stored the address of RSA the Exponent of Exponentiation (E).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CRYPTO_RSA_SADDR3</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_RSA_SADDR3</displayName>
          <description>RSA DMA Source Address Register3</description>
          <addressOffset>0xB14</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SADDR3</name>
              <description>RSA DMA Source Address Register3\nThe RSA accelerator supports DMA function to transfer the DATA and PARAMETER between SRAM memory space and RSA accelerator.\nThis register is stored the address of RSA the Factor of Modulus Operation (p).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CRYPTO_RSA_SADDR4</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_RSA_SADDR4</displayName>
          <description>RSA DMA Source Address Register4</description>
          <addressOffset>0xB18</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SADDR4</name>
              <description>RSA DMA Source Address Register4\nThe RSA accelerator supports DMA function to transfer the DATA and PARAMETER between SRAM memory space and RSA accelerator.\nThis register is stored the address of RSA the Factor of Modulus Operation (q).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CRYPTO_RSA_DADDR</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_RSA_DADDR</displayName>
          <description>RSA DMA Destination Address Register</description>
          <addressOffset>0xB1C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DADDR</name>
              <description>RSA DMA Destination Address Register\nThe RSA accelerator supports DMA function to transfer the DATA and PARAMETER between SRAM memory space and RSA accelerator.\nThis register is stored the address of RSA DMA Destination Address Register (Ans).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CRYPTO_RSA_MADDR0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_RSA_MADDR0</displayName>
          <description>RSA DMA Middle Address Register0</description>
          <addressOffset>0xB20</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MADDR0</name>
              <description>RSA DMA Middle Address Register0\nThe RSA accelerator supports DMA function to transfer the DATA and PARAMETER between SRAM memory space and RSA accelerator.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CRYPTO_RSA_MADDR1</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_RSA_MADDR1</displayName>
          <description>RSA DMA Middle Address Register1</description>
          <addressOffset>0xB24</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MADDR1</name>
              <description>RSA DMA Middle Address Register1\nThe RSA accelerator supports DMA function to transfer the DATA and PARAMETER between SRAM memory space and RSA accelerator.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CRYPTO_RSA_MADDR2</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_RSA_MADDR2</displayName>
          <description>RSA DMA Middle Address Register2</description>
          <addressOffset>0xB28</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MADDR2</name>
              <description>RSA DMA Middle Address Register2\nThe RSA accelerator supports DMA function to transfer the DATA and PARAMETER between SRAM memory space and RSA accelerator.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CRYPTO_RSA_MADDR3</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_RSA_MADDR3</displayName>
          <description>RSA DMA Middle Address Register3</description>
          <addressOffset>0xB2C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MADDR3</name>
              <description>RSA DMA Middle Address Register3\nThe RSA accelerator supports DMA function to transfer the DATA and PARAMETER between SRAM memory space and RSA accelerator.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CRYPTO_RSA_MADDR4</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_RSA_MADDR4</displayName>
          <description>RSA DMA Middle Address Register4</description>
          <addressOffset>0xB30</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MADDR4</name>
              <description>RSA DMA Middle Address Register4\nThe RSA accelerator supports DMA function to transfer the DATA and PARAMETER between SRAM memory space and RSA accelerator.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CRYPTO_RSA_MADDR5</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_RSA_MADDR5</displayName>
          <description>RSA DMA Middle Address Register5</description>
          <addressOffset>0xB34</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MADDR5</name>
              <description>RSA DMA Middle Address Register5\nThe RSA accelerator supports DMA function to transfer the DATA and PARAMETER between SRAM memory space and RSA accelerator.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CRYPTO_RSA_MADDR6</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_RSA_MADDR6</displayName>
          <description>RSA DMA Middle Address Register6</description>
          <addressOffset>0xB38</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MADDR6</name>
              <description>RSA DMA Middle Address Register6\nThe RSA accelerator supports DMA function to transfer the DATA and PARAMETER between SRAM memory space and RSA accelerator.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
