wosayttn/sdk-bsp-numaker-m55m1/Debug/svd/M55M1.svd
       <register>
          <name>CRYPTO_ECC_KSSTS</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_ECC_KSSTS</displayName>
          <description>ECC Key Status Register</description>
          <addressOffset>0xF44</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>NUM</name>
              <description>Key Number\nThe key number is generated by Key Store after ECDH.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CRYPTO_ECC_KSXY</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_ECC_KSXY</displayName>
          <description>ECC XY Number Register</description>
          <addressOffset>0xF48</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>NUMX</name>
              <description>Read Key Number X</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RSRCXY</name>
              <description>Read Key Source for Key Number X and Y</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Key is read from ECC registers</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Key is read from Key Store</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>write-only</access>
            </field>
            <field>
              <name>RSSRCX</name>
              <description>Read Key Store Source for Key Number X\nRSSRCX takes effect only when RSRCXY is 1 (the key is from Key Store).</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Key is read from the SRAM of Key Store</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Key is read from the FLASH of Key Store</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>Key is read from the OTP of Key Store</description>
                    <value>#10</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>write-only</access>
            </field>
            <field>
              <name>NUMY</name>
              <description>Read Key Number Y</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RSSRCY</name>
              <description>Read Key Store Source for Key Number Y\nRSSRCY takes effect only when RSRCXY is 1 (the key is from Key Store).</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Key is read from the SRAM of Key Store</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Key is read from the FLASH of Key Store</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>Key is read from the OTP of Key Store</description>
                    <value>#10</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>write-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CRYPTO_RSA_KSCTL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_RSA_KSCTL</displayName>
          <description>RSA Key Control Register</description>
          <addressOffset>0xF50</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>NUM</name>
              <description>Read Key Number\nThe key number is sent to Key Store</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RSRC</name>
              <description>Read Key Source</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Key is read from RSA engine</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Key is read from Key Store</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>write-only</access>
            </field>
            <field>
              <name>RSSRC</name>
              <description>Read Key Store Source\nRSSRC takes effect only when RSRC is 1 (the key is from Key Store).</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Key is read from the SRAM of Key Store</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Key is read from the FLASH of Key Store</description>
                    <value>#01</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>write-only</access>
            </field>
            <field>
              <name>BKNUM</name>
              <description>Read Exponent Blind Key Number\nThe key number is sent to Key Store, and its destination always be the SRAM of Key Store. CPU cannot read the exponent blind key.\nNote: Use this key number, only when executing SCAP but no-CRT mode. When allocate space of Key Store, key owner selection bits (KS_METADATA[18:16]) should be '010'.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CRYPTO_RSA_KSSTS0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_RSA_KSSTS0</displayName>
          <description>RSA Key Status Register 0</description>
          <addressOffset>0xF54</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>NUM0</name>
              <description>Key Number0\nThe key number is generated by Key Store, RSA can get complete p by key number in Key Store while operating. \nNote: The size of this key as half key length.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NUM1</name>
              <description>Key Number1\nThe key number is generated by Key Store, RSA can get complete q by key number in Key Store while operating. \nNote: The size of this key as half key length.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NUM2</name>
              <description>Key Number2\nThe key number is generated by Key Store, RSA can get or store the intermediate temporary value by key number in the Key Store while operating. \nNote: The size of this key as key length.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NUM3</name>
              <description>Key Number3\nThe key number is generated by Key Store, RSA can get or store the intermediate temporary value by key number in the Key Store while operating. \nNote: The size of this key as key length.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CRYPTO_RSA_KSSTS1</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_RSA_KSSTS1</displayName>
          <description>RSA Key Status Register 1</description>
          <addressOffset>0xF58</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>NUM4</name>
              <description>Key Number4\nThe key number is generated by Key Store, RSA can get or store the intermediate temporary value by key number in Key Store while operating. \nNote: The size of this key as half key length.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NUM5</name>
              <description>Key Number5\nThe key number is generated by Key Store, RSA can get or store the intermediate temporary value by key number in Key Store while operating. \nNote: The size of this key as half key length.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NUM6</name>
              <description>Key Number6\nThe key number is generated by Key Store, RSA can get or store the intermediate temporary value by key number in Key Store while operating. \nNote: The size of this key as key length.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NUM7</name>
              <description>Key Number7\nThe key number is generated by Key Store, RSA can get or store the intermediate temporary value by key number in Key Store while operating. \nNote: The size of this key as key length.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CRYPTO_AHB_STS</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_AHB_STS</displayName>
          <description>CRYPTO AHB Master Status Register</description>
          <addressOffset>0xF90</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BUSY</name>
              <description>AHB Master Busy </description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>AHB Master is idle or finished</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>AHB Master is busy</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>SERVICE</name>
              <description>AHB Master Service</description>
              <bitOffset>1</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Reserved.</description>
                    <value>#000</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>AHB master is servicing AES engine when BUSY is 1</description>
                    <value>#001</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>AHB master is servicing SHA/HMAC engine when BUSY is 1</description>
                    <value>#010</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Reserved.</description>
                    <value>#011</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>4</name>
                    <description>AHB master is servicing ECC engine when BUSY is 1</description>
                    <value>#100</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>5</name>
                    <description>AHB master is servicing RSA engine when BUSY is 1</description>
                    <value>#101</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>6</name>
                    <description>Reserved.</description>
                    <value>#110</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>7</name>
                    <description>Reserved.</description>
                    <value>#111</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
          </fields>
       </register>
