wosayttn/sdk-bsp-numaker-m55m1/Debug/svd/M55M1.svd
       <register>
          <name>KS_OTPSTS</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>KS_OTPSTS</displayName>
          <description>Key Store OTP Keys Status Register</description>
          <addressOffset>0x40</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>KEY0</name>
              <description>OTP Key 0 Used Status\nNote: If chip is in RMA stage, this bit will set to 1 and key is revoked after initialization if key is existed.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>OTP key 0 is unused</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>OTP key 0 is used</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>KEY1</name>
              <description>OTP Key 1 Used Status\nNote: If chip is in RMA stage, this bit will set to 1 and key is revoked after initialization if key is existed.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>OTP key 1 is unused</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>OTP key 1 is used</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>KEY2</name>
              <description>OTP Key 2 Used Status\nNote: If chip is in RMA stage, this bit will set to 1 and key is revoked after initialization if key is existed.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>OTP key 2 is unused</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>OTP key 2 is used</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>KEY3</name>
              <description>OTP Key 3 Used Status\nNote: If chip is in RMA stage, this bit will set to 1 and key is revoked after initialization if key is existed.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>OTP key 3 is unused</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>OTP key 3 is used</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>KEY4</name>
              <description>OTP Key 4 Used Status\nNote: If chip is in RMA stage, this bit will set to 1 and key is revoked after initialization if key is existed.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>OTP key 4 is unused</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>OTP key 4 is used</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>KEY5</name>
              <description>OTP Key 5 Used Status\nNote: If chip is in RMA stage, this bit will set to 1 and key is revoked after initialization if key is existed.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>OTP key 5 is unused</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>OTP key 5 is used</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>KEY6</name>
              <description>OTP Key 6 Used Status\nNote: If chip is in RMA stage, this bit will set to 1 and key is revoked after initialization if key is existed.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>OTP key 6 is unused</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>OTP key 6 is used</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>KEY7</name>
              <description>OTP Key 7 Used Status\nNote: If chip is in RMA stage, this bit will set to 1 and key is revoked after initialization if key is existed.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>OTP key 7 is unused</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>OTP key 7 is used</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>KEY8</name>
              <description>OTP Key 8 Used Status\nNote: If chip is in RMA stage, this bit will set to 1 and key is revoked after initialization if key is existed.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>OTP key 8 is unused</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>OTP key 8 is used</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>KEY9</name>
              <description>OTP Key 9 Used Status\nNote: If chip is in RMA stage, this bit will set to 1 and key is revoked after initialization if key is existed.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>OTP key 9 is unused</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>OTP key 9 is used</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>KEY10</name>
              <description>OTP Key 10 Used Status\nNote: If chip is in RMA stage, this bit will set to 1 and key is revoked after initialization if key is existed.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>OTP key 10 is unused</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>OTP key 10 is used</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>KEY11</name>
              <description>OTP Key 11 Used Status\nNote: If chip is in RMA stage, this bit will set to 1 and key is revoked after initialization if key is existed.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>OTP key 11 is unused</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>OTP key 11 is used</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>KEY12</name>
              <description>OTP Key 12 Used Status\nNote: If chip is in RMA stage, this bit will set to 1 and key is revoked after initialization if key is existed.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>OTP key 12 is unused</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>OTP key 12 is used</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>KEY13</name>
              <description>OTP Key 13 Used Status\nNote: If chip is in RMA stage, this bit will set to 1 and key is revoked after initialization if key is existed.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>OTP key 13 is unused</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>OTP key 13 is used</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>KEY14</name>
              <description>OTP Key 14 Used Status\nNote: If chip is in RMA stage, this bit will set to 1 and key is revoked after initialization if key is existed.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>OTP key 14 is unused</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>OTP key 14 is used</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>KEY15</name>
              <description>OTP Key 15 Used Status\nNote: If chip is in RMA stage, this bit will set to 1 and key is revoked after initialization if key is existed.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>OTP key 15 is unused</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>OTP key 15 is used</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>KS_REMKCNT</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>KS_REMKCNT</displayName>
          <description>Key Store Remaining Key Count Register</description>
          <addressOffset>0x44</addressOffset>
          <access>read-only</access>
          <resetValue>0x00200020</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RRMKCNT</name>
              <description>Key Store SRAM Remaining Key Count\nThe RRMKCNT shows the remaining key count for SRAM.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FRMKCNT</name>
              <description>Key Store Flash Remaining Key Count\nThe FRMKCNT shows the remaining key count for Flash.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>KS_RSTERR</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>KS_RSTERR</displayName>
          <description>Key Store Reset Error Register</description>
          <addressOffset>0xF0</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000FFFF0</resetMask>
          <fields>
            <field>
              <name>OPMODE</name>
              <description>Key Store Operation Mode\nThese bits show what OPMODE(KS_CTL[3:1]) is being executed before reset.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NUMBER</name>
              <description>Key Number\nThese bits show what NUMBER(KS_METADATA[25:20]) is being executed before reset.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DST</name>
              <description>Key Location\nThese bits show what DST(KS_METADATA[31:30]) is being executed before reset.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
