wosayttn/sdk-bsp-numaker-m55m1/Debug/svd/M55M1.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>NPU</name>
      <description>NPU Register Map</description>
      <groupName>NPU</groupName>
      <baseAddress>0x40003000</baseAddress>
      <!-- d -> no access permission -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x30</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x3C</offset>
        <size>0x14</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x80</offset>
        <size>0x40</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x180</offset>
        <size>0x1C</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x1A0</offset>
        <size>0x8</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x1AC</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x300</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x380</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xFD0</offset>
        <size>0x30</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
       <register>
          <name>ID</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>ID</displayName>
          <description>ID register</description>
          <addressOffset>0x0</addressOffset>
          <access>read-only</access>
          <resetValue>0x10104201</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
          </fields>
       </register>
       <register>
          <name>STATUS</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>STATUS</displayName>
          <description>Register describes the current operating status of the NPU</description>
          <addressOffset>0x4</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000008</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
          </fields>
       </register>
       <register>
          <name>CMD</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CMD</displayName>
          <description>Command register, reads as last written command</description>
          <addressOffset>0x8</addressOffset>
          <access>read-write</access>
          <resetValue>0x0000000C</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
          </fields>
       </register>
       <register>
          <name>RESET</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>RESET</displayName>
          <description>Request Reset and new security modeIf this register is written to by a permitted manager, then the NPU is reset (clearing all internal RAMs) and the reset register value is updated. (Otherwise the write to this register is ignored and the NPU is not reset.) The value written to this register sets the privilege level used by the NPU when the NPU acts as an AXI manager. The host is permitted to set any level of privilege less than or equal to the host privilege level.</description>
          <addressOffset>0xC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
          </fields>
       </register>
       <register>
          <name>QBASE0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>QBASE0</displayName>
          <description>Base address of Command-queue bits[31:0]. The address is 4-byte-aligned</description>
          <addressOffset>0x10</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
          </fields>
       </register>
       <register>
          <name>QBASE1</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>QBASE1</displayName>
          <description>Address extension bits[47:32] for queue base</description>
          <addressOffset>0x14</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
          </fields>
       </register>
       <register>
          <name>QREAD</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>QREAD</displayName>
          <description>Read offset in the command stream in bytes. Multiples of 4 in the range 0-16 Mbytes</description>
          <addressOffset>0x18</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
          </fields>
       </register>
       <register>
          <name>QCONFIG</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>QCONFIG</displayName>
          <description>AXI configuration for the command stream in the range 0-3. Same encoding as for REGIONCFG</description>
          <addressOffset>0x1C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
          </fields>
       </register>
       <register>
          <name>QSIZE</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>QSIZE</displayName>
          <description>Size of the command stream in bytes.Multiples of 4 in the range 0-16 Mbytes</description>
          <addressOffset>0x20</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
          </fields>
       </register>
       <register>
          <name>PROT</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PROT</displayName>
          <description>Protection level configured for the NPU when acting as an AXI master</description>
          <addressOffset>0x24</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
          </fields>
       </register>
       <register>
          <name>CONFIG</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CONFIG</displayName>
          <description>RTL configuration</description>
          <addressOffset>0x28</addressOffset>
          <access>read-only</access>
          <resetValue>0x00003008</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
          </fields>
       </register>
       <register>
          <name>LOCK</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>LOCK</displayName>
          <description>Lock register. This register is designed for driver use and does not affect NPU functionality</description>
          <addressOffset>0x2C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
          </fields>
       </register>
       <register>
          <name>REGIONCFG</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>REGIONCFG</displayName>
          <description>Base pointer configuration. Bits[2*k+1:2*k] give the memory type for REGION[k]</description>
          <addressOffset>0x3C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
          </fields>
       </register>
       <register>
          <name>AXI_LIMIT0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>AXI_LIMIT0</displayName>
          <description>AXI limits for port 0 counter 0</description>
          <addressOffset>0x40</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
          </fields>
       </register>
       <register>
          <name>AXI_LIMIT1</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>AXI_LIMIT1</displayName>
          <description>AXI limits for port 0 counter 1</description>
          <addressOffset>0x44</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
          </fields>
       </register>
       <register>
          <name>AXI_LIMIT2</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>AXI_LIMIT2</displayName>
          <description>AXI limits for port 1 counter 2</description>
          <addressOffset>0x48</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
          </fields>
       </register>
       <register>
          <name>AXI_LIMIT3</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>AXI_LIMIT3</displayName>
          <description>AXI limits for port 1 counter 3</description>
          <addressOffset>0x4C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
          </fields>
       </register>
       <register>
          <name>BASEP0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>BASEP0</displayName>
          <description>Lower 32 bits of the Base pointer for region index 0</description>
          <addressOffset>0x80</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
          </fields>
       </register>
       <register>
          <name>BASEP1</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>BASEP1</displayName>
          <description>Upper 32 bits of the Base pointer for region index 0</description>
          <addressOffset>0x84</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
          </fields>
       </register>
       <register>
          <name>BASEP2</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>BASEP2</displayName>
          <description>Lower 32 bits of the Base pointer for region index 1</description>
          <addressOffset>0x88</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
          </fields>
       </register>
       <register>
          <name>BASEP3</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>BASEP3</displayName>
          <description>Upper 32 bits of the Base pointer for region index 1</description>
          <addressOffset>0x8C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
          </fields>
       </register>
       <register>
          <name>BASEP4</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>BASEP4</displayName>
          <description>Lower 32 bits of the Base pointer for region index 2</description>
          <addressOffset>0x90</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
          </fields>
       </register>
       <register>
          <name>BASEP5</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>BASEP5</displayName>
          <description>Upper 32 bits of the Base pointer for region index 2</description>
          <addressOffset>0x94</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
          </fields>
       </register>
       <register>
          <name>BASEP6</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>BASEP6</displayName>
          <description>Lower 32 bits of the Base pointer for region index 3</description>
          <addressOffset>0x98</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
          </fields>
       </register>
       <register>
          <name>BASEP7</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>BASEP7</displayName>
          <description>Upper 32 bits of the Base pointer for region index 3</description>
          <addressOffset>0x9C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
          </fields>
       </register>
       <register>
          <name>BASEP8</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>BASEP8</displayName>
          <description>Lower 32 bits of the Base pointer for region index 4</description>
          <addressOffset>0xA0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
          </fields>
       </register>
       <register>
          <name>BASEP9</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>BASEP9</displayName>
          <description>Upper 32 bits of the Base pointer for region index 4</description>
          <addressOffset>0xA4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
          </fields>
       </register>
       <register>
          <name>BASEP10</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>BASEP10</displayName>
          <description>Lower 32 bits of the Base pointer for region index 5</description>
          <addressOffset>0xA8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
          </fields>
       </register>
       <register>
          <name>BASEP11</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>BASEP11</displayName>
          <description>Upper 32 bits of the Base pointer for region index 5</description>
          <addressOffset>0xAC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
          </fields>
       </register>
       <register>
          <name>BASEP12</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>BASEP12</displayName>
          <description>Lower 32 bits of the Base pointer for region index 6</description>
          <addressOffset>0xB0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
          </fields>
       </register>
       <register>
          <name>BASEP13</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>BASEP13</displayName>
          <description>Upper 32 bits of the Base pointer for region index 6</description>
          <addressOffset>0xB4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
          </fields>
       </register>
       <register>
          <name>BASEP14</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>BASEP14</displayName>
          <description>Lower 32 bits of the Base pointer for region index 7</description>
          <addressOffset>0xB8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
          </fields>
       </register>
       <register>
          <name>BASEP15</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>BASEP15</displayName>
          <description>Upper 32 bits of the Base pointer for region index 7</description>
          <addressOffset>0xBC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
          </fields>
       </register>
       <register>
          <name>PMCR</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PMCR</displayName>
          <description>PMU master control register</description>
          <addressOffset>0x180</addressOffset>
          <access>read-write</access>
          <resetValue>0x00002000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
          </fields>
       </register>
       <register>
          <name>PMCNTENSET</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PMCNTENSET</displayName>
          <description>Count-enable set register</description>
          <addressOffset>0x184</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
          </fields>
       </register>
       <register>
          <name>PMCNTENCLR</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PMCNTENCLR</displayName>
          <description>Count-enable clear register</description>
          <addressOffset>0x188</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
          </fields>
       </register>
       <register>
          <name>PMOVSSET</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PMOVSSET</displayName>
          <description>Overflow-flag status set register</description>
          <addressOffset>0x18C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
          </fields>
       </register>
       <register>
          <name>PMOVSCLR</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PMOVSCLR</displayName>
          <description>Overflow-flag status clear register</description>
          <addressOffset>0x190</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
          </fields>
       </register>
       <register>
          <name>PMINTSET</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PMINTSET</displayName>
          <description>Interrupt-enable set register</description>
          <addressOffset>0x194</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
          </fields>
       </register>
       <register>
          <name>PMINTCLR</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PMINTCLR</displayName>
          <description>Interrupt-enable clear register</description>
          <addressOffset>0x198</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
          </fields>
       </register>
       <register>
          <name>PMCCNTR_LO</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PMCCNTR_LO</displayName>
          <description>Performance-monitor cycle count low register</description>
          <addressOffset>0x1A0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
          </fields>
       </register>
       <register>
          <name>PMCCNTR_HI</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PMCCNTR_HI</displayName>
          <description>Performance-monitor cycle count high register</description>
          <addressOffset>0x1A4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
          </fields>
       </register>
       <register>
          <name>PMCAXI_CHAN</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PMCAXI_CHAN</displayName>
          <description>Set which AXI channel monitor</description>
          <addressOffset>0x1AC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
          </fields>
       </register>
       <register>
          <name>PMU_EVCNTRn</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PMU_EVCNTRn</displayName>
          <description>Performance-monitor event counters</description>
          <addressOffset>0x300</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
          </fields>
       </register>
       <register>
          <name>PMU_EVTYPERn</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PMU_EVTYPERn</displayName>
          <description>Performance-monitor event-type control counters</description>
          <addressOffset>0x380</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
          </fields>
       </register>
       <register>
          <name>PID4</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PID4</displayName>
          <description>Peripheral ID byte 4 (Arm=code 4)</description>
          <addressOffset>0xFD0</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000004</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
          </fields>
       </register>
