wosayttn/sdk-bsp-numaker-m55m1/Debug/svd/M55M1.svd
       <register>
          <name>OTFCx_STS</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>OTFCx_STS</displayName>
          <description>OTFC Status Flag Register</description>
          <addressOffset>0x4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BUSY0</name>
              <description>OTFC Protrction Region 0 Busy (Read Only)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>The OTFC Protrction Region 0 is idle</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The OTFC Protrction Region 0 is under processing</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>KSERR0</name>
              <description>OTFC Protrction Region 0 Access Key Store Error Flag (Read Only)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No error</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Key Store access error will stop OTFC engine in Protrction Region 0</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>DFAERR0</name>
              <description>OTFC Protrction Region 0 Differential Fault Attack Error Flag (Read Only)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No error</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Differential Fault Attack happened in protrction region 0. The results from AES engine are incorrect</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>IF0</name>
              <description>OTFC Protrction Region 0 Interrupt Flag\nNote: This bit is cleared by writing 1 and it has no effect by writing 0.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No OTFC Protrction Region 0 interrupt</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>OTFC Protrction Region 0 interrupt</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>BUSY1</name>
              <description>OTFC Protrction Region 1 Busy (Read Only)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>The OTFC Protrction Region 1 is idle</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The OTFC Protrction Region 1 is under processing</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>KSERR1</name>
              <description>OTFC Protrction Region 1 Access Key Store Error Flag (Read Only)</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No error</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Key Store access error will stop OTFC engine in Protrction Region 1</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>DFAERR1</name>
              <description>OTFC Protrction Region 1 Differential Fault Attack Error Flag (Read Only)</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No error</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Differential Fault Attack happened in protrction region 1. The results from AES engine are incorrect</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>IF1</name>
              <description>OTFC Protrction Region 1 Interrupt Flag\nNote: This bit is cleared by writing 1 and it has no effect by writing 0.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No OTFC Protrction Region 1 interrupt</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>OTFC Protrction Region 1 interrupt</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>BUSY2</name>
              <description>OTFC Protrction Region 2 Busy (Read Only)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>The OTFC Protrction Region 2 is idle</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The OTFC Protrction Region 2 is under processing</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>KSERR2</name>
              <description>OTFC Protrction Region 2 Access Key Store Error Flag (Read Only)</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No error</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Key Store access error will stop OTFC engine in Protrction Region 2</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>DFAERR2</name>
              <description>OTFC Protrction Region 2 Differential Fault Attack Error Flag (Read Only)</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No error</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Differential Fault Attack happened in protrction region 2. The results from AES engine are incorrect</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>IF2</name>
              <description>OTFC Protrction Region 2 Interrupt Flag\nNote: This bit is cleared by writing 1 and it has no effect by writing 0.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No OTFC Protrction Region 2 interrupt</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>OTFC Protrction Region 2 interrupt</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>BUSY3</name>
              <description>OTFC Protrction Region 3 Busy (Read Only)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>The OTFC Protrction Region 3 is idle</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The OTFC Protrction Region 3 is under processing</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>KSERR3</name>
              <description>OTFC Protrction Region 3 Access Key Store Error Flag (Read Only)</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No error</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Key Store access error will stop OTFC engine in Protrction Region 3</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>DFAERR3</name>
              <description>OTFC Protrction Region 3 Differential Fault Attack Error Flag (Read Only)</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No error</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Differential Fault Attack happened in protrction region 3. The results from AES engine are incorrect</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>IF3</name>
              <description>OTFC Protrction Region 3 Interrupt Flag\nNote: This bit is cleared by writing 1 and it has no effect by writing 0.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No OTFC Protrction Region 3 interrupt</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>OTFC Protrction Region 3 interrupt</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>OTFCx_PR0_SADDR</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>OTFCx_PR0_SADDR</displayName>
          <description>OTFC Protection Region 0 Start Address Register</description>
          <addressOffset>0x10</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SADDR</name>
              <description>Protection Region 0 Start Address Register\nThe start address indicates the start address of protection region 0 in the external memory space for OTFC. The start address should be located at 128-bit boundary. In other words, bit 3, 2, 1 and 0 of SADDR are ignored. SADDR can be read and written.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>OTFCx_PR0_EADDR</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>OTFCx_PR0_EADDR</displayName>
          <description>OTFC Protection Region 0 End Address Register</description>
          <addressOffset>0x14</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EADDR</name>
              <description>OTFC Protection Region 0 End Address\nThe end address indicates the end address of protection region 0 in the external memory space for OTFC. The end address should be located at 128-bit boundary. In other words, bit 3, 2, 1 and 0 of EADDR are ignored. EADDR can be read and written</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>OTFCx_PR0_KSCTL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>OTFCx_PR0_KSCTL</displayName>
          <description>OTFC Protection Region 0 Key Control Register</description>
          <addressOffset>0x18</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>NUM</name>
              <description>Read Key Number\nThe key number is sent to Key Store</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RSRC</name>
              <description>Read Key Source</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Key is read from registers OTFC_PR0_KEYx</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Key is read from Key Store</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>write-only</access>
            </field>
            <field>
              <name>RSSRC</name>
              <description>Read Key Store Source\nRSSRC takes effect only when RSRC is 1 (the key is from Key Store).</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Key is read from the SRAM of Key Store</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>Key is read from the OTP of Key Store</description>
                    <value>#10</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>write-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>OTFCx_PR0_KEY0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>OTFCx_PR0_KEY0</displayName>
          <description>OTFC Protection Region 0 KEY Word 0 Register</description>
          <addressOffset>0x20</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>KEY</name>
              <description>OTFC_PR0_KEYy\nThe KEY keeps the security key for AES operation in protection region 0.\nThe security key for AES accelerator is 128 bits and four 32-bit registers are to store each security key. \n{OTFC_PR0_KEY3, OTFC_PR0_KEY2, OTFC_PR0_KEY1, OTFC_PR0_KEY0} stores the 128-bit security key for AES operation.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="OTFCx_PR0_KEY0">
          <name>OTFCx_PR0_KEY1</name>
          <displayName>OTFCx_PR0_KEY1</displayName>
          <description>OTFC Protection Region 0 KEY Word 1 Register</description>
          <addressOffset>0x24</addressOffset>
       </register>
       <register derivedFrom="OTFCx_PR0_KEY0">
          <name>OTFCx_PR0_KEY2</name>
          <displayName>OTFCx_PR0_KEY2</displayName>
          <description>OTFC Protection Region 0 KEY Word 2 Register</description>
          <addressOffset>0x28</addressOffset>
       </register>
       <register derivedFrom="OTFCx_PR0_KEY0">
          <name>OTFCx_PR0_KEY3</name>
          <displayName>OTFCx_PR0_KEY3</displayName>
          <description>OTFC Protection Region 0 KEY Word 3 Register</description>
          <addressOffset>0x2C</addressOffset>
       </register>
       <register>
          <name>OTFCx_PR0_SCRAMBLE</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>OTFCx_PR0_SCRAMBLE</displayName>
          <description>OTFC Protection Region 0 Scramble key Register</description>
          <addressOffset>0x40</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SCRAMBLE</name>
              <description>Protection Region 0 Scramble key Register\nThe scramble key for address cipher function in protection region 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>OTFCx_PR0_NONCE0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>OTFCx_PR0_NONCE0</displayName>
          <description>OTFC Protection Region 0 Nonce Word 0 Register</description>
          <addressOffset>0x44</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>NONCE</name>
              <description>Protection Region 0 Nonce Word y Register\nThree nonces (OTFC_PR0_NONCE0, OTFC_PR0_NONCE1, and OTFC_PR0_NONCE2) are for the address cipher function in OTFC.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="OTFCx_PR0_NONCE0">
          <name>OTFCx_PR0_NONCE1</name>
          <displayName>OTFCx_PR0_NONCE1</displayName>
          <description>OTFC Protection Region 0 Nonce Word 1 Register</description>
          <addressOffset>0x48</addressOffset>
       </register>
       <register derivedFrom="OTFCx_PR0_NONCE0">
          <name>OTFCx_PR0_NONCE2</name>
          <displayName>OTFCx_PR0_NONCE2</displayName>
          <description>OTFC Protection Region 0 Nonce Word 2 Register</description>
          <addressOffset>0x4C</addressOffset>
       </register>
       <register>
          <name>OTFCx_PR1_SADDR</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>OTFCx_PR1_SADDR</displayName>
          <description>OTFC Protection Region 1 Start Address Register</description>
          <addressOffset>0x50</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SADDR</name>
              <description>Protection Region 1 Start Address Register\nThe start address indicates the start address of protection region 1 in the external memory space for OTFC. The start address should be located at 128-bit boundary. In other words, bit 3, 2, 1 and 0 of SADDR are ignored. SADDR can be read and written.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
