wosayttn/sdk-bsp-numaker-m55m1/Debug/svd/M55M1.svd
       <register>
          <name>OTFCx_PR1_EADDR</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>OTFCx_PR1_EADDR</displayName>
          <description>OTFC Protection Region 1 End Address Register</description>
          <addressOffset>0x54</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EADDR</name>
              <description>OTFC Protection Region 1 End Address\nThe end address indicates the end address of protection region 1 in the external memory space for OTFC. The end address should be located at 128-bit boundary. In other words, bit 3, 2, 1 and 0 of EADDR are ignored. EADDR can be read and written</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>OTFCx_PR1_KSCTL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>OTFCx_PR1_KSCTL</displayName>
          <description>OTFC Protection Region 1 Key Control Register</description>
          <addressOffset>0x58</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>NUM</name>
              <description>Read Key Number\nThe key number is sent to Key Store</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RSRC</name>
              <description>Read Key Source</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Key is read from registers OTFC_PR1_KEYx</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Key is read from Key Store</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>write-only</access>
            </field>
            <field>
              <name>RSSRC</name>
              <description>Read Key Store Source\nRSSRC takes effect only when RSRC is 1 (the key is from Key Store).</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Key is read from the SRAM of Key Store</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>Key is read from the OTP of Key Store</description>
                    <value>#10</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>write-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>OTFCx_PR1_KEY0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>OTFCx_PR1_KEY0</displayName>
          <description>OTFC Protection Region 1 KEY Word 0 Register</description>
          <addressOffset>0x60</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>KEY</name>
              <description>OTFC_PR1_KEYy\nThe KEY keeps the security key for AES operation in protection region 1.\nThe security key for AES accelerator is 128 bits and four 32-bit registers are to store each security key. \n{OTFC_PR1_KEY3, OTFC_PR1_KEY2, OTFC_PR1_KEY1, OTFC_PR1_KEY0} stores the 128-bit security key for AES operation.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="OTFCx_PR1_KEY0">
          <name>OTFCx_PR1_KEY1</name>
          <displayName>OTFCx_PR1_KEY1</displayName>
          <description>OTFC Protection Region 1 KEY Word 1 Register</description>
          <addressOffset>0x64</addressOffset>
       </register>
       <register derivedFrom="OTFCx_PR1_KEY0">
          <name>OTFCx_PR1_KEY2</name>
          <displayName>OTFCx_PR1_KEY2</displayName>
          <description>OTFC Protection Region 1 KEY Word 2 Register</description>
          <addressOffset>0x68</addressOffset>
       </register>
       <register derivedFrom="OTFCx_PR1_KEY0">
          <name>OTFCx_PR1_KEY3</name>
          <displayName>OTFCx_PR1_KEY3</displayName>
          <description>OTFC Protection Region 1 KEY Word 3 Register</description>
          <addressOffset>0x6C</addressOffset>
       </register>
       <register>
          <name>OTFCx_PR1_SCRAMBLE</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>OTFCx_PR1_SCRAMBLE</displayName>
          <description>OTFC Protection Region 1 Scramble key Register</description>
          <addressOffset>0x80</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SCRAMBLE</name>
              <description>Protection Region 1 Scramble key Register\nThe scramble key for address cipher function in protection region 1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>OTFCx_PR1_NONCE0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>OTFCx_PR1_NONCE0</displayName>
          <description>OTFC Protection Region 1 Nonce Word 0 Register</description>
          <addressOffset>0x84</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>NONCE</name>
              <description>Protection Region 1 Nonce Word y Register\nThree nonces (OTFC_PR1_NONCE0, OTFC_PR1_NONCE1, and OTFC_PR1_NONCE2) are for the address cipher function in OTFC.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="OTFCx_PR1_NONCE0">
          <name>OTFCx_PR1_NONCE1</name>
          <displayName>OTFCx_PR1_NONCE1</displayName>
          <description>OTFC Protection Region 1 Nonce Word 1 Register</description>
          <addressOffset>0x88</addressOffset>
       </register>
       <register derivedFrom="OTFCx_PR1_NONCE0">
          <name>OTFCx_PR1_NONCE2</name>
          <displayName>OTFCx_PR1_NONCE2</displayName>
          <description>OTFC Protection Region 1 Nonce Word 2 Register</description>
          <addressOffset>0x8C</addressOffset>
       </register>
       <register>
          <name>OTFCx_PR2_SADDR</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>OTFCx_PR2_SADDR</displayName>
          <description>OTFC Protection Region 2 Start Address Register</description>
          <addressOffset>0x90</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SADDR</name>
              <description>Protection Region 2 Start Address Register\nThe start address indicates the start address of protection region 2 in the external memory space for OTFC. The start address should be located at 128-bit boundary. In other words, bit 3, 2, 1 and 0 of SADDR are ignored. SADDR can be read and written.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>OTFCx_PR2_EADDR</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>OTFCx_PR2_EADDR</displayName>
          <description>OTFC Protection Region 2 End Address Register</description>
          <addressOffset>0x94</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EADDR</name>
              <description>OTFC Protection Region 2 End Address\nThe end address indicates the end address of protection region 2 in the external memory space for OTFC. The end address should be located at 128-bit boundary. In other words, bit 3, 2, 1 and 0 of EADDR are ignored. EADDR can be read and written</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>OTFCx_PR2_KSCTL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>OTFCx_PR2_KSCTL</displayName>
          <description>OTFC Protection Region 2 Key Control Register</description>
          <addressOffset>0x98</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>NUM</name>
              <description>Read Key Number\nThe key number is sent to Key Store</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RSRC</name>
              <description>Read Key Source</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Key is read from registers OTFC_PR2_KEYx</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Key is read from Key Store</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>write-only</access>
            </field>
            <field>
              <name>RSSRC</name>
              <description>Read Key Store Source\nRSSRC takes effect only when RSRC is 1 (the key is from Key Store).</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Key is read from the SRAM of Key Store</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>Key is read from the OTP of Key Store</description>
                    <value>#10</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>write-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>OTFCx_PR2_KEY0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>OTFCx_PR2_KEY0</displayName>
          <description>OTFC Protection Region 2 KEY Word 0 Register</description>
          <addressOffset>0xA0</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>KEY</name>
              <description>OTFC_PR2_KEYy\nThe KEY keeps the security key for AES operation in protection region 2.\nThe security key for AES accelerator is 128 bits and four 32-bit registers are to store each security key. \n{OTFC_PR2_KEY3, OTFC_PR2_KEY2, OTFC_PR2_KEY1, OTFC_PR2_KEY0} stores the 128-bit security key for AES operation.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
       </register>
