wosayttn/sdk-bsp-numaker-m55m1/Debug/svd/M55M1.svd
       <register derivedFrom="OTFCx_PR2_KEY0">
          <name>OTFCx_PR2_KEY1</name>
          <displayName>OTFCx_PR2_KEY1</displayName>
          <description>OTFC Protection Region 2 KEY Word 1 Register</description>
          <addressOffset>0xA4</addressOffset>
       </register>
       <register derivedFrom="OTFCx_PR2_KEY0">
          <name>OTFCx_PR2_KEY2</name>
          <displayName>OTFCx_PR2_KEY2</displayName>
          <description>OTFC Protection Region 2 KEY Word 2 Register</description>
          <addressOffset>0xA8</addressOffset>
       </register>
       <register derivedFrom="OTFCx_PR2_KEY0">
          <name>OTFCx_PR2_KEY3</name>
          <displayName>OTFCx_PR2_KEY3</displayName>
          <description>OTFC Protection Region 2 KEY Word 3 Register</description>
          <addressOffset>0xAC</addressOffset>
       </register>
       <register>
          <name>OTFCx_PR2_SCRAMBLE</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>OTFCx_PR2_SCRAMBLE</displayName>
          <description>OTFC Protection Region 2 Scramble key Register</description>
          <addressOffset>0xC0</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SCRAMBLE</name>
              <description>Protection Region 2 Scramble key Register\nThe scramble key for address cipher function in protection region 2.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>OTFCx_PR2_NONCE0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>OTFCx_PR2_NONCE0</displayName>
          <description>OTFC Protection Region 2 Nonce Word 0 Register</description>
          <addressOffset>0xC4</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>NONCE</name>
              <description>Protection Region 2 Nonce Word y Register\nThree nonces (OTFC_PR2_NONCE0, OTFC_PR2_NONCE1, and OTFC_PR2_NONCE2) are for the address cipher function in OTFC.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="OTFCx_PR2_NONCE0">
          <name>OTFCx_PR2_NONCE1</name>
          <displayName>OTFCx_PR2_NONCE1</displayName>
          <description>OTFC Protection Region 2 Nonce Word 1 Register</description>
          <addressOffset>0xC8</addressOffset>
       </register>
       <register derivedFrom="OTFCx_PR2_NONCE0">
          <name>OTFCx_PR2_NONCE2</name>
          <displayName>OTFCx_PR2_NONCE2</displayName>
          <description>OTFC Protection Region 2 Nonce Word 2 Register</description>
          <addressOffset>0xCC</addressOffset>
       </register>
       <register>
          <name>OTFCx_PR3_SADDR</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>OTFCx_PR3_SADDR</displayName>
          <description>OTFC Protection Region 3 Start Address Register</description>
          <addressOffset>0xD0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SADDR</name>
              <description>Protection Region 3 Start Address Register\nThe start address indicates the start address of protection region 3 in the external memory space for OTFC. The start address should be located at 128-bit boundary. In other words, bit 3, 2, 1 and 0 of SADDR are ignored. SADDR can be read and written.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>OTFCx_PR3_EADDR</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>OTFCx_PR3_EADDR</displayName>
          <description>OTFC Protection Region 3 End Address Register</description>
          <addressOffset>0xD4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EADDR</name>
              <description>OTFC Protection Region 3 End Address\nThe end address indicates the end address of protection region 3 in the external memory space for OTFC. The end address should be located at 128-bit boundary. In other words, bit 3, 2, 1 and 0 of EADDR are ignored. EADDR can be read and written</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>OTFCx_PR3_KSCTL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>OTFCx_PR3_KSCTL</displayName>
          <description>OTFC Protection Region 3 Key Control Register</description>
          <addressOffset>0xD8</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>NUM</name>
              <description>Read Key Number\nThe key number is sent to Key Store</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RSRC</name>
              <description>Read Key Source</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Key is read from registers OTFC_PR3_KEYx</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Key is read from Key Store</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>write-only</access>
            </field>
            <field>
              <name>RSSRC</name>
              <description>Read Key Store Source\nRSSRC takes effect only when RSRC is 1 (the key is from Key Store).</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Key is read from the SRAM of Key Store</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>Key is read from the OTP of Key Store</description>
                    <value>#10</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>write-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>OTFCx_PR3_KEY0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>OTFCx_PR3_KEY0</displayName>
          <description>OTFC Protection Region 3 KEY Word 0 Register</description>
          <addressOffset>0xE0</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>KEY</name>
              <description>OTFC_PR3_KEYy\nThe KEY keeps the security key for AES operation in protection region 3.\nThe security key for AES accelerator is 128 bits and four 32-bit registers are to store each security key. \n{OTFC_PR3_KEY3, OTFC_PR3_KEY2, OTFC_PR3_KEY1, OTFC_PR1_KEY0} stores the 128-bit security key for AES operation.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="OTFCx_PR3_KEY0">
          <name>OTFCx_PR3_KEY1</name>
          <displayName>OTFCx_PR3_KEY1</displayName>
          <description>OTFC Protection Region 3 KEY Word 1 Register</description>
          <addressOffset>0xE4</addressOffset>
       </register>
       <register derivedFrom="OTFCx_PR3_KEY0">
          <name>OTFCx_PR3_KEY2</name>
          <displayName>OTFCx_PR3_KEY2</displayName>
          <description>OTFC Protection Region 3 KEY Word 2 Register</description>
          <addressOffset>0xE8</addressOffset>
       </register>
       <register derivedFrom="OTFCx_PR3_KEY0">
          <name>OTFCx_PR3_KEY3</name>
          <displayName>OTFCx_PR3_KEY3</displayName>
          <description>OTFC Protection Region 3 KEY Word 3 Register</description>
          <addressOffset>0xEC</addressOffset>
       </register>
       <register>
          <name>OTFCx_PR3_SCRAMBLE</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>OTFCx_PR3_SCRAMBLE</displayName>
          <description>OTFC Protection Region 3 Scramble key Register</description>
          <addressOffset>0x100</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SCRAMBLE</name>
              <description>Protection Region 3 Scramble key Register\nThe scramble key for address cipher function in protection region 3.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>OTFCx_PR3_NONCE0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>OTFCx_PR3_NONCE0</displayName>
          <description>OTFC Protection Region 3 Nonce Word 0 Register</description>
          <addressOffset>0x104</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>NONCE</name>
              <description>Protection Region 3 Nonce Word y Register\nThree nonces (OTFC_PR3_NONCE0, OTFC_PR3_NONCE1, and OTFC_PR3_NONCE2) are for the address cipher function in OTFC.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
       </register>
