wosayttn/sdk-bsp-numaker-m55m1/Debug/svd/M55M1.svd
       <register>
          <name>CLK_MIRCCTL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CLK_MIRCCTL</displayName>
          <description>MIRC Control Register</description>
          <addressOffset>0x8</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MIRC1MSTBS</name>
              <description>MIRC1M Stable Count Select\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>MIRC1M stable count is 9 clocks and clock output deviation about 2%</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>MIRC1M stable count is 8 clocks and clock output deviation about 5%</description>
                    <value>#01</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>MIRC2MSTBS</name>
              <description>MIRC2M Stable Count Select\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>MIRC2M stable count is 10 clocks and clock output deviation about 2%</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>MIRC2M stable count is 6 clocks and clock output deviation about 5%</description>
                    <value>#01</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>MIRC4MSTBS</name>
              <description>MIRC4M Stable Count Select\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>MIRC4M stable count is 12 clocks and clock output deviation about 2%</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>MIRC4M stable count is 10 clocks and clock output deviation about 5%</description>
                    <value>#01</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>MIRC8MSTBS</name>
              <description>MIRC8M Stable Count Select\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>MIRC8M stable count is 24 clocks and clock output deviation about 2%</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>MIRC8M stable count is 21 clocks and clock output deviation about 5%</description>
                    <value>#01</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>MIRCFSEL</name>
              <description>MIRC Frequency Select Bits\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Internal middle speed RC oscillator frequency is 1 MHz</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Internal middle speed RC oscillator frequency is 2 MHz</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>Internal middle speed RC oscillator frequency is 4 MHz</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Internal middle speed RC oscillator frequency is 8 MHz</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>MIRCFDIS</name>
              <description>MIRC Clock Filter Disable Bit\nNote: This bit is not retained when D2 power is turned off.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>MIRC Filter enabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>MIRC Filter disabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CLK_APLL0CTL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CLK_APLL0CTL</displayName>
          <description>APLL0 Control Register</description>
          <addressOffset>0x18</addressOffset>
          <access>read-only</access>
          <resetValue>0x80008422</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FBDIV</name>
              <description>APLL0 Feedback Divider Control\nRefer to the formulas below the table.\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INDIV</name>
              <description>APLL0 Input Divider Control\nRefer to the formulas below the table.\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUTDIV</name>
              <description>APLL0 Output Divider Control\nRefer to the formulas below the table.\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FRDIV</name>
              <description>APLL0 Fractional Divider Control\nRefer to the formulas below the table.\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>STBSEL</name>
              <description>APLL0 Stable Counter Selection\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>APLL0 stable time is 820 APLL0 source clock (source clock is equal to 4M)</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>APLL0 stable time is 2460 APLL0 source clock (4 MHz  source clock &#8804;12 MHz)</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>APLL0 stable time is 4920 APLL0 source clock (12 MHz  source clock &#8804;24 MHz)</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Reserved.</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>BP</name>
              <description>APLL0 Bypass Control\nNote: This bit is not retained when D2 power is turned off.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>APLL0 is in normal mode (default)</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>APLL0 clock output is same as APLL0 input clock FIN</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>PLLFEN</name>
              <description>APLL0 Clock Filter Enable Bit\nNote: This bit is not retained when D2 power is turned off.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>APLL0 Filter Disable</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>APLL0 Filter Enable</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CLK_APLL0SEL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CLK_APLL0SEL</displayName>
          <description>APLL0 Clock Source Select Control Register</description>
          <addressOffset>0x1C</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>APLLSRC</name>
              <description>APLL0 Source Clock Selection\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>APLL0 source clock from 4~24 MHz external high-speed crystal oscillator (HXT)</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>APLL0 source clock from 24~32 MHz external high-speed crystal oscillator (HXT/2)</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>APLL0 source clock from 12 MHz internal high-speed oscillator (HIRC)</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>APLL0 source clock from 48 MHz internal high-speed oscillator (HIRC48M/4)</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CLK_APLL1CTL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CLK_APLL1CTL</displayName>
          <description>APLL1 Control Register</description>
          <addressOffset>0x20</addressOffset>
          <access>read-only</access>
          <resetValue>0x80008422</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FBDIV</name>
              <description>APLL1 Feedback Divider Control\nRefer to the formulas below the table.\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INDIV</name>
              <description>APLL1 Input Divider Control\nRefer to the formulas below the table.\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUTDIV</name>
              <description>APLL1 Output Divider Control\nRefer to the formulas below the table.\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FRDIV</name>
              <description>APLL1 Fractional Divider Control\nRefer to the formulas below the table.\nNote: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>STBSEL</name>
              <description>APLL1 Stable Counter Selection\nNote 1: These bits are not retained when D2 power is turned off.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>APLL1 stable time is 820 APLL1 source clock (source clock is equal to 4M)</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>APLL1 stable time is 2460 APLL1 source clock (4 MHz  source clock &#8804;12 MHz)</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>APLL1 stable time is 4920 APLL1 source clock (12 MHz  source clock &#8804;24 MHz)</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Reserved.</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>BP</name>
              <description>APLL1 Bypass Control\nNote: This bit is not retained when D2 power is turned off.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>APLL1 is in normal mode (default)</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>APLL1 clock output is same as APLL1 input clock FIN</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>PLLFEN</name>
              <description>APLL1 Clock Filter Enable Bit\nNote: This bit is not retained when D2 power is turned off.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>APLL1 Filter Disable</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>APLL1 Filter Enable</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CLK_APLL1SEL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CLK_APLL1SEL</displayName>
          <description>APLL1 Clock Source Select Control Register</description>
          <addressOffset>0x24</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>APLLSRC</name>
              <description>APLL1 Source Clock Selection\nNote : These bits are not retained when D2 power is turned off.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>APLL1 source clock from 4~24 MHz external high-speed crystal oscillator (HXT)</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>APLL1 source clock from 24~32 MHz external high-speed crystal oscillator (HXT/2)</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>APLL1 source clock from 12 MHz internal high-speed oscillator (HIRC)</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>APLL1 source clock from 48 MHz internal high-speed oscillator (HIRC48M/4)</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CLK_ACMPCTL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CLK_ACMPCTL</displayName>
          <description>ACMP Clock Enable Control Register</description>
          <addressOffset>0x200</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ACMP01CKEN</name>
              <description>ACMP0/1 Clock Enable Bit\nNote: This bit is not retained when D0 power is turned off.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>ACMP0/1 clock Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>ACMP0/1 clock Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>ACMP23CKEN</name>
              <description>ACMP2/3 Clock Enable Bit\nNote: This bit is not retained when D0 power is turned off.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>ACMP2/3 clock Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>ACMP2/3 clock Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CLK_AWFCTL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CLK_AWFCTL</displayName>
          <description>AWF Clock Enable Control Register</description>
          <addressOffset>0x204</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AWF0CKEN</name>
              <description>AWFx Clock Enable Bit\nNote: This bit is not retained when D0 power is turned off.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>AWFx clock Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>AWFx clock Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
          </fields>
       </register>
