wosayttn/sdk-bsp-numaker-m55m1/Debug/svd/M55M1.svd
       <register derivedFrom="SCU_SRAM0MPCLUT0">
          <name>SCU_SRAM1MPCLUT0</name>
          <displayName>SCU_SRAM1MPCLUT0</displayName>
          <description>Security Attribute of memory blocks controlled by SRAM1MPC LUT0</description>
          <addressOffset>0x414</addressOffset>
       </register>
       <register derivedFrom="SCU_SRAM0MPCLUT0">
          <name>SCU_SRAM2MPCLUT0</name>
          <displayName>SCU_SRAM2MPCLUT0</displayName>
          <description>Security Attribute of memory blocks controlled by SRAM2MPC LUT0</description>
          <addressOffset>0x418</addressOffset>
       </register>
       <register derivedFrom="SCU_SRAM0MPCLUT0">
          <name>SCU_SRAM3MPCLUT0</name>
          <displayName>SCU_SRAM3MPCLUT0</displayName>
          <description>Security Attribute of memory blocks controlled by SRAM3MPC LUT0</description>
          <addressOffset>0x420</addressOffset>
       </register>
       <register derivedFrom="SCU_SRAM0MPCLUT0">
          <name>SCU_LPSRAMMPCLUT0</name>
          <displayName>SCU_LPSRAMMPCLUT0</displayName>
          <description>Security Attribute of memory blocks controlled by LPSRAMMPC LUT0</description>
          <addressOffset>0x424</addressOffset>
       </register>
       <register derivedFrom="SCU_SRAM0MPCLUT0">
          <name>SCU_SPIM0MPCLUT0</name>
          <displayName>SCU_SPIM0MPCLUT0</displayName>
          <description>Security Attribute of memory blocks controlled by SPIM0MPC LUT0</description>
          <addressOffset>0x430</addressOffset>
       </register>
       <register derivedFrom="SCU_SRAM0MPCLUT0">
          <name>SCU_SPIM0MPCLUT1</name>
          <displayName>SCU_SPIM0MPCLUT1</displayName>
          <description>Security Attribute of memory blocks controlled by SPIM0MPC LUT1</description>
          <addressOffset>0x434</addressOffset>
       </register>
       <register derivedFrom="SCU_SRAM0MPCLUT0">
          <name>SCU_SPIM0MPCLUT2</name>
          <displayName>SCU_SPIM0MPCLUT2</displayName>
          <description>Security Attribute of memory blocks controlled by SPIM0MPC LUT2</description>
          <addressOffset>0x438</addressOffset>
       </register>
       <register derivedFrom="SCU_SRAM0MPCLUT0">
          <name>SCU_SPIM0MPCLUT3</name>
          <displayName>SCU_SPIM0MPCLUT3</displayName>
          <description>Security Attribute of memory blocks controlled by SPIM0MPC LUT3</description>
          <addressOffset>0x43C</addressOffset>
       </register>
       <register derivedFrom="SCU_SRAM0MPCLUT0">
          <name>SCU_SPIM0MPCLUT4</name>
          <displayName>SCU_SPIM0MPCLUT4</displayName>
          <description>Security Attribute of memory blocks controlled by SPIM0MPC LUT4</description>
          <addressOffset>0x440</addressOffset>
       </register>
       <register derivedFrom="SCU_SRAM0MPCLUT0">
          <name>SCU_SPIM0MPCLUT5</name>
          <displayName>SCU_SPIM0MPCLUT5</displayName>
          <description>Security Attribute of memory blocks controlled by SPIM0MPC LUT5</description>
          <addressOffset>0x444</addressOffset>
       </register>
       <register derivedFrom="SCU_SRAM0MPCLUT0">
          <name>SCU_SPIM0MPCLUT6</name>
          <displayName>SCU_SPIM0MPCLUT6</displayName>
          <description>Security Attribute of memory blocks controlled by SPIM0MPC LUT6</description>
          <addressOffset>0x448</addressOffset>
       </register>
       <register derivedFrom="SCU_SRAM0MPCLUT0">
          <name>SCU_SPIM0MPCLUT7</name>
          <displayName>SCU_SPIM0MPCLUT7</displayName>
          <description>Security Attribute of memory blocks controlled by SPIM0MPC LUT7</description>
          <addressOffset>0x44C</addressOffset>
       </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>TRNG_NS</name>
      <description>TRNG Register Map</description>
      <groupName>TRNG</groupName>
      <baseAddress>0x50296000</baseAddress>
      <!-- d -> no access permission -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1C</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
       <register>
          <name>TRNG_CTL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>TRNG_CTL</displayName>
          <description>TRNG Control Register</description>
          <addressOffset>0x0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LDOEN</name>
              <description>LDO Enable Bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>LDO Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>LDO Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>NRST</name>
              <description>Negative-edge Trigger Reset</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Keep reset</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>No reset</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>TRNGEN</name>
              <description>True Random Number Generator Macro Enable Bit</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>TRNG macro Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>TRNG macro Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>START</name>
              <description>True Random Number Generator Start\nNote: Do not enable START and KATEN at the same time. This bit is always 0 when it is read back.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No effect</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Start TRNG</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>MODE</name>
              <description>Random Bit Generator Output Selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Output data is from entropy (32-bits)</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Output data is from NRBG (128-bits)</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>Output data is from DRBG (128-bits)</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Reserved.</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>INSTANT</name>
              <description>CTR_DRBG User Manual Instant Function</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No effect</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Enable CTR_DRBG instant function</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>RESEED</name>
              <description>CTR_DRBG User Manual Reseed Function</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No effect</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Enable CTR_DRBG reseed function</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>UPDATE</name>
              <description>CTR_DRBG User Manual Update Function</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No effect</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Enable CTR_DRBG update function</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>KATEN</name>
              <description>CTR_DRBG Known Answer Test Enable Bit\nNote: Do not enable START and KATEN at the same time.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>KATSEL</name>
              <description>CTR_DRBG Known Answer Test Selection</description>
              <bitOffset>25</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Instantiation testing</description>
                    <value>0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Reseed testing</description>
                    <value>1</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>Generation testing</description>
                    <value>2</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>ERRIEN</name>
              <description>TRNG Error Interrupt Enable Bit</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Error interrupt Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Error interrupt Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>DVIEN</name>
              <description>Data Valid Interrupt Enable Bit</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Interrupt Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Interrupt Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>TRNG_CFG</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>TRNG_CFG</displayName>
          <description>TRNG Configure Register</description>
          <addressOffset>0x4</addressOffset>
          <access>read-write</access>
          <resetValue>0xC2000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RESEED_INTERVAL</name>
              <description>Reseed Interval\nMaximum number of requests between reseeds.\nThe value is 1 ~ 225 .</description>
              <bitOffset>0</bitOffset>
              <bitWidth>26</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CTRLEN</name>
              <description>CTR_DRBG Bits Length Per Request</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>TRNG_STS</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>TRNG_STS</displayName>
          <description>TRNG Status Register</description>
          <addressOffset>0x8</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000060</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LDORDY</name>
              <description>LDO Ready Signal</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>LDO is not ready</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>LDO is ready</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>TRNGRDY</name>
              <description>TRNG Ready Signal</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>True random number generator is not ready</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>True random number generator is ready</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>ESSUT</name>
              <description>Entropy Source Start-Up Test</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Entropy source is still under testing or test fail</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Test pass</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>ESRCT</name>
              <description>Entropy Source Repetition Count Test</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Entropy source is still under testing or test fail</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Test pass</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>ESAPT</name>
              <description>Entropy Source Adaptive Proportion Test</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Entropy source is still under testing or test fail</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Test pass</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>KATPASS</name>
              <description>CTR_DRBG Known Answer Test Pass\nNote: When users enable KATEN, they can check this bit after DVIF become '1'.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Test fail</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Test pass</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>ERRIF</name>
              <description>TRNG Error Interrupt Flag</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No TRNG error</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>TRNGRDY became '0' for a while, TRNG error interrupt</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>DVIF</name>
              <description>Data Valid Interrupt Flag</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Data is invalid</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Data is valid. A valid random number can be read form TRNG_DATAx</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>TRNG_DATA0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>TRNG_DATA0</displayName>
          <description>TRNG Data Output Word 0 Register</description>
          <addressOffset>0xC</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA</name>
              <description>True Random Number Generator Data (Read Only)\nThe DATA stores the output data generated by TRNG, it can be read when DVIF become 1 and can be read only once.\nTRNG_DATA0 stores Entropy / NRBG word 0 / DRBG word 0.\nTRNG_DATA1 stores NRBG word 1 / DRBG word 1.\nTRNG_DATA2 stores NRBG word 2 / DRBG word 2.\nTRNG_DATA3 stores NRBG word 3 / DRBG word 3.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="TRNG_DATA0">
          <name>TRNG_DATA1</name>
          <displayName>TRNG_DATA1</displayName>
          <description>TRNG Data Output Word 1 Register</description>
          <addressOffset>0x10</addressOffset>
       </register>
       <register derivedFrom="TRNG_DATA0">
          <name>TRNG_DATA2</name>
          <displayName>TRNG_DATA2</displayName>
          <description>TRNG Data Output Word 2 Register</description>
          <addressOffset>0x14</addressOffset>
       </register>
       <register derivedFrom="TRNG_DATA0">
          <name>TRNG_DATA3</name>
          <displayName>TRNG_DATA3</displayName>
          <description>TRNG Data Output Word 3 Register</description>
          <addressOffset>0x18</addressOffset>
       </register>
