wosayttn/sdk-bsp-numaker-m55m1/Debug/svd/M55M1.svd
       <register derivedFrom="PA_DOUT">
          <name>PJ_DOUT</name>
          <displayName>PJ_DOUT</displayName>
          <description>PJ Data Output Value</description>
          <addressOffset>0x248</addressOffset>
       </register>
       <register derivedFrom="PA_DATMSK">
          <name>PJ_DATMSK</name>
          <displayName>PJ_DATMSK</displayName>
          <description>PJ Data Output Write Mask</description>
          <addressOffset>0x24C</addressOffset>
       </register>
       <register derivedFrom="PA_PIN">
          <name>PJ_PIN</name>
          <displayName>PJ_PIN</displayName>
          <description>PJ Pin Value</description>
          <addressOffset>0x250</addressOffset>
       </register>
       <register derivedFrom="PA_DBEN">
          <name>PJ_DBEN</name>
          <displayName>PJ_DBEN</displayName>
          <description>PJ De-bounce Enable Control Register</description>
          <addressOffset>0x254</addressOffset>
       </register>
       <register derivedFrom="PA_INTTYPE">
          <name>PJ_INTTYPE</name>
          <displayName>PJ_INTTYPE</displayName>
          <description>PJ Interrupt Trigger Type Control</description>
          <addressOffset>0x258</addressOffset>
       </register>
       <register derivedFrom="PA_INTEN">
          <name>PJ_INTEN</name>
          <displayName>PJ_INTEN</displayName>
          <description>PJ Interrupt Enable Control Register</description>
          <addressOffset>0x25C</addressOffset>
       </register>
       <register derivedFrom="PA_INTSRC">
          <name>PJ_INTSRC</name>
          <displayName>PJ_INTSRC</displayName>
          <description>PJ Interrupt Source Flag</description>
          <addressOffset>0x260</addressOffset>
       </register>
       <register derivedFrom="PA_SMTEN">
          <name>PJ_SMTEN</name>
          <displayName>PJ_SMTEN</displayName>
          <description>PJ Input Schmitt Trigger Enable Register</description>
          <addressOffset>0x264</addressOffset>
       </register>
       <register derivedFrom="PA_SLEWCTL">
          <name>PJ_SLEWCTL</name>
          <displayName>PJ_SLEWCTL</displayName>
          <description>PJ High Slew Rate Control Register</description>
          <addressOffset>0x268</addressOffset>
       </register>
       <register derivedFrom="PA_PUSEL">
          <name>PJ_PUSEL</name>
          <displayName>PJ_PUSEL</displayName>
          <description>PJ Pull-up and Pull-down Selection Register</description>
          <addressOffset>0x270</addressOffset>
       </register>
       <register derivedFrom="PA_DBCTL">
          <name>PJ_DBCTL</name>
          <displayName>PJ_DBCTL</displayName>
          <description>PJ Interrupt De-bounce Control Register</description>
          <addressOffset>0x274</addressOffset>
       </register>
       <register>
          <name>INT0_INNF</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>INT0_INNF</displayName>
          <description>INT0 Input Noise Filter Register</description>
          <addressOffset>0x440</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>NFEN</name>
              <description>Noise Filter Enable Bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Noise Filter function Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Noise Filter function Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>NFSEL</name>
              <description>Noise Filter Clock Selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Filter clock is HCLK0</description>
                    <value>#000</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Filter clock is HCLK0/2</description>
                    <value>#001</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>Filter clock is HCLK0/4</description>
                    <value>#010</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Filter clock is HCLK0/8</description>
                    <value>#011</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>4</name>
                    <description>Filter clock is HCLK0/16</description>
                    <value>#100</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>5</name>
                    <description>Filter clock is HCLK0/32</description>
                    <value>#101</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>6</name>
                    <description>Filter clock is HCLK0/64</description>
                    <value>#110</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>7</name>
                    <description>Filter clock is HCLK0/128</description>
                    <value>#111</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>NFCNT</name>
              <description>Noise Filter Count\nThe register bits control the filter counter to count from 0 to NFCNT.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>INT0_EDETCTL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>INT0_EDETCTL</displayName>
          <description>INT0 Edge Detect Control Register</description>
          <addressOffset>0x444</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EDETCTL</name>
              <description>INT Edge Detect Control Bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Not detect</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>INT low to high detection Enable</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>INT high to low detection Enable</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>INT both low to high and high to low detection Enable</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>INT0_EDINTEN</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>INT0_EDINTEN</displayName>
          <description>INT0 Edge Detect Interrupt Enable Control Register</description>
          <addressOffset>0x448</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EDIEN</name>
              <description>INT Edge Detect Interrupt Enable Bit\nNote: \nWrite 1 clear INTx_EDSTS after configuring EINT and then enable INTx_ EDINTEN.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>INT Edge Detect Interrupt Disable</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>INT Edge Detect Interrupt Enable</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>INT0_EDSTS</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>INT0_EDSTS</displayName>
          <description>INT0 Edge Detect Interrupt Flag Register</description>
          <addressOffset>0x44C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EDIF</name>
              <description>INT Edge Detect Interrupt Flag (Write 1 to Clear)\nNote 1: This bit is cleared by writing 1 to it.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No Edge Detection happened</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Rising Edge or Falling edge has been detected</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
       </register>
       <register derivedFrom="INT0_INNF">
          <name>INT1_INNF</name>
          <displayName>INT1_INNF</displayName>
          <description>INT1 Input Noise Filter Register</description>
          <addressOffset>0x460</addressOffset>
       </register>
       <register derivedFrom="INT0_EDETCTL">
          <name>INT1_EDETCTL</name>
          <displayName>INT1_EDETCTL</displayName>
          <description>INT1 Edge Detect Control Register</description>
          <addressOffset>0x464</addressOffset>
       </register>
       <register derivedFrom="INT0_EDINTEN">
          <name>INT1_EDINTEN</name>
          <displayName>INT1_EDINTEN</displayName>
          <description>INT1 Edge Detect Interrupt Enable Control Register</description>
          <addressOffset>0x468</addressOffset>
       </register>
       <register derivedFrom="INT0_EDSTS">
          <name>INT1_EDSTS</name>
          <displayName>INT1_EDSTS</displayName>
          <description>INT1 Edge Detect Interrupt Flag Register</description>
          <addressOffset>0x46C</addressOffset>
       </register>
       <register derivedFrom="INT0_INNF">
          <name>INT2_INNF</name>
          <displayName>INT2_INNF</displayName>
          <description>INT2 Input Noise Filter Register</description>
          <addressOffset>0x480</addressOffset>
       </register>
       <register derivedFrom="INT0_EDETCTL">
          <name>INT2_EDETCTL</name>
          <displayName>INT2_EDETCTL</displayName>
          <description>INT2 Edge Detect Control Register</description>
          <addressOffset>0x484</addressOffset>
       </register>
       <register derivedFrom="INT0_EDINTEN">
          <name>INT2_EDINTEN</name>
          <displayName>INT2_EDINTEN</displayName>
          <description>INT2 Edge Detect Interrupt Enable Control Register</description>
          <addressOffset>0x488</addressOffset>
       </register>
       <register derivedFrom="INT0_EDSTS">
          <name>INT2_EDSTS</name>
          <displayName>INT2_EDSTS</displayName>
          <description>INT2 Edge Detect Interrupt Flag Register</description>
          <addressOffset>0x48C</addressOffset>
       </register>
       <register derivedFrom="INT0_INNF">
          <name>INT3_INNF</name>
          <displayName>INT3_INNF</displayName>
          <description>INT3 Input Noise Filter Register</description>
          <addressOffset>0x4A0</addressOffset>
       </register>
       <register derivedFrom="INT0_EDETCTL">
          <name>INT3_EDETCTL</name>
          <displayName>INT3_EDETCTL</displayName>
          <description>INT3 Edge Detect Control Register</description>
          <addressOffset>0x4A4</addressOffset>
       </register>
       <register derivedFrom="INT0_EDINTEN">
          <name>INT3_EDINTEN</name>
          <displayName>INT3_EDINTEN</displayName>
          <description>INT3 Edge Detect Interrupt Enable Control Register</description>
          <addressOffset>0x4A8</addressOffset>
       </register>
       <register derivedFrom="INT0_EDSTS">
          <name>INT3_EDSTS</name>
          <displayName>INT3_EDSTS</displayName>
          <description>INT3 Edge Detect Interrupt Flag Register</description>
          <addressOffset>0x4AC</addressOffset>
       </register>
       <register derivedFrom="INT0_INNF">
          <name>INT4_INNF</name>
          <displayName>INT4_INNF</displayName>
          <description>INT4 Input Noise Filter Register</description>
          <addressOffset>0x4C0</addressOffset>
       </register>
       <register derivedFrom="INT0_EDETCTL">
          <name>INT4_EDETCTL</name>
          <displayName>INT4_EDETCTL</displayName>
          <description>INT4 Edge Detect Control Register</description>
          <addressOffset>0x4C4</addressOffset>
       </register>
       <register derivedFrom="INT0_EDINTEN">
          <name>INT4_EDINTEN</name>
          <displayName>INT4_EDINTEN</displayName>
          <description>INT4 Edge Detect Interrupt Enable Control Register</description>
          <addressOffset>0x4C8</addressOffset>
       </register>
       <register derivedFrom="INT0_EDSTS">
          <name>INT4_EDSTS</name>
          <displayName>INT4_EDSTS</displayName>
          <description>INT4 Edge Detect Interrupt Flag Register</description>
          <addressOffset>0x4CC</addressOffset>
       </register>
       <register derivedFrom="INT0_INNF">
          <name>INT5_INNF</name>
          <displayName>INT5_INNF</displayName>
          <description>INT5 Input Noise Filter Register</description>
          <addressOffset>0x4E0</addressOffset>
       </register>
       <register derivedFrom="INT0_EDETCTL">
          <name>INT5_EDETCTL</name>
          <displayName>INT5_EDETCTL</displayName>
          <description>INT5 Edge Detect Control Register</description>
          <addressOffset>0x4E4</addressOffset>
       </register>
       <register derivedFrom="INT0_EDINTEN">
          <name>INT5_EDINTEN</name>
          <displayName>INT5_EDINTEN</displayName>
          <description>INT5 Edge Detect Interrupt Enable Control Register</description>
          <addressOffset>0x4E8</addressOffset>
       </register>
       <register derivedFrom="INT0_EDSTS">
          <name>INT5_EDSTS</name>
          <displayName>INT5_EDSTS</displayName>
          <description>INT5 Edge Detect Interrupt Flag Register</description>
          <addressOffset>0x4EC</addressOffset>
       </register>
       <register derivedFrom="INT0_INNF">
          <name>INT6_INNF</name>
          <displayName>INT6_INNF</displayName>
          <description>INT6 Input Noise Filter Register</description>
          <addressOffset>0x500</addressOffset>
       </register>
       <register derivedFrom="INT0_EDETCTL">
          <name>INT6_EDETCTL</name>
          <displayName>INT6_EDETCTL</displayName>
          <description>INT6 Edge Detect Control Register</description>
          <addressOffset>0x504</addressOffset>
       </register>
       <register derivedFrom="INT0_EDINTEN">
          <name>INT6_EDINTEN</name>
          <displayName>INT6_EDINTEN</displayName>
          <description>INT6 Edge Detect Interrupt Enable Control Register</description>
          <addressOffset>0x508</addressOffset>
       </register>
       <register derivedFrom="INT0_EDSTS">
          <name>INT6_EDSTS</name>
          <displayName>INT6_EDSTS</displayName>
          <description>INT6 Edge Detect Interrupt Flag Register</description>
          <addressOffset>0x50C</addressOffset>
       </register>
       <register derivedFrom="INT0_INNF">
          <name>INT7_INNF</name>
          <displayName>INT7_INNF</displayName>
          <description>INT7 Input Noise Filter Register</description>
          <addressOffset>0x520</addressOffset>
       </register>
       <register derivedFrom="INT0_EDETCTL">
          <name>INT7_EDETCTL</name>
          <displayName>INT7_EDETCTL</displayName>
          <description>INT7 Edge Detect Control Register</description>
          <addressOffset>0x524</addressOffset>
       </register>
       <register derivedFrom="INT0_EDINTEN">
          <name>INT7_EDINTEN</name>
          <displayName>INT7_EDINTEN</displayName>
          <description>INT7 Edge Detect Interrupt Enable Control Register</description>
          <addressOffset>0x528</addressOffset>
       </register>
       <register derivedFrom="INT0_EDSTS">
          <name>INT7_EDSTS</name>
          <displayName>INT7_EDSTS</displayName>
          <description>INT7 Edge Detect Interrupt Flag Register</description>
          <addressOffset>0x52C</addressOffset>
       </register>
       <register>
          <name>PA0_PDIO</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PA0_PDIO</displayName>
          <description>GPIO PA.n Pin Data Input/Output Register</description>
          <addressOffset>0x800</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFF0</resetMask>
          <fields>
            <field>
              <name>PDIO</name>
              <description>GPIO Px.n Pin Data Input/Output\nWriting this bit can control one GPIO pin output value.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Corresponding GPIO pin set to low</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Corresponding GPIO pin set to high</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PA1_PDIO</name>
          <displayName>PA1_PDIO</displayName>
          <description>GPIO PA.n Pin Data Input/Output Register</description>
          <addressOffset>0x804</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PA2_PDIO</name>
          <displayName>PA2_PDIO</displayName>
          <description>GPIO PA.n Pin Data Input/Output Register</description>
          <addressOffset>0x808</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PA3_PDIO</name>
          <displayName>PA3_PDIO</displayName>
          <description>GPIO PA.n Pin Data Input/Output Register</description>
          <addressOffset>0x80C</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PA4_PDIO</name>
          <displayName>PA4_PDIO</displayName>
          <description>GPIO PA.n Pin Data Input/Output Register</description>
          <addressOffset>0x810</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PA5_PDIO</name>
          <displayName>PA5_PDIO</displayName>
          <description>GPIO PA.n Pin Data Input/Output Register</description>
          <addressOffset>0x814</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PA6_PDIO</name>
          <displayName>PA6_PDIO</displayName>
          <description>GPIO PA.n Pin Data Input/Output Register</description>
          <addressOffset>0x818</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PA7_PDIO</name>
          <displayName>PA7_PDIO</displayName>
          <description>GPIO PA.n Pin Data Input/Output Register</description>
          <addressOffset>0x81C</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PA8_PDIO</name>
          <displayName>PA8_PDIO</displayName>
          <description>GPIO PA.n Pin Data Input/Output Register</description>
          <addressOffset>0x820</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PA9_PDIO</name>
          <displayName>PA9_PDIO</displayName>
          <description>GPIO PA.n Pin Data Input/Output Register</description>
          <addressOffset>0x824</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PA10_PDIO</name>
          <displayName>PA10_PDIO</displayName>
          <description>GPIO PA.n Pin Data Input/Output Register</description>
          <addressOffset>0x828</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PA11_PDIO</name>
          <displayName>PA11_PDIO</displayName>
          <description>GPIO PA.n Pin Data Input/Output Register</description>
          <addressOffset>0x82C</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PA12_PDIO</name>
          <displayName>PA12_PDIO</displayName>
          <description>GPIO PA.n Pin Data Input/Output Register</description>
          <addressOffset>0x830</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PA13_PDIO</name>
          <displayName>PA13_PDIO</displayName>
          <description>GPIO PA.n Pin Data Input/Output Register</description>
          <addressOffset>0x834</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PA14_PDIO</name>
          <displayName>PA14_PDIO</displayName>
          <description>GPIO PA.n Pin Data Input/Output Register</description>
          <addressOffset>0x838</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PA15_PDIO</name>
          <displayName>PA15_PDIO</displayName>
          <description>GPIO PA.n Pin Data Input/Output Register</description>
          <addressOffset>0x83C</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PB0_PDIO</name>
          <displayName>PB0_PDIO</displayName>
          <description>GPIO PB.n Pin Data Input/Output Register</description>
          <addressOffset>0x840</addressOffset>
       </register>
