wosayttn/sdk-bsp-numaker-m55m1/Debug/svd/M55M1.svd
       <register derivedFrom="PG0_PDIO">
          <name>PG1_PDIO</name>
          <displayName>PG1_PDIO</displayName>
          <description>GPIO PG.n Pin Data Input/Output Register</description>
          <addressOffset>0x984</addressOffset>
       </register>
       <register derivedFrom="PG0_PDIO">
          <name>PG2_PDIO</name>
          <displayName>PG2_PDIO</displayName>
          <description>GPIO PG.n Pin Data Input/Output Register</description>
          <addressOffset>0x988</addressOffset>
       </register>
       <register derivedFrom="PG0_PDIO">
          <name>PG3_PDIO</name>
          <displayName>PG3_PDIO</displayName>
          <description>GPIO PG.n Pin Data Input/Output Register</description>
          <addressOffset>0x98C</addressOffset>
       </register>
       <register derivedFrom="PG0_PDIO">
          <name>PG4_PDIO</name>
          <displayName>PG4_PDIO</displayName>
          <description>GPIO PG.n Pin Data Input/Output Register</description>
          <addressOffset>0x990</addressOffset>
       </register>
       <register derivedFrom="PG0_PDIO">
          <name>PG5_PDIO</name>
          <displayName>PG5_PDIO</displayName>
          <description>GPIO PG.n Pin Data Input/Output Register</description>
          <addressOffset>0x994</addressOffset>
       </register>
       <register derivedFrom="PG0_PDIO">
          <name>PG6_PDIO</name>
          <displayName>PG6_PDIO</displayName>
          <description>GPIO PG.n Pin Data Input/Output Register</description>
          <addressOffset>0x998</addressOffset>
       </register>
       <register derivedFrom="PG0_PDIO">
          <name>PG7_PDIO</name>
          <displayName>PG7_PDIO</displayName>
          <description>GPIO PG.n Pin Data Input/Output Register</description>
          <addressOffset>0x99C</addressOffset>
       </register>
       <register derivedFrom="PG0_PDIO">
          <name>PG8_PDIO</name>
          <displayName>PG8_PDIO</displayName>
          <description>GPIO PG.n Pin Data Input/Output Register</description>
          <addressOffset>0x9A0</addressOffset>
       </register>
       <register derivedFrom="PG0_PDIO">
          <name>PG9_PDIO</name>
          <displayName>PG9_PDIO</displayName>
          <description>GPIO PG.n Pin Data Input/Output Register</description>
          <addressOffset>0x9A4</addressOffset>
       </register>
       <register derivedFrom="PG0_PDIO">
          <name>PG10_PDIO</name>
          <displayName>PG10_PDIO</displayName>
          <description>GPIO PG.n Pin Data Input/Output Register</description>
          <addressOffset>0x9A8</addressOffset>
       </register>
       <register derivedFrom="PG0_PDIO">
          <name>PG11_PDIO</name>
          <displayName>PG11_PDIO</displayName>
          <description>GPIO PG.n Pin Data Input/Output Register</description>
          <addressOffset>0x9AC</addressOffset>
       </register>
       <register derivedFrom="PG0_PDIO">
          <name>PG12_PDIO</name>
          <displayName>PG12_PDIO</displayName>
          <description>GPIO PG.n Pin Data Input/Output Register</description>
          <addressOffset>0x9B0</addressOffset>
       </register>
       <register derivedFrom="PG0_PDIO">
          <name>PG13_PDIO</name>
          <displayName>PG13_PDIO</displayName>
          <description>GPIO PG.n Pin Data Input/Output Register</description>
          <addressOffset>0x9B4</addressOffset>
       </register>
       <register derivedFrom="PG0_PDIO">
          <name>PG14_PDIO</name>
          <displayName>PG14_PDIO</displayName>
          <description>GPIO PG.n Pin Data Input/Output Register</description>
          <addressOffset>0x9B8</addressOffset>
       </register>
       <register derivedFrom="PG0_PDIO">
          <name>PG15_PDIO</name>
          <displayName>PG15_PDIO</displayName>
          <description>GPIO PG.n Pin Data Input/Output Register</description>
          <addressOffset>0x9BC</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PH0_PDIO</name>
          <displayName>PH0_PDIO</displayName>
          <description>GPIO PH.n Pin Data Input/Output Register</description>
          <addressOffset>0x9C0</addressOffset>
       </register>
       <register derivedFrom="PH0_PDIO">
          <name>PH1_PDIO</name>
          <displayName>PH1_PDIO</displayName>
          <description>GPIO PH.n Pin Data Input/Output Register</description>
          <addressOffset>0x9C4</addressOffset>
       </register>
       <register derivedFrom="PH0_PDIO">
          <name>PH2_PDIO</name>
          <displayName>PH2_PDIO</displayName>
          <description>GPIO PH.n Pin Data Input/Output Register</description>
          <addressOffset>0x9C8</addressOffset>
       </register>
       <register derivedFrom="PH0_PDIO">
          <name>PH3_PDIO</name>
          <displayName>PH3_PDIO</displayName>
          <description>GPIO PH.n Pin Data Input/Output Register</description>
          <addressOffset>0x9CC</addressOffset>
       </register>
       <register derivedFrom="PH0_PDIO">
          <name>PH4_PDIO</name>
          <displayName>PH4_PDIO</displayName>
          <description>GPIO PH.n Pin Data Input/Output Register</description>
          <addressOffset>0x9D0</addressOffset>
       </register>
       <register derivedFrom="PH0_PDIO">
          <name>PH5_PDIO</name>
          <displayName>PH5_PDIO</displayName>
          <description>GPIO PH.n Pin Data Input/Output Register</description>
          <addressOffset>0x9D4</addressOffset>
       </register>
       <register derivedFrom="PH0_PDIO">
          <name>PH6_PDIO</name>
          <displayName>PH6_PDIO</displayName>
          <description>GPIO PH.n Pin Data Input/Output Register</description>
          <addressOffset>0x9D8</addressOffset>
       </register>
       <register derivedFrom="PH0_PDIO">
          <name>PH7_PDIO</name>
          <displayName>PH7_PDIO</displayName>
          <description>GPIO PH.n Pin Data Input/Output Register</description>
          <addressOffset>0x9DC</addressOffset>
       </register>
       <register derivedFrom="PH0_PDIO">
          <name>PH8_PDIO</name>
          <displayName>PH8_PDIO</displayName>
          <description>GPIO PH.n Pin Data Input/Output Register</description>
          <addressOffset>0x9E0</addressOffset>
       </register>
       <register derivedFrom="PH0_PDIO">
          <name>PH9_PDIO</name>
          <displayName>PH9_PDIO</displayName>
          <description>GPIO PH.n Pin Data Input/Output Register</description>
          <addressOffset>0x9E4</addressOffset>
       </register>
       <register derivedFrom="PH0_PDIO">
          <name>PH10_PDIO</name>
          <displayName>PH10_PDIO</displayName>
          <description>GPIO PH.n Pin Data Input/Output Register</description>
          <addressOffset>0x9E8</addressOffset>
       </register>
       <register derivedFrom="PH0_PDIO">
          <name>PH11_PDIO</name>
          <displayName>PH11_PDIO</displayName>
          <description>GPIO PH.n Pin Data Input/Output Register</description>
          <addressOffset>0x9EC</addressOffset>
       </register>
       <register derivedFrom="PH0_PDIO">
          <name>PH12_PDIO</name>
          <displayName>PH12_PDIO</displayName>
          <description>GPIO PH.n Pin Data Input/Output Register</description>
          <addressOffset>0x9F0</addressOffset>
       </register>
       <register derivedFrom="PH0_PDIO">
          <name>PH13_PDIO</name>
          <displayName>PH13_PDIO</displayName>
          <description>GPIO PH.n Pin Data Input/Output Register</description>
          <addressOffset>0x9F4</addressOffset>
       </register>
       <register derivedFrom="PH0_PDIO">
          <name>PH14_PDIO</name>
          <displayName>PH14_PDIO</displayName>
          <description>GPIO PH.n Pin Data Input/Output Register</description>
          <addressOffset>0x9F8</addressOffset>
       </register>
       <register derivedFrom="PH0_PDIO">
          <name>PH15_PDIO</name>
          <displayName>PH15_PDIO</displayName>
          <description>GPIO PH.n Pin Data Input/Output Register</description>
          <addressOffset>0x9FC</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PI6_PDIO</name>
          <displayName>PI6_PDIO</displayName>
          <description>GPIO PI.n Pin Data Input/Output Register</description>
          <addressOffset>0xA18</addressOffset>
       </register>
       <register derivedFrom="PI6_PDIO">
          <name>PI7_PDIO</name>
          <displayName>PI7_PDIO</displayName>
          <description>GPIO PI.n Pin Data Input/Output Register</description>
          <addressOffset>0xA1C</addressOffset>
       </register>
       <register derivedFrom="PI6_PDIO">
          <name>PI8_PDIO</name>
          <displayName>PI8_PDIO</displayName>
          <description>GPIO PI.n Pin Data Input/Output Register</description>
          <addressOffset>0xA20</addressOffset>
       </register>
       <register derivedFrom="PI6_PDIO">
          <name>PI9_PDIO</name>
          <displayName>PI9_PDIO</displayName>
          <description>GPIO PI.n Pin Data Input/Output Register</description>
          <addressOffset>0xA24</addressOffset>
       </register>
       <register derivedFrom="PI6_PDIO">
          <name>PI10_PDIO</name>
          <displayName>PI10_PDIO</displayName>
          <description>GPIO PI.n Pin Data Input/Output Register</description>
          <addressOffset>0xA28</addressOffset>
       </register>
       <register derivedFrom="PI6_PDIO">
          <name>PI11_PDIO</name>
          <displayName>PI11_PDIO</displayName>
          <description>GPIO PI.n Pin Data Input/Output Register</description>
          <addressOffset>0xA2C</addressOffset>
       </register>
       <register derivedFrom="PI6_PDIO">
          <name>PI12_PDIO</name>
          <displayName>PI12_PDIO</displayName>
          <description>GPIO PI.n Pin Data Input/Output Register</description>
          <addressOffset>0xA30</addressOffset>
       </register>
       <register derivedFrom="PI6_PDIO">
          <name>PI13_PDIO</name>
          <displayName>PI13_PDIO</displayName>
          <description>GPIO PI.n Pin Data Input/Output Register</description>
          <addressOffset>0xA34</addressOffset>
       </register>
       <register derivedFrom="PI6_PDIO">
          <name>PI14_PDIO</name>
          <displayName>PI14_PDIO</displayName>
          <description>GPIO PI.n Pin Data Input/Output Register</description>
          <addressOffset>0xA38</addressOffset>
       </register>
       <register derivedFrom="PI6_PDIO">
          <name>PI15_PDIO</name>
          <displayName>PI15_PDIO</displayName>
          <description>GPIO PI.n Pin Data Input/Output Register</description>
          <addressOffset>0xA3C</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PJ0_PDIO</name>
          <displayName>PJ0_PDIO</displayName>
          <description>GPIO PJ.n Pin Data Input/Output Register</description>
          <addressOffset>0xA40</addressOffset>
       </register>
       <register derivedFrom="PJ0_PDIO">
          <name>PJ1_PDIO</name>
          <displayName>PJ1_PDIO</displayName>
          <description>GPIO PJ.n Pin Data Input/Output Register</description>
          <addressOffset>0xA44</addressOffset>
       </register>
       <register derivedFrom="PJ0_PDIO">
          <name>PJ2_PDIO</name>
          <displayName>PJ2_PDIO</displayName>
          <description>GPIO PJ.n Pin Data Input/Output Register</description>
          <addressOffset>0xA48</addressOffset>
       </register>
       <register derivedFrom="PJ0_PDIO">
          <name>PJ3_PDIO</name>
          <displayName>PJ3_PDIO</displayName>
          <description>GPIO PJ.n Pin Data Input/Output Register</description>
          <addressOffset>0xA4C</addressOffset>
       </register>
       <register derivedFrom="PJ0_PDIO">
          <name>PJ4_PDIO</name>
          <displayName>PJ4_PDIO</displayName>
          <description>GPIO PJ.n Pin Data Input/Output Register</description>
          <addressOffset>0xA50</addressOffset>
       </register>
       <register derivedFrom="PJ0_PDIO">
          <name>PJ5_PDIO</name>
          <displayName>PJ5_PDIO</displayName>
          <description>GPIO PJ.n Pin Data Input/Output Register</description>
          <addressOffset>0xA54</addressOffset>
       </register>
       <register derivedFrom="PJ0_PDIO">
          <name>PJ6_PDIO</name>
          <displayName>PJ6_PDIO</displayName>
          <description>GPIO PJ.n Pin Data Input/Output Register</description>
          <addressOffset>0xA58</addressOffset>
       </register>
       <register derivedFrom="PJ0_PDIO">
          <name>PJ7_PDIO</name>
          <displayName>PJ7_PDIO</displayName>
          <description>GPIO PJ.n Pin Data Input/Output Register</description>
          <addressOffset>0xA5C</addressOffset>
       </register>
       <register derivedFrom="PJ0_PDIO">
          <name>PJ8_PDIO</name>
          <displayName>PJ8_PDIO</displayName>
          <description>GPIO PJ.n Pin Data Input/Output Register</description>
          <addressOffset>0xA60</addressOffset>
       </register>
       <register derivedFrom="PJ0_PDIO">
          <name>PJ9_PDIO</name>
          <displayName>PJ9_PDIO</displayName>
          <description>GPIO PJ.n Pin Data Input/Output Register</description>
          <addressOffset>0xA64</addressOffset>
       </register>
       <register derivedFrom="PJ0_PDIO">
          <name>PJ10_PDIO</name>
          <displayName>PJ10_PDIO</displayName>
          <description>GPIO PJ.n Pin Data Input/Output Register</description>
          <addressOffset>0xA68</addressOffset>
       </register>
       <register derivedFrom="PJ0_PDIO">
          <name>PJ11_PDIO</name>
          <displayName>PJ11_PDIO</displayName>
          <description>GPIO PJ.n Pin Data Input/Output Register</description>
          <addressOffset>0xA6C</addressOffset>
       </register>
       <register derivedFrom="PJ0_PDIO">
          <name>PJ12_PDIO</name>
          <displayName>PJ12_PDIO</displayName>
          <description>GPIO PJ.n Pin Data Input/Output Register</description>
          <addressOffset>0xA70</addressOffset>
       </register>
       <register derivedFrom="PJ0_PDIO">
          <name>PJ13_PDIO</name>
          <displayName>PJ13_PDIO</displayName>
          <description>GPIO PJ.n Pin Data Input/Output Register</description>
          <addressOffset>0xA74</addressOffset>
       </register>
