wosayttn/sdk-bsp-numaker-m55m1/Debug/svd/M55M1.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>LPGPIO_NS</name>
      <description>LPGPIO Register Map</description>
      <groupName>LPGPIO</groupName>
      <baseAddress>0x50403000</baseAddress>
      <!-- d -> no access permission -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x14</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
       <register>
          <name>LPGPIO_MODE</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>LPGPIO_MODE</displayName>
          <description>LPIOn Mode Control</description>
          <addressOffset>0x0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MODE0</name>
              <description>LPIOn I/O Pin Mode Control\nDetermine each I/O mode of LPIOn pins.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>LPIOn is in Input mode</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>LPIOn is in Push-pull Output mode</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>MODE1</name>
              <description>LPIOn I/O Pin Mode Control\nDetermine each I/O mode of LPIOn pins.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>LPIOn is in Input mode</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>LPIOn is in Push-pull Output mode</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>MODE2</name>
              <description>LPIOn I/O Pin Mode Control\nDetermine each I/O mode of LPIOn pins.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>LPIOn is in Input mode</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>LPIOn is in Push-pull Output mode</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>MODE3</name>
              <description>LPIOn I/O Pin Mode Control\nDetermine each I/O mode of LPIOn pins.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>LPIOn is in Input mode</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>LPIOn is in Push-pull Output mode</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>MODE4</name>
              <description>LPIOn I/O Pin Mode Control\nDetermine each I/O mode of LPIOn pins.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>LPIOn is in Input mode</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>LPIOn is in Push-pull Output mode</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>MODE5</name>
              <description>LPIOn I/O Pin Mode Control\nDetermine each I/O mode of LPIOn pins.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>LPIOn is in Input mode</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>LPIOn is in Push-pull Output mode</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>MODE6</name>
              <description>LPIOn I/O Pin Mode Control\nDetermine each I/O mode of LPIOn pins.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>LPIOn is in Input mode</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>LPIOn is in Push-pull Output mode</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>MODE7</name>
              <description>LPIOn I/O Pin Mode Control\nDetermine each I/O mode of LPIOn pins.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>LPIOn is in Input mode</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>LPIOn is in Push-pull Output mode</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>LPPDMA_EN</name>
              <description>LPPDMA Enable Bit\nThis bit is used to enable LPPDMA to access LPGPIO when chip is in NPD0/1/3.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>LPPDMA can't access LPGPIO when chip is in NPD0/1/3</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>LPPDMA can access LPGPIO when chip is in NPD0/1/3</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>LPGPIO_DOUT</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>LPGPIO_DOUT</displayName>
          <description>LPIOn Data Output Value</description>
          <addressOffset>0x4</addressOffset>
          <access>read-write</access>
          <resetValue>0x000000FF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DOUT0</name>
              <description>LPIOn Output Value\nEach of these bits controls the status of a LPIOn pin when the LPIOn is configured as Push-pull output mode.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>LPIOn will drive Low if the LPIOn pin is configured as Push-pull output mode</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>LPIOn will drive High if the LPIOn pin is configured as Push-pull output mode</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>DOUT1</name>
              <description>LPIOn Output Value\nEach of these bits controls the status of a LPIOn pin when the LPIOn is configured as Push-pull output mode.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>LPIOn will drive Low if the LPIOn pin is configured as Push-pull output mode</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>LPIOn will drive High if the LPIOn pin is configured as Push-pull output mode</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>DOUT2</name>
              <description>LPIOn Output Value\nEach of these bits controls the status of a LPIOn pin when the LPIOn is configured as Push-pull output mode.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>LPIOn will drive Low if the LPIOn pin is configured as Push-pull output mode</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>LPIOn will drive High if the LPIOn pin is configured as Push-pull output mode</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>DOUT3</name>
              <description>LPIOn Output Value\nEach of these bits controls the status of a LPIOn pin when the LPIOn is configured as Push-pull output mode.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>LPIOn will drive Low if the LPIOn pin is configured as Push-pull output mode</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>LPIOn will drive High if the LPIOn pin is configured as Push-pull output mode</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>DOUT4</name>
              <description>LPIOn Output Value\nEach of these bits controls the status of a LPIOn pin when the LPIOn is configured as Push-pull output mode.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>LPIOn will drive Low if the LPIOn pin is configured as Push-pull output mode</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>LPIOn will drive High if the LPIOn pin is configured as Push-pull output mode</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>DOUT5</name>
              <description>LPIOn Output Value\nEach of these bits controls the status of a LPIOn pin when the LPIOn is configured as Push-pull output mode.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>LPIOn will drive Low if the LPIOn pin is configured as Push-pull output mode</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>LPIOn will drive High if the LPIOn pin is configured as Push-pull output mode</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>DOUT6</name>
              <description>LPIOn Output Value\nEach of these bits controls the status of a LPIOn pin when the LPIOn is configured as Push-pull output mode.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>LPIOn will drive Low if the LPIOn pin is configured as Push-pull output mode</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>LPIOn will drive High if the LPIOn pin is configured as Push-pull output mode</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>DOUT7</name>
              <description>LPIOn Output Value\nEach of these bits controls the status of a LPIOn pin when the LPIOn is configured as Push-pull output mode.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>LPIOn will drive Low if the LPIOn pin is configured as Push-pull output mode</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>LPIOn will drive High if the LPIOn pin is configured as Push-pull output mode</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>LPGPIO_PIN</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>LPGPIO_PIN</displayName>
          <description>LPIOn Pin Value</description>
          <addressOffset>0x8</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFF00</resetMask>
          <fields>
            <field>
              <name>PIN0</name>
              <description>LPIOn Pin Value\nEach bit of the register reflects the actual status of the respective Pn pin. If the bit is 1, it indicates the corresponding pin status is high; else the pin status is low.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PIN1</name>
              <description>LPIOn Pin Value\nEach bit of the register reflects the actual status of the respective Pn pin. If the bit is 1, it indicates the corresponding pin status is high; else the pin status is low.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PIN2</name>
              <description>LPIOn Pin Value\nEach bit of the register reflects the actual status of the respective Pn pin. If the bit is 1, it indicates the corresponding pin status is high; else the pin status is low.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PIN3</name>
              <description>LPIOn Pin Value\nEach bit of the register reflects the actual status of the respective Pn pin. If the bit is 1, it indicates the corresponding pin status is high; else the pin status is low.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PIN4</name>
              <description>LPIOn Pin Value\nEach bit of the register reflects the actual status of the respective Pn pin. If the bit is 1, it indicates the corresponding pin status is high; else the pin status is low.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PIN5</name>
              <description>LPIOn Pin Value\nEach bit of the register reflects the actual status of the respective Pn pin. If the bit is 1, it indicates the corresponding pin status is high; else the pin status is low.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PIN6</name>
              <description>LPIOn Pin Value\nEach bit of the register reflects the actual status of the respective Pn pin. If the bit is 1, it indicates the corresponding pin status is high; else the pin status is low.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PIN7</name>
              <description>LPIOn Pin Value\nEach bit of the register reflects the actual status of the respective Pn pin. If the bit is 1, it indicates the corresponding pin status is high; else the pin status is low.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
