wosayttn/sdk-bsp-numaker-m55m1/Debug/svd/M55M1.svd
       <register>
          <name>LPGPIO_DSRST</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>LPGPIO_DSRST</displayName>
          <description>LPIOn Data Output Set and Reset Control</description>
          <addressOffset>0xC</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DSET0</name>
              <description>LPIOn Data Ouput Set Control (Write Only)\nWriting 1 to each bit can set LPIOn pin output data to 1.\nNote 1: This bit field is write only, reading this field will response with 0.\nNote 2: If DRESET[n] and DSET[n] are both set, DSET[n] has higher pirority.\nNote 3: Writing 1 to DSET[n] will make DOUT[n] reflect the set value.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No action</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Reset LPIOn to 1</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>write-only</access>
            </field>
            <field>
              <name>DSET1</name>
              <description>LPIOn Data Ouput Set Control (Write Only)\nWriting 1 to each bit can set LPIOn pin output data to 1.\nNote 1: This bit field is write only, reading this field will response with 0.\nNote 2: If DRESET[n] and DSET[n] are both set, DSET[n] has higher pirority.\nNote 3: Writing 1 to DSET[n] will make DOUT[n] reflect the set value.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No action</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Reset LPIOn to 1</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>write-only</access>
            </field>
            <field>
              <name>DSET2</name>
              <description>LPIOn Data Ouput Set Control (Write Only)\nWriting 1 to each bit can set LPIOn pin output data to 1.\nNote 1: This bit field is write only, reading this field will response with 0.\nNote 2: If DRESET[n] and DSET[n] are both set, DSET[n] has higher pirority.\nNote 3: Writing 1 to DSET[n] will make DOUT[n] reflect the set value.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No action</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Reset LPIOn to 1</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>write-only</access>
            </field>
            <field>
              <name>DSET3</name>
              <description>LPIOn Data Ouput Set Control (Write Only)\nWriting 1 to each bit can set LPIOn pin output data to 1.\nNote 1: This bit field is write only, reading this field will response with 0.\nNote 2: If DRESET[n] and DSET[n] are both set, DSET[n] has higher pirority.\nNote 3: Writing 1 to DSET[n] will make DOUT[n] reflect the set value.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No action</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Reset LPIOn to 1</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>write-only</access>
            </field>
            <field>
              <name>DSET4</name>
              <description>LPIOn Data Ouput Set Control (Write Only)\nWriting 1 to each bit can set LPIOn pin output data to 1.\nNote 1: This bit field is write only, reading this field will response with 0.\nNote 2: If DRESET[n] and DSET[n] are both set, DSET[n] has higher pirority.\nNote 3: Writing 1 to DSET[n] will make DOUT[n] reflect the set value.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No action</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Reset LPIOn to 1</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>write-only</access>
            </field>
            <field>
              <name>DSET5</name>
              <description>LPIOn Data Ouput Set Control (Write Only)\nWriting 1 to each bit can set LPIOn pin output data to 1.\nNote 1: This bit field is write only, reading this field will response with 0.\nNote 2: If DRESET[n] and DSET[n] are both set, DSET[n] has higher pirority.\nNote 3: Writing 1 to DSET[n] will make DOUT[n] reflect the set value.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No action</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Reset LPIOn to 1</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>write-only</access>
            </field>
            <field>
              <name>DSET6</name>
              <description>LPIOn Data Ouput Set Control (Write Only)\nWriting 1 to each bit can set LPIOn pin output data to 1.\nNote 1: This bit field is write only, reading this field will response with 0.\nNote 2: If DRESET[n] and DSET[n] are both set, DSET[n] has higher pirority.\nNote 3: Writing 1 to DSET[n] will make DOUT[n] reflect the set value.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No action</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Reset LPIOn to 1</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>write-only</access>
            </field>
            <field>
              <name>DSET7</name>
              <description>LPIOn Data Ouput Set Control (Write Only)\nWriting 1 to each bit can set LPIOn pin output data to 1.\nNote 1: This bit field is write only, reading this field will response with 0.\nNote 2: If DRESET[n] and DSET[n] are both set, DSET[n] has higher pirority.\nNote 3: Writing 1 to DSET[n] will make DOUT[n] reflect the set value.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No action</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Reset LPIOn to 1</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>write-only</access>
            </field>
            <field>
              <name>DRESET0</name>
              <description>LPIOn Data Ouput Reset Control (Write Only)\nWriting 1 to each bit can reset LPIOn pin output data to 0.\nNote 1: This bit field is write only, reading this field will response with 0.\nNote 2: If DRESET[n] and DSET[n] are both set, DSET[n] has higher pirority.\nNote 3: Writing 1 to DRESET[n] will make DOUT[n] reflect the reset value.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No action</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Reset LPIOn to 0</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>write-only</access>
            </field>
            <field>
              <name>DRESET1</name>
              <description>LPIOn Data Ouput Reset Control (Write Only)\nWriting 1 to each bit can reset LPIOn pin output data to 0.\nNote 1: This bit field is write only, reading this field will response with 0.\nNote 2: If DRESET[n] and DSET[n] are both set, DSET[n] has higher pirority.\nNote 3: Writing 1 to DRESET[n] will make DOUT[n] reflect the reset value.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No action</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Reset LPIOn to 0</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>write-only</access>
            </field>
            <field>
              <name>DRESET2</name>
              <description>LPIOn Data Ouput Reset Control (Write Only)\nWriting 1 to each bit can reset LPIOn pin output data to 0.\nNote 1: This bit field is write only, reading this field will response with 0.\nNote 2: If DRESET[n] and DSET[n] are both set, DSET[n] has higher pirority.\nNote 3: Writing 1 to DRESET[n] will make DOUT[n] reflect the reset value.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No action</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Reset LPIOn to 0</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>write-only</access>
            </field>
            <field>
              <name>DRESET3</name>
              <description>LPIOn Data Ouput Reset Control (Write Only)\nWriting 1 to each bit can reset LPIOn pin output data to 0.\nNote 1: This bit field is write only, reading this field will response with 0.\nNote 2: If DRESET[n] and DSET[n] are both set, DSET[n] has higher pirority.\nNote 3: Writing 1 to DRESET[n] will make DOUT[n] reflect the reset value.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No action</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Reset LPIOn to 0</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>write-only</access>
            </field>
            <field>
              <name>DRESET4</name>
              <description>LPIOn Data Ouput Reset Control (Write Only)\nWriting 1 to each bit can reset LPIOn pin output data to 0.\nNote 1: This bit field is write only, reading this field will response with 0.\nNote 2: If DRESET[n] and DSET[n] are both set, DSET[n] has higher pirority.\nNote 3: Writing 1 to DRESET[n] will make DOUT[n] reflect the reset value.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No action</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Reset LPIOn to 0</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>write-only</access>
            </field>
            <field>
              <name>DRESET5</name>
              <description>LPIOn Data Ouput Reset Control (Write Only)\nWriting 1 to each bit can reset LPIOn pin output data to 0.\nNote 1: This bit field is write only, reading this field will response with 0.\nNote 2: If DRESET[n] and DSET[n] are both set, DSET[n] has higher pirority.\nNote 3: Writing 1 to DRESET[n] will make DOUT[n] reflect the reset value.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No action</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Reset LPIOn to 0</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>write-only</access>
            </field>
            <field>
              <name>DRESET6</name>
              <description>LPIOn Data Ouput Reset Control (Write Only)\nWriting 1 to each bit can reset LPIOn pin output data to 0.\nNote 1: This bit field is write only, reading this field will response with 0.\nNote 2: If DRESET[n] and DSET[n] are both set, DSET[n] has higher pirority.\nNote 3: Writing 1 to DRESET[n] will make DOUT[n] reflect the reset value.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No action</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Reset LPIOn to 0</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>write-only</access>
            </field>
            <field>
              <name>DRESET7</name>
              <description>LPIOn Data Ouput Reset Control (Write Only)\nWriting 1 to each bit can reset LPIOn pin output data to 0.\nNote 1: This bit field is write only, reading this field will response with 0.\nNote 2: If DRESET[n] and DSET[n] are both set, DSET[n] has higher pirority.\nNote 3: Writing 1 to DRESET[n] will make DOUT[n] reflect the reset value.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No action</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Reset LPIOn to 0</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>write-only</access>
            </field>
          </fields>
       </register>
