wosayttn/sdk-bsp-numaker-m55m1/Debug/svd/M55M1.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>LPPDMA0_NS</name>
      <description>LPPDMA Register Map</description>
      <groupName>LPPDMA</groupName>
      <baseAddress>0x50400000</baseAddress>
      <!-- d -> no access permission -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x50</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x400</offset>
        <size>0x30</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x460</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x480</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
       <register>
          <name>LPPDMAx_DSCT0_CTL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>LPPDMAx_DSCT0_CTL</displayName>
          <description>Descriptor Table Control Register of LPPDMA Channel n</description>
          <addressOffset>0x0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>OPMODE</name>
              <description>LPPDMA Operation Mode Selection\nNote: Before filling new transfer task in the Descriptor Table, user must check the LPPDMA_INTSTS[1] to make sure the current task is complete.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Idle state: Channel is stopped or this table is complete, when LPPDMA finish channel table task, OPMODE will be cleared to idle state automatically</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Basic mode: The descriptor table only has one task. When this task is finished, the LPPDMA_INTSTS[1] will be asserted</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>Scatter-gather mode: When operating in this mode, user must give the next descriptor table address in LPPDMA_DSCTn_NEXT register; LPPDMA controller will ignore this task, then load the next task to execute</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Reserved.</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>TXTYPE</name>
              <description>Transfer Type</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Burst transfer type</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Single transfer type</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>BURSIZE</name>
              <description>Burst Size\nThis field is used for peripheral to determine the burst size or used for determine the re-arbitration size.\nNote: This field is only useful in burst transfer type.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>128 Transfers</description>
                    <value>#000</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>64 Transfers</description>
                    <value>#001</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>32 Transfers</description>
                    <value>#010</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>16 Transfers</description>
                    <value>#011</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>4</name>
                    <description>8 Transfers</description>
                    <value>#100</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>5</name>
                    <description>4 Transfers</description>
                    <value>#101</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>6</name>
                    <description>2 Transfers</description>
                    <value>#110</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>7</name>
                    <description>1 Transfers</description>
                    <value>#111</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>TBINTDIS</name>
              <description>Table Interrupt Disable Bit\nThis field can be used to decide whether to enable table interrupt or not. If the TBINTDIS bit is enabled it will not generates TDIFn(LPPDMA_TDSTS[3:0]) when LPPDMA controller finishes transfer task.\nNote: This function only for Scatter-gather mode.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Table interrupt Enabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Table interrupt Disabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SAINC</name>
              <description>Source Address Increment\nThis field is used to set the source address increment size.\nNote: The fixed address function does not support in memory to memory transfer type.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>3</name>
                    <description>No increment (fixed address)</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>DAINC</name>
              <description>Destination Address Increment\nThis field is used to set the destination address increment size.\nNote: The fixed address function does not support in memory to memory transfer type.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>3</name>
                    <description>No increment (fixed address)</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>TXWIDTH</name>
              <description>Transfer Width Selection\nThis field is used for transfer width.\nNote: The LPPDMA transfer source address (LPPDMA_DSCTn_SA) and LPPDMA transfer destination address (LPPDMA_DSCTn_DA) should be alignment under the TXWIDTH selection</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>One byte (8 bit) is transferred for every operation</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>One half-word (16 bit) is transferred for every operation</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>One word (32-bit) is transferred for every operation</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Reserved.</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>TXCNT</name>
              <description>Transfer Count\nThe TXCNT represents the required number of LPPDMA transfer, the real transfer count is (TXCNT + 1); The maximum transfer count is 65536, every transfer may be byte, half-word or word that is dependent on TXWIDTH field.\nNote: When LPPDMA finishes each transfer data, this field will be decreased immediately.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="LPPDMAx_DSCT0_CTL">
          <name>LPPDMAx_DSCT1_CTL</name>
          <displayName>LPPDMAx_DSCT1_CTL</displayName>
          <description>Descriptor Table Control Register of LPPDMA Channel n</description>
          <addressOffset>0x10</addressOffset>
       </register>
       <register derivedFrom="LPPDMAx_DSCT0_CTL">
          <name>LPPDMAx_DSCT2_CTL</name>
          <displayName>LPPDMAx_DSCT2_CTL</displayName>
          <description>Descriptor Table Control Register of LPPDMA Channel n</description>
          <addressOffset>0x20</addressOffset>
       </register>
       <register derivedFrom="LPPDMAx_DSCT0_CTL">
          <name>LPPDMAx_DSCT3_CTL</name>
          <displayName>LPPDMAx_DSCT3_CTL</displayName>
          <description>Descriptor Table Control Register of LPPDMA Channel n</description>
          <addressOffset>0x30</addressOffset>
       </register>
       <register>
          <name>LPPDMAx_DSCT0_SA</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>LPPDMAx_DSCT0_SA</displayName>
          <description>Source Address Register of LPPDMA Channel n</description>
          <addressOffset>0x4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>SA</name>
              <description>LPPDMA Transfer Source Address\nThis field indicates a 32-bit source address of LPPDMA controller.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="LPPDMAx_DSCT0_SA">
          <name>LPPDMAx_DSCT1_SA</name>
          <displayName>LPPDMAx_DSCT1_SA</displayName>
          <description>Source Address Register of LPPDMA Channel n</description>
          <addressOffset>0x14</addressOffset>
       </register>
       <register derivedFrom="LPPDMAx_DSCT0_SA">
          <name>LPPDMAx_DSCT2_SA</name>
          <displayName>LPPDMAx_DSCT2_SA</displayName>
          <description>Source Address Register of LPPDMA Channel n</description>
          <addressOffset>0x24</addressOffset>
       </register>
       <register derivedFrom="LPPDMAx_DSCT0_SA">
          <name>LPPDMAx_DSCT3_SA</name>
          <displayName>LPPDMAx_DSCT3_SA</displayName>
          <description>Source Address Register of LPPDMA Channel n</description>
          <addressOffset>0x34</addressOffset>
       </register>
       <register>
          <name>LPPDMAx_DSCT0_DA</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>LPPDMAx_DSCT0_DA</displayName>
          <description>Destination Address Register of LPPDMA Channel n</description>
          <addressOffset>0x8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>DA</name>
              <description>LPPDMA Transfer Destination Address\nThis field indicates a 32-bit destination address of LPPDMA controller.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="LPPDMAx_DSCT0_DA">
          <name>LPPDMAx_DSCT1_DA</name>
          <displayName>LPPDMAx_DSCT1_DA</displayName>
          <description>Destination Address Register of LPPDMA Channel n</description>
          <addressOffset>0x18</addressOffset>
       </register>
       <register derivedFrom="LPPDMAx_DSCT0_DA">
          <name>LPPDMAx_DSCT2_DA</name>
          <displayName>LPPDMAx_DSCT2_DA</displayName>
          <description>Destination Address Register of LPPDMA Channel n</description>
          <addressOffset>0x28</addressOffset>
       </register>
       <register derivedFrom="LPPDMAx_DSCT0_DA">
          <name>LPPDMAx_DSCT3_DA</name>
          <displayName>LPPDMAx_DSCT3_DA</displayName>
          <description>Destination Address Register of LPPDMA Channel n</description>
          <addressOffset>0x38</addressOffset>
       </register>
       <register>
          <name>LPPDMAx_DSCT0_NEXT</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>LPPDMAx_DSCT0_NEXT</displayName>
          <description>Next Scatter-gather Descriptor Table Offset Address of LPPDMA Channel n</description>
          <addressOffset>0xC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>NEXT</name>
              <description>LPPDMA Next Descriptor Table Offset\nThis field indicates the offset of the next descriptor table address in system memory. \nRead Operation:\nWhen operating in Scatter-gather mode, the last two bits NEXT[1:0] will become reserved, and indicate the first next address of system memory.\nNote 1: The descriptor table address must be word boundary.\nNote 2: Before filling transfer task in the descriptor table, user must check if the descriptor table is complete.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXENEXT</name>
              <description>LPPDMA Execution Next Descriptor Table Offset\nThis field indicates the offset of next descriptor table address of current execution descriptor table in system memory. \nNote: Write operation is useless in this field.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="LPPDMAx_DSCT0_NEXT">
          <name>LPPDMAx_DSCT1_NEXT</name>
          <displayName>LPPDMAx_DSCT1_NEXT</displayName>
          <description>Next Scatter-gather Descriptor Table Offset Address of LPPDMA Channel n</description>
          <addressOffset>0x1C</addressOffset>
       </register>
       <register derivedFrom="LPPDMAx_DSCT0_NEXT">
          <name>LPPDMAx_DSCT2_NEXT</name>
          <displayName>LPPDMAx_DSCT2_NEXT</displayName>
          <description>Next Scatter-gather Descriptor Table Offset Address of LPPDMA Channel n</description>
          <addressOffset>0x2C</addressOffset>
       </register>
       <register derivedFrom="LPPDMAx_DSCT0_NEXT">
          <name>LPPDMAx_DSCT3_NEXT</name>
          <displayName>LPPDMAx_DSCT3_NEXT</displayName>
          <description>Next Scatter-gather Descriptor Table Offset Address of LPPDMA Channel n</description>
          <addressOffset>0x3C</addressOffset>
       </register>
       <register>
          <name>LPPDMAx_CURSCAT0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>LPPDMAx_CURSCAT0</displayName>
          <description>Current Scatter-gather Descriptor Table Address of LPPDMA Channel n</description>
          <addressOffset>0x40</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>CURADDR</name>
              <description>LPPDMA Current Description Address (Read Only)\nThis field indicates a 32-bit current external description address of LPPDMA controller.\nNote: This field is read only and used for Scatter-gather mode only to indicate the current external description address.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="LPPDMAx_CURSCAT0">
          <name>LPPDMAx_CURSCAT1</name>
          <displayName>LPPDMAx_CURSCAT1</displayName>
          <description>Current Scatter-gather Descriptor Table Address of LPPDMA Channel n</description>
          <addressOffset>0x44</addressOffset>
       </register>
       <register derivedFrom="LPPDMAx_CURSCAT0">
          <name>LPPDMAx_CURSCAT2</name>
          <displayName>LPPDMAx_CURSCAT2</displayName>
          <description>Current Scatter-gather Descriptor Table Address of LPPDMA Channel n</description>
          <addressOffset>0x48</addressOffset>
       </register>
       <register derivedFrom="LPPDMAx_CURSCAT0">
          <name>LPPDMAx_CURSCAT3</name>
          <displayName>LPPDMAx_CURSCAT3</displayName>
          <description>Current Scatter-gather Descriptor Table Address of LPPDMA Channel n</description>
          <addressOffset>0x4C</addressOffset>
       </register>
       <register>
          <name>LPPDMAx_CHCTL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>LPPDMAx_CHCTL</displayName>
          <description>LPPDMA Channel Control Register</description>
          <addressOffset>0x400</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CHEN0</name>
              <description>LPPDMA Channel Enable Bits\nSet this bit to 1 to enable LPPDMAn operation. Channel cannot be active if it is not set as enabled.\nNote: Setting the corresponding bit of LPPDMA_PAUSE or LPPDMA_CHRST register will also clear this bit.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>LPPDMA channel [n] Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>LPPDMA channel [n] Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>CHEN1</name>
              <description>LPPDMA Channel Enable Bits\nSet this bit to 1 to enable LPPDMAn operation. Channel cannot be active if it is not set as enabled.\nNote: Setting the corresponding bit of LPPDMA_PAUSE or LPPDMA_CHRST register will also clear this bit.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>LPPDMA channel [n] Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>LPPDMA channel [n] Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>CHEN2</name>
              <description>LPPDMA Channel Enable Bits\nSet this bit to 1 to enable LPPDMAn operation. Channel cannot be active if it is not set as enabled.\nNote: Setting the corresponding bit of LPPDMA_PAUSE or LPPDMA_CHRST register will also clear this bit.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>LPPDMA channel [n] Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>LPPDMA channel [n] Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>CHEN3</name>
              <description>LPPDMA Channel Enable Bits\nSet this bit to 1 to enable LPPDMAn operation. Channel cannot be active if it is not set as enabled.\nNote: Setting the corresponding bit of LPPDMA_PAUSE or LPPDMA_CHRST register will also clear this bit.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>LPPDMA channel [n] Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>LPPDMA channel [n] Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
