wosayttn/sdk-bsp-numaker-m55m1/Debug/svd/M55M1.svd
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>RTC_TAMPSEED</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>RTC_TAMPSEED</displayName>
          <description>RTC Tamper Dynamic Seed Register</description>
          <addressOffset>0x128</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEED</name>
              <description>Seed Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>RTC_TAMPTIME</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>RTC_TAMPTIME</displayName>
          <description>RTC Tamper Time Register</description>
          <addressOffset>0x130</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEC</name>
              <description>1-Sec Time Digit of TAMPER Time (0~9)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TENSEC</name>
              <description>10-Sec Time Digit of TAMPER Time (0~5)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MIN</name>
              <description>1-Min Time Digit of TAMPER Time (0~9)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TENMIN</name>
              <description>10-Min Time Digit of TAMPER Time (0~5)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HR</name>
              <description>1-Hour Time Digit of TAMPER Time (0~9)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TENHR</name>
              <description>10-Hour Time Digit of TAMPER Time (0~2)Note: 24-hour time scale only .</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>RTC_TAMPCAL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>RTC_TAMPCAL</displayName>
          <description>RTC Tamper Calendar Register</description>
          <addressOffset>0x134</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAY</name>
              <description>1-Day Calendar Digit of TAMPER Calendar (0~9)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TENDAY</name>
              <description>10-Day Calendar Digit of TAMPER Calendar (0~3)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MON</name>
              <description>1-Month Calendar Digit of TAMPER Calendar (0~9)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TENMON</name>
              <description>10-Month Calendar Digit of TAMPER Calendar (0~1)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>YEAR</name>
              <description>1-Year Calendar Digit of TAMPER Calendar (0~9)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TENYEAR</name>
              <description>10-Year Calendar Digit of TAMPER Calendar (0~9)</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>RTC_CLKDCTL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>RTC_CLKDCTL</displayName>
          <description>Clock Fail Detector Control Register</description>
          <addressOffset>0x140</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LXTFDEN</name>
              <description>LXT Clock Fail/Stop Detector Enable Bit\nNote: LXT detector will automatically be disabled when CLKSTIF/CLKFIF flag rises, and resumes after Fail/Stop Flag is cleared.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>LXT clock Fail/Stop detector Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>LXT clock Fail/Stop detector Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>LXTFSW</name>
              <description>LXT Clock Fail Detector Switch LIRC32K Enable Bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>LXT clock Fail switch LIRC32K Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>LXT clock Fail detector rises, and RTC clock source switch from LIRC32K</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>LXTSTSW</name>
              <description>LXT Clock Stop Detector Switch LIRC32K Enable Bit</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>LXT clock Stop switch LIRC32K Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>LXT clock Stop detector rise, RTC clock source switch from LIRC32K</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SWLIRCF</name>
              <description>LXT Clock Detector Fail/Stop Switch LIRC32K Flag (Read Only)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Indicate RTC clock source from LXT</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Indicate RTC clock source from LIRC32K</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>LXTSLOWF</name>
              <description>LXT Slower Than LIRC32K Flag (Read Only) \nNote: LXTSLOWF is valid during CLKSTIF (RTC_INTSTS[25]) or CLKFIF (RTC_INTSTS[24]) rising.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>LXT frequency faster than LIRC32K</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>LXT frequency is slowly</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>RTC_CDBR</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>RTC_CDBR</displayName>
          <description>Clock Frequency Detector Boundary Register</description>
          <addressOffset>0x144</addressOffset>
          <access>read-write</access>
          <resetValue>0x00F0000F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STOPBD</name>
              <description>LXT Clock Stop Frequency Detector Stop Boundary\nThe bits define the stop value of frequency monitor window.\nWhen LXT frequency monitor counter lower than STOPBD, the LXT frequency detect Stop interrupt flag will set to 1.\nNote: The boundary is defined as the maximum value of LXT among 256 LIRC32K clock time.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FAILBD</name>
              <description>LXT Clock Frequency Detector Fail Boundary\nThe bits define the fail value of frequency monitor window.\nWhen LXT frequency monitor counter lower than FAILBD, the LXT frequency detect fail interrupt flag will set to 1.\nNote: The boundary is defined as the minimum value of LXT among 256 LIRC32K clock time.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
