wosayttn/sdk-bsp-numaker-m55m1/Debug/svd/M55M1.svd
       <register>
          <name>EPWM_RDTCNT0_1</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>EPWM_RDTCNT0_1</displayName>
          <description>EPWM Rising Dead-time Counter Register 0/1</description>
          <addressOffset>0x2A8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RDTCNT</name>
              <description>Rising Dead-time Counter (Write Protect)\nThe Rising dead-time can be calculated from the following formula: \nNote: This bit is write protected. Refer to SYS_REGLCTL register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="EPWM_RDTCNT0_1">
          <name>EPWM_RDTCNT2_3</name>
          <displayName>EPWM_RDTCNT2_3</displayName>
          <description>EPWM Rising Dead-time Counter Register 2/3</description>
          <addressOffset>0x2AC</addressOffset>
       </register>
       <register derivedFrom="EPWM_RDTCNT0_1">
          <name>EPWM_RDTCNT4_5</name>
          <displayName>EPWM_RDTCNT4_5</displayName>
          <description>EPWM Rising Dead-time Counter Register 4/5</description>
          <addressOffset>0x2B0</addressOffset>
       </register>
       <register>
          <name>EPWM_FDTCNT0_1</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>EPWM_FDTCNT0_1</displayName>
          <description>EPWM Falling Dead-time Counter Register 0/1</description>
          <addressOffset>0x2B4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FDTCNT</name>
              <description>Falling Dead-time Counter (Write Protect)\nThe dead-time can be calculated from the following formula: \nNote: This bit is write protected. Refer to SYS_REGLCTL register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="EPWM_FDTCNT0_1">
          <name>EPWM_FDTCNT2_3</name>
          <displayName>EPWM_FDTCNT2_3</displayName>
          <description>EPWM Falling Dead-time Counter Register 2/3</description>
          <addressOffset>0x2B8</addressOffset>
       </register>
       <register derivedFrom="EPWM_FDTCNT0_1">
          <name>EPWM_FDTCNT4_5</name>
          <displayName>EPWM_FDTCNT4_5</displayName>
          <description>EPWM Falling Dead-time Counter Register 4/5</description>
          <addressOffset>0x2BC</addressOffset>
       </register>
       <register>
          <name>EPWM_DTCTL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>EPWM_DTCTL</displayName>
          <description>EPWM Dead-time Control Register</description>
          <addressOffset>0x2C0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RDTEN0</name>
              <description>Enable Rising Dead-time Insertion for EPWM Pair (Write Protect)\nRising Dead-time insertion is only active when this pair of complementary EPWM is enabled. If rising dead- time insertion is inactive, the outputs of pin pair are complementary without any delay.\nNote: This bit is write protected. Refer to SYS_REGLCTL register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Rising Dead-time insertion Disabled on the pin pair</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Rising Dead-time insertion Enabled on the pin pair</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>RDTEN2</name>
              <description>Enable Rising Dead-time Insertion for EPWM Pair (Write Protect)\nRising Dead-time insertion is only active when this pair of complementary EPWM is enabled. If rising dead- time insertion is inactive, the outputs of pin pair are complementary without any delay.\nNote: This bit is write protected. Refer to SYS_REGLCTL register.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Rising Dead-time insertion Disabled on the pin pair</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Rising Dead-time insertion Enabled on the pin pair</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>RDTEN4</name>
              <description>Enable Rising Dead-time Insertion for EPWM Pair (Write Protect)\nRising Dead-time insertion is only active when this pair of complementary EPWM is enabled. If rising dead- time insertion is inactive, the outputs of pin pair are complementary without any delay.\nNote: This bit is write protected. Refer to SYS_REGLCTL register.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Rising Dead-time insertion Disabled on the pin pair</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Rising Dead-time insertion Enabled on the pin pair</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>FDTEN0</name>
              <description>Enable Falling Dead-time Insertion for EPWM Pair (Write Protect)\nFalling Dead-time insertion is only active when this pair of complementary EPWM is enabled. If falling dead- time insertion is inactive, the outputs of pin pair are complementary without any delay.\nNote: This bit is write protected. Refer to SYS_REGLCTL register.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Falling Dead-time insertion Disabled on the pin pair</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Falling Dead-time insertion Enabled on the pin pair</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>FDTEN2</name>
              <description>Enable Falling Dead-time Insertion for EPWM Pair (Write Protect)\nFalling Dead-time insertion is only active when this pair of complementary EPWM is enabled. If falling dead- time insertion is inactive, the outputs of pin pair are complementary without any delay.\nNote: This bit is write protected. Refer to SYS_REGLCTL register.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Falling Dead-time insertion Disabled on the pin pair</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Falling Dead-time insertion Enabled on the pin pair</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>FDTEN4</name>
              <description>Enable Falling Dead-time Insertion for EPWM Pair (Write Protect)\nFalling Dead-time insertion is only active when this pair of complementary EPWM is enabled. If falling dead- time insertion is inactive, the outputs of pin pair are complementary without any delay.\nNote: This bit is write protected. Refer to SYS_REGLCTL register.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Falling Dead-time insertion Disabled on the pin pair</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Falling Dead-time insertion Enabled on the pin pair</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>DTCKSELn</name>
              <description>Dead-time Clock Select for EPWM Pair (Write Protect)\nNote: This bit is write protected. Refer to REGWRPROT register.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Dead-time clock source from EPWM_CLK</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Dead-time clock source from prescaler output</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>EPWM_PBUF0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>EPWM_PBUF0</displayName>
          <description>EPWM PERIOD0 Buffer</description>
          <addressOffset>0x304</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PBUF</name>
              <description>EPWM Period Register Buffer (Read Only)\nUsed as PERIOD active register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="EPWM_PBUF0">
          <name>EPWM_PBUF1</name>
          <displayName>EPWM_PBUF1</displayName>
          <description>EPWM PERIOD1 Buffer</description>
          <addressOffset>0x308</addressOffset>
       </register>
       <register derivedFrom="EPWM_PBUF0">
          <name>EPWM_PBUF2</name>
          <displayName>EPWM_PBUF2</displayName>
          <description>EPWM PERIOD2 Buffer</description>
          <addressOffset>0x30C</addressOffset>
       </register>
       <register derivedFrom="EPWM_PBUF0">
          <name>EPWM_PBUF3</name>
          <displayName>EPWM_PBUF3</displayName>
          <description>EPWM PERIOD3 Buffer</description>
          <addressOffset>0x310</addressOffset>
       </register>
       <register derivedFrom="EPWM_PBUF0">
          <name>EPWM_PBUF4</name>
          <displayName>EPWM_PBUF4</displayName>
          <description>EPWM PERIOD4 Buffer</description>
          <addressOffset>0x314</addressOffset>
       </register>
       <register derivedFrom="EPWM_PBUF0">
          <name>EPWM_PBUF5</name>
          <displayName>EPWM_PBUF5</displayName>
          <description>EPWM PERIOD5 Buffer</description>
          <addressOffset>0x318</addressOffset>
       </register>
       <register>
          <name>EPWM_CMPBUF0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>EPWM_CMPBUF0</displayName>
          <description>EPWM CMPDAT0 Buffer</description>
          <addressOffset>0x31C</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CMPBUF</name>
              <description>EPWM Comparator Register Buffer (Read Only)\nUsed as CMP active register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="EPWM_CMPBUF0">
          <name>EPWM_CMPBUF1</name>
          <displayName>EPWM_CMPBUF1</displayName>
          <description>EPWM CMPDAT1 Buffer</description>
          <addressOffset>0x320</addressOffset>
       </register>
       <register derivedFrom="EPWM_CMPBUF0">
          <name>EPWM_CMPBUF2</name>
          <displayName>EPWM_CMPBUF2</displayName>
          <description>EPWM CMPDAT2 Buffer</description>
          <addressOffset>0x324</addressOffset>
       </register>
       <register derivedFrom="EPWM_CMPBUF0">
          <name>EPWM_CMPBUF3</name>
          <displayName>EPWM_CMPBUF3</displayName>
          <description>EPWM CMPDAT3 Buffer</description>
          <addressOffset>0x328</addressOffset>
       </register>
       <register derivedFrom="EPWM_CMPBUF0">
          <name>EPWM_CMPBUF4</name>
          <displayName>EPWM_CMPBUF4</displayName>
          <description>EPWM CMPDAT4 Buffer</description>
          <addressOffset>0x32C</addressOffset>
       </register>
       <register derivedFrom="EPWM_CMPBUF0">
          <name>EPWM_CMPBUF5</name>
          <displayName>EPWM_CMPBUF5</displayName>
          <description>EPWM CMPDAT5 Buffer</description>
          <addressOffset>0x330</addressOffset>
       </register>
       <register>
          <name>EPWM_FTCBUF0_1</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>EPWM_FTCBUF0_1</displayName>
          <description>EPWM FTCMPDAT0_1 Buffer</description>
          <addressOffset>0x340</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FTCMPBUF</name>
              <description>EPWM FTCMPDAT Buffer (Read Only)\nUsed as FTCMP active buffer.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
