wosayttn/sdk-bsp-numaker-m55m1/Debug/svd/M55M1.svd
       <register derivedFrom="USBD_MXPLD0">
          <name>USBD_MXPLD13</name>
          <displayName>USBD_MXPLD13</displayName>
          <description>Endpoint 13 Maximal Payload Register</description>
          <addressOffset>0x5D4</addressOffset>
       </register>
       <register derivedFrom="USBD_CFG0">
          <name>USBD_CFG13</name>
          <displayName>USBD_CFG13</displayName>
          <description>Endpoint 13 Configuration Register</description>
          <addressOffset>0x5D8</addressOffset>
       </register>
       <register derivedFrom="USBD_CFGP0">
          <name>USBD_CFGP13</name>
          <displayName>USBD_CFGP13</displayName>
          <description>Endpoint 13 Set Stall and Clear In/Out Ready Control Register</description>
          <addressOffset>0x5DC</addressOffset>
       </register>
       <register derivedFrom="USBD_BUFSEG0">
          <name>USBD_BUFSEG14</name>
          <displayName>USBD_BUFSEG14</displayName>
          <description>Endpoint 14 Buffer Segmentation Register</description>
          <addressOffset>0x5E0</addressOffset>
       </register>
       <register derivedFrom="USBD_MXPLD0">
          <name>USBD_MXPLD14</name>
          <displayName>USBD_MXPLD14</displayName>
          <description>Endpoint 14 Maximal Payload Register</description>
          <addressOffset>0x5E4</addressOffset>
       </register>
       <register derivedFrom="USBD_CFG0">
          <name>USBD_CFG14</name>
          <displayName>USBD_CFG14</displayName>
          <description>Endpoint 14 Configuration Register</description>
          <addressOffset>0x5E8</addressOffset>
       </register>
       <register derivedFrom="USBD_CFGP0">
          <name>USBD_CFGP14</name>
          <displayName>USBD_CFGP14</displayName>
          <description>Endpoint 14 Set Stall and Clear In/Out Ready Control Register</description>
          <addressOffset>0x5EC</addressOffset>
       </register>
       <register derivedFrom="USBD_BUFSEG0">
          <name>USBD_BUFSEG15</name>
          <displayName>USBD_BUFSEG15</displayName>
          <description>Endpoint 15 Buffer Segmentation Register</description>
          <addressOffset>0x5F0</addressOffset>
       </register>
       <register derivedFrom="USBD_MXPLD0">
          <name>USBD_MXPLD15</name>
          <displayName>USBD_MXPLD15</displayName>
          <description>Endpoint 15 Maximal Payload Register</description>
          <addressOffset>0x5F4</addressOffset>
       </register>
       <register derivedFrom="USBD_CFG0">
          <name>USBD_CFG15</name>
          <displayName>USBD_CFG15</displayName>
          <description>Endpoint 15 Configuration Register</description>
          <addressOffset>0x5F8</addressOffset>
       </register>
       <register derivedFrom="USBD_CFGP0">
          <name>USBD_CFGP15</name>
          <displayName>USBD_CFGP15</displayName>
          <description>Endpoint 15 Set Stall and Clear In/Out Ready Control Register</description>
          <addressOffset>0x5FC</addressOffset>
       </register>
       <register derivedFrom="USBD_BUFSEG0">
          <name>USBD_BUFSEG16</name>
          <displayName>USBD_BUFSEG16</displayName>
          <description>Endpoint 16 Buffer Segmentation Register</description>
          <addressOffset>0x600</addressOffset>
       </register>
       <register derivedFrom="USBD_MXPLD0">
          <name>USBD_MXPLD16</name>
          <displayName>USBD_MXPLD16</displayName>
          <description>Endpoint 16 Maximal Payload Register</description>
          <addressOffset>0x604</addressOffset>
       </register>
       <register derivedFrom="USBD_CFG0">
          <name>USBD_CFG16</name>
          <displayName>USBD_CFG16</displayName>
          <description>Endpoint 16 Configuration Register</description>
          <addressOffset>0x608</addressOffset>
       </register>
       <register derivedFrom="USBD_CFGP0">
          <name>USBD_CFGP16</name>
          <displayName>USBD_CFGP16</displayName>
          <description>Endpoint 16 Set Stall and Clear In/Out Ready Control Register</description>
          <addressOffset>0x60C</addressOffset>
       </register>
       <register derivedFrom="USBD_BUFSEG0">
          <name>USBD_BUFSEG17</name>
          <displayName>USBD_BUFSEG17</displayName>
          <description>Endpoint 17 Buffer Segmentation Register</description>
          <addressOffset>0x610</addressOffset>
       </register>
       <register derivedFrom="USBD_MXPLD0">
          <name>USBD_MXPLD17</name>
          <displayName>USBD_MXPLD17</displayName>
          <description>Endpoint 17 Maximal Payload Register</description>
          <addressOffset>0x614</addressOffset>
       </register>
       <register derivedFrom="USBD_CFG0">
          <name>USBD_CFG17</name>
          <displayName>USBD_CFG17</displayName>
          <description>Endpoint 17 Configuration Register</description>
          <addressOffset>0x618</addressOffset>
       </register>
       <register derivedFrom="USBD_CFGP0">
          <name>USBD_CFGP17</name>
          <displayName>USBD_CFGP17</displayName>
          <description>Endpoint 17 Set Stall and Clear In/Out Ready Control Register</description>
          <addressOffset>0x61C</addressOffset>
       </register>
       <register derivedFrom="USBD_BUFSEG0">
          <name>USBD_BUFSEG18</name>
          <displayName>USBD_BUFSEG18</displayName>
          <description>Endpoint 18 Buffer Segmentation Register</description>
          <addressOffset>0x620</addressOffset>
       </register>
       <register derivedFrom="USBD_MXPLD0">
          <name>USBD_MXPLD18</name>
          <displayName>USBD_MXPLD18</displayName>
          <description>Endpoint 18 Maximal Payload Register</description>
          <addressOffset>0x624</addressOffset>
       </register>
       <register derivedFrom="USBD_CFG0">
          <name>USBD_CFG18</name>
          <displayName>USBD_CFG18</displayName>
          <description>Endpoint 18 Configuration Register</description>
          <addressOffset>0x628</addressOffset>
       </register>
       <register derivedFrom="USBD_CFGP0">
          <name>USBD_CFGP18</name>
          <displayName>USBD_CFGP18</displayName>
          <description>Endpoint 18 Set Stall and Clear In/Out Ready Control Register</description>
          <addressOffset>0x62C</addressOffset>
       </register>
       <register derivedFrom="USBD_BUFSEG0">
          <name>USBD_BUFSEG19</name>
          <displayName>USBD_BUFSEG19</displayName>
          <description>Endpoint 19 Buffer Segmentation Register</description>
          <addressOffset>0x630</addressOffset>
       </register>
