wosayttn/sdk-bsp-numaker-m55m1/Debug/svd/M55M1.svd
       <register derivedFrom="EADC_SCTL24">
          <name>EADC_SCTL25</name>
          <displayName>EADC_SCTL25</displayName>
          <description>EADC Sample Module 25 Control Register</description>
          <addressOffset>0x248</addressOffset>
       </register>
       <register derivedFrom="EADC_SCTL24">
          <name>EADC_SCTL26</name>
          <displayName>EADC_SCTL26</displayName>
          <description>EADC Sample Module 26 Control Register</description>
          <addressOffset>0x24C</addressOffset>
       </register>
       <register derivedFrom="EADC_SCTL24">
          <name>EADC_SCTL27</name>
          <displayName>EADC_SCTL27</displayName>
          <description>EADC Sample Module 27 Control Register</description>
          <addressOffset>0x250</addressOffset>
       </register>
       <register>
          <name>EADC_M19CTL1</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>EADC_M19CTL1</displayName>
          <description>EADC Sample Module 19 Control Register 1</description>
          <addressOffset>0x260</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ALIGN</name>
              <description>Alignment Selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>The conversion result will be right aligned in data register</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The conversion result will be left aligned in data register</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>AVG</name>
              <description>Average Mode Selection</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Conversion results will be stored in data register without averaging</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Conversion results in data register will be averaged</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>ACU</name>
              <description>Number of Accumulated Conversion Results Selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>1 conversion result will be accumulated</description>
                    <value>#0000</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>2 conversion result will be accumulated</description>
                    <value>#0001</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>4 conversion result will be accumulated</description>
                    <value>#0010</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>8 conversion result will be accumulated</description>
                    <value>#0011</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>4</name>
                    <description>16 conversion result will be accumulated</description>
                    <value>#0100</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>5</name>
                    <description>32 conversion result will be accumulated</description>
                    <value>#0101</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>6</name>
                    <description>64 conversion result will be accumulated</description>
                    <value>#0110</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>7</name>
                    <description>128 conversion result will be accumulated</description>
                    <value>#0111</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>8</name>
                    <description>256 conversion result will be accumulated</description>
                    <value>#1000</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTSTDIV</name>
              <description>EADC Extended Sampling Time Clock Divider Selection\nClock frequency for extending sampling time: </description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>EADC_CLK/1</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>EADC_CLK/2</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>EADC_CLK/4</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>EADC_CLK/16</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="EADC_M19CTL1">
          <name>EADC_M20CTL1</name>
          <displayName>EADC_M20CTL1</displayName>
          <description>EADC Sample Module 20 Control Register 1</description>
          <addressOffset>0x264</addressOffset>
       </register>
       <register derivedFrom="EADC_M19CTL1">
          <name>EADC_M21CTL1</name>
          <displayName>EADC_M21CTL1</displayName>
          <description>EADC Sample Module 21 Control Register 1</description>
          <addressOffset>0x268</addressOffset>
       </register>
       <register derivedFrom="EADC_M19CTL1">
          <name>EADC_M22CTL1</name>
          <displayName>EADC_M22CTL1</displayName>
          <description>EADC Sample Module 22 Control Register 1</description>
          <addressOffset>0x26C</addressOffset>
       </register>
       <register derivedFrom="EADC_M19CTL1">
          <name>EADC_M23CTL1</name>
          <displayName>EADC_M23CTL1</displayName>
          <description>EADC Sample Module 23 Control Register 1</description>
          <addressOffset>0x270</addressOffset>
       </register>
       <register>
          <name>EADC_M24CTL1</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>EADC_M24CTL1</displayName>
          <description>EADC Sample Module 24 Control Register 1</description>
          <addressOffset>0x274</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EXTSTDIV</name>
              <description>EADC Extended Sampling Time Clock Divider Selection\nClock frequency for extending sampling time: </description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>EADC_CLK/1</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>EADC_CLK/2</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>EADC_CLK/4</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>EADC_CLK/16</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="EADC_M24CTL1">
          <name>EADC_M25CTL1</name>
          <displayName>EADC_M25CTL1</displayName>
          <description>EADC Sample Module 25 Control Register 1</description>
          <addressOffset>0x278</addressOffset>
       </register>
       <register derivedFrom="EADC_M24CTL1">
          <name>EADC_M26CTL1</name>
          <displayName>EADC_M26CTL1</displayName>
          <description>EADC Sample Module 26 Control Register 1</description>
          <addressOffset>0x27C</addressOffset>
       </register>
       <register derivedFrom="EADC_M24CTL1">
          <name>EADC_M27CTL1</name>
          <displayName>EADC_M27CTL1</displayName>
          <description>EADC Sample Module 27 Control Register 1</description>
          <addressOffset>0x280</addressOffset>
       </register>
