wosayttn/sdk-bsp-numaker-m55m1/Debug/svd/M55M1.svd
       <register>
          <name>CRYPTO_HMAC_STS</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_HMAC_STS</displayName>
          <description>SHA/HMAC Status Flag</description>
          <addressOffset>0x304</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BUSY</name>
              <description>SHA/HMAC Engine Busy </description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>SHA/HMAC engine is idle or finished</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>SHA/HMAC engine is busy</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>DMABUSY</name>
              <description>SHA/HMAC Engine DMA Busy Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>SHA/HMAC DMA engine is idle or finished</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>SHA/HMAC DMA engine is busy</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>SHAKEBUSY</name>
              <description>SHAKE  Engine Busy Flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>SHAKE engine is idle or finished</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>SHAKE engine is busy</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>DMAERR</name>
              <description>SHA/HMAC Engine DMA Error Flag</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Show the SHA/HMAC engine access normal</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Show the SHA/HMAC engine access error</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>KSERR</name>
              <description>HMAC Engine Access Key Store Error Flag</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No error</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Access error will stop HMAC engine</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>DATINREQ</name>
              <description>SHA/HMAC Non-DMA Mode Data Input Request</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No effect</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Request SHA/HMAC Non-DMA mode data input</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CRYPTO_HMAC_DGST0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_HMAC_DGST0</displayName>
          <description>SHA/HMAC Output Feedback Data 0</description>
          <addressOffset>0x308</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DGST</name>
              <description>SHA/HMAC Output Feedback Data Output Register\nFor SHA-160, the digest is stored in CRYPTO_HMAC_DGST0 ~ CRYPTO_HMAC_DGST4.\nFor SHA-224, the digest is stored in CRYPTO_HMAC_DGST0 ~ CRYPTO_HMAC_DGST6.\nFor SHA-256, the digest is stored in CRYPTO_HMAC_DGST0 ~ CRYPTO_HMAC_DGST7.\nFor SHA-384, the digest is stored in CRYPTO_HMAC_DGST0 ~ CRYPTO_HMAC_DGST11.\nFor SHA-512, the digest is stored in CRYPTO_HMAC_DGST0 ~ CRYPTO_HMAC_DGST15.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="CRYPTO_HMAC_DGST0">
          <name>CRYPTO_HMAC_DGST1</name>
          <displayName>CRYPTO_HMAC_DGST1</displayName>
          <description>SHA/HMAC Output Feedback Data 1</description>
          <addressOffset>0x30C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_DGST0">
          <name>CRYPTO_HMAC_DGST2</name>
          <displayName>CRYPTO_HMAC_DGST2</displayName>
          <description>SHA/HMAC Output Feedback Data 2</description>
          <addressOffset>0x310</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_DGST0">
          <name>CRYPTO_HMAC_DGST3</name>
          <displayName>CRYPTO_HMAC_DGST3</displayName>
          <description>SHA/HMAC Output Feedback Data 3</description>
          <addressOffset>0x314</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_DGST0">
          <name>CRYPTO_HMAC_DGST4</name>
          <displayName>CRYPTO_HMAC_DGST4</displayName>
          <description>SHA/HMAC Output Feedback Data 4</description>
          <addressOffset>0x318</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_DGST0">
          <name>CRYPTO_HMAC_DGST5</name>
          <displayName>CRYPTO_HMAC_DGST5</displayName>
          <description>SHA/HMAC Output Feedback Data 5</description>
          <addressOffset>0x31C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_DGST0">
          <name>CRYPTO_HMAC_DGST6</name>
          <displayName>CRYPTO_HMAC_DGST6</displayName>
          <description>SHA/HMAC Output Feedback Data 6</description>
          <addressOffset>0x320</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_DGST0">
          <name>CRYPTO_HMAC_DGST7</name>
          <displayName>CRYPTO_HMAC_DGST7</displayName>
          <description>SHA/HMAC Output Feedback Data 7</description>
          <addressOffset>0x324</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_DGST0">
          <name>CRYPTO_HMAC_DGST8</name>
          <displayName>CRYPTO_HMAC_DGST8</displayName>
          <description>SHA/HMAC Output Feedback Data 8</description>
          <addressOffset>0x328</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_DGST0">
          <name>CRYPTO_HMAC_DGST9</name>
          <displayName>CRYPTO_HMAC_DGST9</displayName>
          <description>SHA/HMAC Output Feedback Data 9</description>
          <addressOffset>0x32C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_DGST0">
          <name>CRYPTO_HMAC_DGST10</name>
          <displayName>CRYPTO_HMAC_DGST10</displayName>
          <description>SHA/HMAC Output Feedback Data 10</description>
          <addressOffset>0x330</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_DGST0">
          <name>CRYPTO_HMAC_DGST11</name>
          <displayName>CRYPTO_HMAC_DGST11</displayName>
          <description>SHA/HMAC Output Feedback Data 11</description>
          <addressOffset>0x334</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_DGST0">
          <name>CRYPTO_HMAC_DGST12</name>
          <displayName>CRYPTO_HMAC_DGST12</displayName>
          <description>SHA/HMAC Output Feedback Data 12</description>
          <addressOffset>0x338</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_DGST0">
          <name>CRYPTO_HMAC_DGST13</name>
          <displayName>CRYPTO_HMAC_DGST13</displayName>
          <description>SHA/HMAC Output Feedback Data 13</description>
          <addressOffset>0x33C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_DGST0">
          <name>CRYPTO_HMAC_DGST14</name>
          <displayName>CRYPTO_HMAC_DGST14</displayName>
          <description>SHA/HMAC Output Feedback Data 14</description>
          <addressOffset>0x340</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_DGST0">
          <name>CRYPTO_HMAC_DGST15</name>
          <displayName>CRYPTO_HMAC_DGST15</displayName>
          <description>SHA/HMAC Output Feedback Data 15</description>
          <addressOffset>0x344</addressOffset>
       </register>
       <register>
          <name>CRYPTO_HMAC_KEYCNT</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_HMAC_KEYCNT</displayName>
          <description>SHA/HMAC Key Byte Count Register</description>
          <addressOffset>0x348</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>KEYCNT</name>
              <description>SHA/HMAC Key Byte Count\nThe CRYPTO_HMAC_KEYCNT keeps the byte count of key that SHA/HMAC engine operates. The register is 32-bit and the maximum byte count is 4G bytes. It can be read and written. \nWriting to the register CRYPTO_HMAC_KEYCNT as the SHA/HMAC accelerator operating doesn't affect the current SHA/HMAC operation. But the value of CRYPTO_HMAC_KEYCNT will be updated later on. Consequently, software can prepare the key count for the next SHA/HMAC operation.\nNote: CRYPTO_HMAC_KEYCNT must be zero when HMAC key from Key Store.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CRYPTO_HMAC_SADDR</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_HMAC_SADDR</displayName>
          <description>SHA/HMAC DMA Source Address Register</description>
          <addressOffset>0x34C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SADDR</name>
              <description>SHA/HMAC DMA Source Address\nThe SHA/HMAC accelerator supports DMA function to transfer the plain text between SRAM memory space and embedded FIFO. The CRYPTO_HMAC_SADDR keeps the source address of the data buffer where the source text is stored. Based on the source address, the SHA/HMAC accelerator can read the plain text from SRAM memory space and do SHA/HMAC operation. The start of source address should be located at word boundary. In other words, bit 1 and 0 of CRYPTO_HMAC_SADDR are ignored.\nCRYPTO_HMAC_SADDR can be read and written. Writing to CRYPTO_HMAC_SADDR while the SHA/HMAC accelerator is operating doesn't affect the current SHA/HMAC operation. But the value of CRYPTO_HMAC_SADDR will be updated later on. Consequently, software can prepare the DMA source address for the next SHA/HMAC operation.\nIn DMA mode, software can update the next CRYPTO_HMAC_SADDR before triggering START.\nCRYPTO_HMAC_SADDR and CRYPTO_HMAC_DADDR can be the same in the value.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CRYPTO_HMAC_DMACNT</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_HMAC_DMACNT</displayName>
          <description>SHA/HMAC Byte Count Register</description>
          <addressOffset>0x350</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DMACNT</name>
              <description>SHA/HMAC Operation Byte Count\nThe CRYPTO_HMAC_DMACNT keeps the byte count of source text that is for the SHA/HMAC engine operating in DMA mode. The CRYPTO_HMAC_DMACNT is 32-bit and the maximum of byte count is 4G bytes.\nCRYPTO_HMAC_DMACNT can be read and written. Writing to CRYPTO_HMAC_DMACNT while the SHA/HMAC accelerator is operating doesn't affect the current SHA/HMAC operation. But the value of CRYPTO_HMAC_DMACNT will be updated later on. Consequently, software can prepare the byte count of data for the next SHA/HMAC operation.\nIn Non-DMA mode, CRYPTO_HMAC_DMACNT must be set as the byte count of the last block before feeding in the last block of data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CRYPTO_HMAC_DATIN</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_HMAC_DATIN</displayName>
          <description>SHA/HMAC Engine Non-DMA Mode Data Input Port Register</description>
          <addressOffset>0x354</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATIN</name>
              <description>SHA/HMAC Engine Input Port\nCPU feeds data to SHA/HMAC engine through this port by checking CRYPTO_HMAC_STS. Feed data as DATINREQ is 1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CRYPTO_HMAC_FDBCK0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_HMAC_FDBCK0</displayName>
          <description>SHA/HMAC Output Feedback Data 0 After SHA/HMAC Operation</description>
          <addressOffset>0x358</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FDBCK</name>
              <description>SHA/HMAC Feedback Information\nThe feedback value is 1728 bits in size for SHA1/2 and 2784 bits in size for SHA3.\nThe SHA/HMAC engine uses the data from CRYPTO_HMAC_FDBCKx as the data inputted to CRYPTO_HMAC_FDBCKx for the next block in DMA cascade mode.\nThe SHA/HMAC engine outputs feedback information for initial setting in the next block's operation. Software can store that feedback value temporarily. After switching back, fill the stored feedback value to CRYPTO_HMAC_FDBCKx in the same operation, and then continue the operation with the original setting.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
