wosayttn/sdk-bsp-numaker-m55m1/Debug/svd/M55M1.svd
       <register derivedFrom="CRYPTO_HMAC_FDBCK0">
          <name>CRYPTO_HMAC_FDBCK1</name>
          <displayName>CRYPTO_HMAC_FDBCK1</displayName>
          <description>SHA/HMAC Output Feedback Data 1 After SHA/HMAC Operation</description>
          <addressOffset>0x35C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_FDBCK0">
          <name>CRYPTO_HMAC_FDBCK2</name>
          <displayName>CRYPTO_HMAC_FDBCK2</displayName>
          <description>SHA/HMAC Output Feedback Data 2 After SHA/HMAC Operation</description>
          <addressOffset>0x360</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_FDBCK0">
          <name>CRYPTO_HMAC_FDBCK3</name>
          <displayName>CRYPTO_HMAC_FDBCK3</displayName>
          <description>SHA/HMAC Output Feedback Data 3 After SHA/HMAC Operation</description>
          <addressOffset>0x364</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_FDBCK0">
          <name>CRYPTO_HMAC_FDBCK4</name>
          <displayName>CRYPTO_HMAC_FDBCK4</displayName>
          <description>SHA/HMAC Output Feedback Data 4 After SHA/HMAC Operation</description>
          <addressOffset>0x368</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_FDBCK0">
          <name>CRYPTO_HMAC_FDBCK5</name>
          <displayName>CRYPTO_HMAC_FDBCK5</displayName>
          <description>SHA/HMAC Output Feedback Data 5 After SHA/HMAC Operation</description>
          <addressOffset>0x36C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_FDBCK0">
          <name>CRYPTO_HMAC_FDBCK6</name>
          <displayName>CRYPTO_HMAC_FDBCK6</displayName>
          <description>SHA/HMAC Output Feedback Data 6 After SHA/HMAC Operation</description>
          <addressOffset>0x370</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_FDBCK0">
          <name>CRYPTO_HMAC_FDBCK7</name>
          <displayName>CRYPTO_HMAC_FDBCK7</displayName>
          <description>SHA/HMAC Output Feedback Data 7 After SHA/HMAC Operation</description>
          <addressOffset>0x374</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_FDBCK0">
          <name>CRYPTO_HMAC_FDBCK8</name>
          <displayName>CRYPTO_HMAC_FDBCK8</displayName>
          <description>SHA/HMAC Output Feedback Data 8 After SHA/HMAC Operation</description>
          <addressOffset>0x378</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_FDBCK0">
          <name>CRYPTO_HMAC_FDBCK9</name>
          <displayName>CRYPTO_HMAC_FDBCK9</displayName>
          <description>SHA/HMAC Output Feedback Data 9 After SHA/HMAC Operation</description>
          <addressOffset>0x37C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_FDBCK0">
          <name>CRYPTO_HMAC_FDBCK10</name>
          <displayName>CRYPTO_HMAC_FDBCK10</displayName>
          <description>SHA/HMAC Output Feedback Data 10 After SHA/HMAC Operation</description>
          <addressOffset>0x380</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_FDBCK0">
          <name>CRYPTO_HMAC_FDBCK11</name>
          <displayName>CRYPTO_HMAC_FDBCK11</displayName>
          <description>SHA/HMAC Output Feedback Data 11 After SHA/HMAC Operation</description>
          <addressOffset>0x384</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_FDBCK0">
          <name>CRYPTO_HMAC_FDBCK12</name>
          <displayName>CRYPTO_HMAC_FDBCK12</displayName>
          <description>SHA/HMAC Output Feedback Data 12 After SHA/HMAC Operation</description>
          <addressOffset>0x388</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_FDBCK0">
          <name>CRYPTO_HMAC_FDBCK13</name>
          <displayName>CRYPTO_HMAC_FDBCK13</displayName>
          <description>SHA/HMAC Output Feedback Data 13 After SHA/HMAC Operation</description>
          <addressOffset>0x38C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_FDBCK0">
          <name>CRYPTO_HMAC_FDBCK14</name>
          <displayName>CRYPTO_HMAC_FDBCK14</displayName>
          <description>SHA/HMAC Output Feedback Data 14 After SHA/HMAC Operation</description>
          <addressOffset>0x390</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_FDBCK0">
          <name>CRYPTO_HMAC_FDBCK15</name>
          <displayName>CRYPTO_HMAC_FDBCK15</displayName>
          <description>SHA/HMAC Output Feedback Data 15 After SHA/HMAC Operation</description>
          <addressOffset>0x394</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_FDBCK0">
          <name>CRYPTO_HMAC_FDBCK16</name>
          <displayName>CRYPTO_HMAC_FDBCK16</displayName>
          <description>SHA/HMAC Output Feedback Data 16 After SHA/HMAC Operation</description>
          <addressOffset>0x398</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_FDBCK0">
          <name>CRYPTO_HMAC_FDBCK17</name>
          <displayName>CRYPTO_HMAC_FDBCK17</displayName>
          <description>SHA/HMAC Output Feedback Data 17 After SHA/HMAC Operation</description>
          <addressOffset>0x39C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_FDBCK0">
          <name>CRYPTO_HMAC_FDBCK18</name>
          <displayName>CRYPTO_HMAC_FDBCK18</displayName>
          <description>SHA/HMAC Output Feedback Data 18 After SHA/HMAC Operation</description>
          <addressOffset>0x3A0</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_FDBCK0">
          <name>CRYPTO_HMAC_FDBCK19</name>
          <displayName>CRYPTO_HMAC_FDBCK19</displayName>
          <description>SHA/HMAC Output Feedback Data 19 After SHA/HMAC Operation</description>
          <addressOffset>0x3A4</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_FDBCK0">
          <name>CRYPTO_HMAC_FDBCK20</name>
          <displayName>CRYPTO_HMAC_FDBCK20</displayName>
          <description>SHA/HMAC Output Feedback Data 20 After SHA/HMAC Operation</description>
          <addressOffset>0x3A8</addressOffset>
       </register>
