wosayttn/sdk-bsp-numaker-m55m1/Debug/svd/M55M1.svd
       <register derivedFrom="CRYPTO_HMAC_FDBCK0">
          <name>CRYPTO_HMAC_FDBCK81</name>
          <displayName>CRYPTO_HMAC_FDBCK81</displayName>
          <description>SHA/HMAC Output Feedback Data 81 After SHA/HMAC Operation</description>
          <addressOffset>0x49C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_FDBCK0">
          <name>CRYPTO_HMAC_FDBCK82</name>
          <displayName>CRYPTO_HMAC_FDBCK82</displayName>
          <description>SHA/HMAC Output Feedback Data 82 After SHA/HMAC Operation</description>
          <addressOffset>0x4A0</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_FDBCK0">
          <name>CRYPTO_HMAC_FDBCK83</name>
          <displayName>CRYPTO_HMAC_FDBCK83</displayName>
          <description>SHA/HMAC Output Feedback Data 83 After SHA/HMAC Operation</description>
          <addressOffset>0x4A4</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_FDBCK0">
          <name>CRYPTO_HMAC_FDBCK84</name>
          <displayName>CRYPTO_HMAC_FDBCK84</displayName>
          <description>SHA/HMAC Output Feedback Data 84 After SHA/HMAC Operation</description>
          <addressOffset>0x4A8</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_FDBCK0">
          <name>CRYPTO_HMAC_FDBCK85</name>
          <displayName>CRYPTO_HMAC_FDBCK85</displayName>
          <description>SHA/HMAC Output Feedback Data 85 After SHA/HMAC Operation</description>
          <addressOffset>0x4AC</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_FDBCK0">
          <name>CRYPTO_HMAC_FDBCK86</name>
          <displayName>CRYPTO_HMAC_FDBCK86</displayName>
          <description>SHA/HMAC Output Feedback Data 86 After SHA/HMAC Operation</description>
          <addressOffset>0x4B0</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_FDBCK0">
          <name>CRYPTO_HMAC_FDBCK87</name>
          <displayName>CRYPTO_HMAC_FDBCK87</displayName>
          <description>SHA/HMAC Output Feedback Data 87 After SHA/HMAC Operation</description>
          <addressOffset>0x4B4</addressOffset>
       </register>
       <register>
          <name>CRYPTO_HMAC_SHA512T</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_HMAC_SHA512T</displayName>
          <description>SHA/HMAC SHA512/t Control Register</description>
          <addressOffset>0x4F8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHA512TEN</name>
              <description>SHA512/t Engine Enable Bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Execute other function</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Execute SHA512/t function if SHA3EN=0, and SM3EN=0</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>TLEN</name>
              <description>SHA512/t Output Digest Length\nThe TLEN is equal to value t of SHA512/t. It also means the output digest length of SHA512 /t.\nNote: TLEN  512, and TLEN is not 384</description>
              <bitOffset>8</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CRYPTO_HMAC_FBADDR</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_HMAC_FBADDR</displayName>
          <description>SHA/HMAC DMA Feedback Address Register</description>
          <addressOffset>0x4FC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FBADDR</name>
              <description>SHA/HMAC DMA Feedback Address\nIn DMA cascade mode, software can update DMA feedback address register for automatically reading and writing feedback values via DMA. The FBADDR keeps the feedback address of the feedback data for the next cascade operation. Based on the feedback address, the SHA/HMAC accelerator can read the feedback data of the last cascade operation from SRAM memory space and write the feedback data of the current cascade operation to SRAM memory space. The start of feedback address should be located at word boundary. In other words, bit 1 and 0 of FBADDR are ignored.\nFBADDR can be read and written.\nIn DMA mode, software can update the next CRYPTO_HMAC_FBADDR before triggering START.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CRYPTO_HMAC_SHAKEDGST0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_HMAC_SHAKEDGST0</displayName>
          <description>SHA/HMAC SHAKE Digest Message 0</description>
          <addressOffset>0x500</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DGST</name>
              <description>SHA/HMAC SHAKE Digest Message Register\nFor SHAKE-128, the digest is stored in CRYPTO_HMAC_SHAKEDGST0 0 ~ CRYPTO_HMAC_ SHAKEDGST0 41.\nFor SHAKE-256, the digest is stored in CRYPTO_HMAC_SHAKEDGST0 0 ~ CRYPTO_HMAC_ SHAKEDGST0 33.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
