wosayttn/sdk-bsp-numaker-m55m1/Debug/svd/M55M1.svd
       <register derivedFrom="CRYPTO_HMAC_SHAKEDGST0">
          <name>CRYPTO_HMAC_SHAKEDGST1</name>
          <displayName>CRYPTO_HMAC_SHAKEDGST1</displayName>
          <description>SHA/HMAC SHAKE Digest Message 1</description>
          <addressOffset>0x504</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_SHAKEDGST0">
          <name>CRYPTO_HMAC_SHAKEDGST2</name>
          <displayName>CRYPTO_HMAC_SHAKEDGST2</displayName>
          <description>SHA/HMAC SHAKE Digest Message 2</description>
          <addressOffset>0x508</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_SHAKEDGST0">
          <name>CRYPTO_HMAC_SHAKEDGST3</name>
          <displayName>CRYPTO_HMAC_SHAKEDGST3</displayName>
          <description>SHA/HMAC SHAKE Digest Message 3</description>
          <addressOffset>0x50C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_SHAKEDGST0">
          <name>CRYPTO_HMAC_SHAKEDGST4</name>
          <displayName>CRYPTO_HMAC_SHAKEDGST4</displayName>
          <description>SHA/HMAC SHAKE Digest Message 4</description>
          <addressOffset>0x510</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_SHAKEDGST0">
          <name>CRYPTO_HMAC_SHAKEDGST5</name>
          <displayName>CRYPTO_HMAC_SHAKEDGST5</displayName>
          <description>SHA/HMAC SHAKE Digest Message 5</description>
          <addressOffset>0x514</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_SHAKEDGST0">
          <name>CRYPTO_HMAC_SHAKEDGST6</name>
          <displayName>CRYPTO_HMAC_SHAKEDGST6</displayName>
          <description>SHA/HMAC SHAKE Digest Message 6</description>
          <addressOffset>0x518</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_SHAKEDGST0">
          <name>CRYPTO_HMAC_SHAKEDGST7</name>
          <displayName>CRYPTO_HMAC_SHAKEDGST7</displayName>
          <description>SHA/HMAC SHAKE Digest Message 7</description>
          <addressOffset>0x51C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_SHAKEDGST0">
          <name>CRYPTO_HMAC_SHAKEDGST8</name>
          <displayName>CRYPTO_HMAC_SHAKEDGST8</displayName>
          <description>SHA/HMAC SHAKE Digest Message 8</description>
          <addressOffset>0x520</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_SHAKEDGST0">
          <name>CRYPTO_HMAC_SHAKEDGST9</name>
          <displayName>CRYPTO_HMAC_SHAKEDGST9</displayName>
          <description>SHA/HMAC SHAKE Digest Message 9</description>
          <addressOffset>0x524</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_SHAKEDGST0">
          <name>CRYPTO_HMAC_SHAKEDGST10</name>
          <displayName>CRYPTO_HMAC_SHAKEDGST10</displayName>
          <description>SHA/HMAC SHAKE Digest Message 10</description>
          <addressOffset>0x528</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_SHAKEDGST0">
          <name>CRYPTO_HMAC_SHAKEDGST11</name>
          <displayName>CRYPTO_HMAC_SHAKEDGST11</displayName>
          <description>SHA/HMAC SHAKE Digest Message 11</description>
          <addressOffset>0x52C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_SHAKEDGST0">
          <name>CRYPTO_HMAC_SHAKEDGST12</name>
          <displayName>CRYPTO_HMAC_SHAKEDGST12</displayName>
          <description>SHA/HMAC SHAKE Digest Message 12</description>
          <addressOffset>0x530</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_SHAKEDGST0">
          <name>CRYPTO_HMAC_SHAKEDGST13</name>
          <displayName>CRYPTO_HMAC_SHAKEDGST13</displayName>
          <description>SHA/HMAC SHAKE Digest Message 13</description>
          <addressOffset>0x534</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_SHAKEDGST0">
          <name>CRYPTO_HMAC_SHAKEDGST14</name>
          <displayName>CRYPTO_HMAC_SHAKEDGST14</displayName>
          <description>SHA/HMAC SHAKE Digest Message 14</description>
          <addressOffset>0x538</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_SHAKEDGST0">
          <name>CRYPTO_HMAC_SHAKEDGST15</name>
          <displayName>CRYPTO_HMAC_SHAKEDGST15</displayName>
          <description>SHA/HMAC SHAKE Digest Message 15</description>
          <addressOffset>0x53C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_SHAKEDGST0">
          <name>CRYPTO_HMAC_SHAKEDGST16</name>
          <displayName>CRYPTO_HMAC_SHAKEDGST16</displayName>
          <description>SHA/HMAC SHAKE Digest Message 16</description>
          <addressOffset>0x540</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_SHAKEDGST0">
          <name>CRYPTO_HMAC_SHAKEDGST17</name>
          <displayName>CRYPTO_HMAC_SHAKEDGST17</displayName>
          <description>SHA/HMAC SHAKE Digest Message 17</description>
          <addressOffset>0x544</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_SHAKEDGST0">
          <name>CRYPTO_HMAC_SHAKEDGST18</name>
          <displayName>CRYPTO_HMAC_SHAKEDGST18</displayName>
          <description>SHA/HMAC SHAKE Digest Message 18</description>
          <addressOffset>0x548</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_SHAKEDGST0">
          <name>CRYPTO_HMAC_SHAKEDGST19</name>
          <displayName>CRYPTO_HMAC_SHAKEDGST19</displayName>
          <description>SHA/HMAC SHAKE Digest Message 19</description>
          <addressOffset>0x54C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_SHAKEDGST0">
          <name>CRYPTO_HMAC_SHAKEDGST20</name>
          <displayName>CRYPTO_HMAC_SHAKEDGST20</displayName>
          <description>SHA/HMAC SHAKE Digest Message 20</description>
          <addressOffset>0x550</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_SHAKEDGST0">
          <name>CRYPTO_HMAC_SHAKEDGST21</name>
          <displayName>CRYPTO_HMAC_SHAKEDGST21</displayName>
          <description>SHA/HMAC SHAKE Digest Message 21</description>
          <addressOffset>0x554</addressOffset>
       </register>
