wosayttn/sdk-bsp-numaker-m55m1/Debug/svd/M55M1.svd
       <register derivedFrom="CRYPTO_ECC_Y2_00">
          <name>CRYPTO_ECC_Y2_11</name>
          <displayName>CRYPTO_ECC_Y2_11</displayName>
          <description>ECC the Y-coordinate Word11 of the Second Point</description>
          <addressOffset>0x90C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y2_00">
          <name>CRYPTO_ECC_Y2_12</name>
          <displayName>CRYPTO_ECC_Y2_12</displayName>
          <description>ECC the Y-coordinate Word12 of the Second Point</description>
          <addressOffset>0x910</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y2_00">
          <name>CRYPTO_ECC_Y2_13</name>
          <displayName>CRYPTO_ECC_Y2_13</displayName>
          <description>ECC the Y-coordinate Word13 of the Second Point</description>
          <addressOffset>0x914</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y2_00">
          <name>CRYPTO_ECC_Y2_14</name>
          <displayName>CRYPTO_ECC_Y2_14</displayName>
          <description>ECC the Y-coordinate Word14 of the Second Point</description>
          <addressOffset>0x918</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y2_00">
          <name>CRYPTO_ECC_Y2_15</name>
          <displayName>CRYPTO_ECC_Y2_15</displayName>
          <description>ECC the Y-coordinate Word15 of the Second Point</description>
          <addressOffset>0x91C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y2_00">
          <name>CRYPTO_ECC_Y2_16</name>
          <displayName>CRYPTO_ECC_Y2_16</displayName>
          <description>ECC the Y-coordinate Word16 of the Second Point</description>
          <addressOffset>0x920</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y2_00">
          <name>CRYPTO_ECC_Y2_17</name>
          <displayName>CRYPTO_ECC_Y2_17</displayName>
          <description>ECC the Y-coordinate Word17 of the Second Point</description>
          <addressOffset>0x924</addressOffset>
       </register>
       <register>
          <name>CRYPTO_ECC_A_00</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_ECC_A_00</displayName>
          <description>ECC the Parameter CURVEA Word0 of Elliptic Curve</description>
          <addressOffset>0x928</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CURVEA</name>
              <description>ECC the Parameter CURVEA Value of Elliptic Curve \nFor B-163 or K-163, CURVEA is stored in CRYPTO_ECC_A_00~CRYPTO_ECC_A_05\nFor B-233 or K-233, CURVEA is stored in CRYPTO_ECC_A_00~CRYPTO_ECC_A_07\nFor B-283 or K-283, CURVEA is stored in CRYPTO_ECC_A_00~CRYPTO_ECC_A_08\nFor B-409 or K-409, CURVEA is stored in CRYPTO_ECC_A_00~CRYPTO_ECC_A_12\nFor B-571 or K-571, CURVEA is stored in CRYPTO_ECC_A_00~CRYPTO_ECC_A_17\nFor P-192, CURVEA is stored in CRYPTO_ECC_A_00~CRYPTO_ECC_A_05\nFor P-224, CURVEA is stored in CRYPTO_ECC_A_00~CRYPTO_ECC_A_06\nFor P-256 or SM2, CURVEA is stored in CRYPTO_ECC_A_00~CRYPTO_ECC_A_07\nFor P-384, CURVEA is stored in CRYPTO_ECC_A_00~CRYPTO_ECC_A_11\nFor P-521, CURVEA is stored in CRYPTO_ECC_A_00~CRYPTO_ECC_A_16</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="CRYPTO_ECC_A_00">
          <name>CRYPTO_ECC_A_01</name>
          <displayName>CRYPTO_ECC_A_01</displayName>
          <description>ECC the Parameter CURVEA Word1 of Elliptic Curve</description>
          <addressOffset>0x92C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_A_00">
          <name>CRYPTO_ECC_A_02</name>
          <displayName>CRYPTO_ECC_A_02</displayName>
          <description>ECC the Parameter CURVEA Word2 of Elliptic Curve</description>
          <addressOffset>0x930</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_A_00">
          <name>CRYPTO_ECC_A_03</name>
          <displayName>CRYPTO_ECC_A_03</displayName>
          <description>ECC the Parameter CURVEA Word3 of Elliptic Curve</description>
          <addressOffset>0x934</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_A_00">
          <name>CRYPTO_ECC_A_04</name>
          <displayName>CRYPTO_ECC_A_04</displayName>
          <description>ECC the Parameter CURVEA Word4 of Elliptic Curve</description>
          <addressOffset>0x938</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_A_00">
          <name>CRYPTO_ECC_A_05</name>
          <displayName>CRYPTO_ECC_A_05</displayName>
          <description>ECC the Parameter CURVEA Word5 of Elliptic Curve</description>
          <addressOffset>0x93C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_A_00">
          <name>CRYPTO_ECC_A_06</name>
          <displayName>CRYPTO_ECC_A_06</displayName>
          <description>ECC the Parameter CURVEA Word6 of Elliptic Curve</description>
          <addressOffset>0x940</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_A_00">
          <name>CRYPTO_ECC_A_07</name>
          <displayName>CRYPTO_ECC_A_07</displayName>
          <description>ECC the Parameter CURVEA Word7 of Elliptic Curve</description>
          <addressOffset>0x944</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_A_00">
          <name>CRYPTO_ECC_A_08</name>
          <displayName>CRYPTO_ECC_A_08</displayName>
          <description>ECC the Parameter CURVEA Word8 of Elliptic Curve</description>
          <addressOffset>0x948</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_A_00">
          <name>CRYPTO_ECC_A_09</name>
          <displayName>CRYPTO_ECC_A_09</displayName>
          <description>ECC the Parameter CURVEA Word9 of Elliptic Curve</description>
          <addressOffset>0x94C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_A_00">
          <name>CRYPTO_ECC_A_10</name>
          <displayName>CRYPTO_ECC_A_10</displayName>
          <description>ECC the Parameter CURVEA Word10 of Elliptic Curve</description>
          <addressOffset>0x950</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_A_00">
          <name>CRYPTO_ECC_A_11</name>
          <displayName>CRYPTO_ECC_A_11</displayName>
          <description>ECC the Parameter CURVEA Word11 of Elliptic Curve</description>
          <addressOffset>0x954</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_A_00">
          <name>CRYPTO_ECC_A_12</name>
          <displayName>CRYPTO_ECC_A_12</displayName>
          <description>ECC the Parameter CURVEA Word12 of Elliptic Curve</description>
          <addressOffset>0x958</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_A_00">
          <name>CRYPTO_ECC_A_13</name>
          <displayName>CRYPTO_ECC_A_13</displayName>
          <description>ECC the Parameter CURVEA Word13 of Elliptic Curve</description>
          <addressOffset>0x95C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_A_00">
          <name>CRYPTO_ECC_A_14</name>
          <displayName>CRYPTO_ECC_A_14</displayName>
          <description>ECC the Parameter CURVEA Word14 of Elliptic Curve</description>
          <addressOffset>0x960</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_A_00">
          <name>CRYPTO_ECC_A_15</name>
          <displayName>CRYPTO_ECC_A_15</displayName>
          <description>ECC the Parameter CURVEA Word15 of Elliptic Curve</description>
          <addressOffset>0x964</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_A_00">
          <name>CRYPTO_ECC_A_16</name>
          <displayName>CRYPTO_ECC_A_16</displayName>
          <description>ECC the Parameter CURVEA Word16 of Elliptic Curve</description>
          <addressOffset>0x968</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_A_00">
          <name>CRYPTO_ECC_A_17</name>
          <displayName>CRYPTO_ECC_A_17</displayName>
          <description>ECC the Parameter CURVEA Word17 of Elliptic Curve</description>
          <addressOffset>0x96C</addressOffset>
       </register>
       <register>
          <name>CRYPTO_ECC_B_00</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_ECC_B_00</displayName>
          <description>ECC the Parameter CURVEB Word0 of Elliptic Curve</description>
          <addressOffset>0x970</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CURVEB</name>
              <description>ECC the Parameter CURVEB Value of Elliptic Curve \nFor B-163 or K-163, CURVEB is stored in CRYPTO_ECC_B_00~CRYPTO_ECC_B_05\nFor B-233 or K-233, CURVEB is stored in CRYPTO_ECC_B_00~CRYPTO_ECC_B_07\nFor B-283 or K-283, CURVEB is stored in CRYPTO_ECC_B_00~CRYPTO_ECC_B_08\nFor B-409 or K-409, CURVEB is stored in CRYPTO_ECC_B_00~CRYPTO_ECC_B_12\nFor B-521 or K-521, CURVEB is stored in CRYPTO_ECC_B_00~CRYPTO_ECC_B_17\nFor P-192, CURVEB is stored in CRYPTO_ECC_B_00~CRYPTO_ECC_B_05\nFor P-224, CURVEB is stored in CRYPTO_ECC_B_00~CRYPTO_ECC_B_06\nFor P-256 or SM2, CURVEB is stored in CRYPTO_ECC_B_00~CRYPTO_ECC_B_07\nFor P-384, CURVEB is stored in CRYPTO_ECC_B_00~CRYPTO_ECC_B_11\nFor P-521, CURVEB is stored in CRYPTO_ECC_B_00~CRYPTO_ECC_B_16</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="CRYPTO_ECC_B_00">
          <name>CRYPTO_ECC_B_01</name>
          <displayName>CRYPTO_ECC_B_01</displayName>
          <description>ECC the Parameter CURVEB Word1 of Elliptic Curve</description>
          <addressOffset>0x974</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_B_00">
          <name>CRYPTO_ECC_B_02</name>
          <displayName>CRYPTO_ECC_B_02</displayName>
          <description>ECC the Parameter CURVEB Word2 of Elliptic Curve</description>
          <addressOffset>0x978</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_B_00">
          <name>CRYPTO_ECC_B_03</name>
          <displayName>CRYPTO_ECC_B_03</displayName>
          <description>ECC the Parameter CURVEB Word3 of Elliptic Curve</description>
          <addressOffset>0x97C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_B_00">
          <name>CRYPTO_ECC_B_04</name>
          <displayName>CRYPTO_ECC_B_04</displayName>
          <description>ECC the Parameter CURVEB Word4 of Elliptic Curve</description>
          <addressOffset>0x980</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_B_00">
          <name>CRYPTO_ECC_B_05</name>
          <displayName>CRYPTO_ECC_B_05</displayName>
          <description>ECC the Parameter CURVEB Word5 of Elliptic Curve</description>
          <addressOffset>0x984</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_B_00">
          <name>CRYPTO_ECC_B_06</name>
          <displayName>CRYPTO_ECC_B_06</displayName>
          <description>ECC the Parameter CURVEB Word6 of Elliptic Curve</description>
          <addressOffset>0x988</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_B_00">
          <name>CRYPTO_ECC_B_07</name>
          <displayName>CRYPTO_ECC_B_07</displayName>
          <description>ECC the Parameter CURVEB Word7 of Elliptic Curve</description>
          <addressOffset>0x98C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_B_00">
          <name>CRYPTO_ECC_B_08</name>
          <displayName>CRYPTO_ECC_B_08</displayName>
          <description>ECC the Parameter CURVEB Word8 of Elliptic Curve</description>
          <addressOffset>0x990</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_B_00">
          <name>CRYPTO_ECC_B_09</name>
          <displayName>CRYPTO_ECC_B_09</displayName>
          <description>ECC the Parameter CURVEB Word9 of Elliptic Curve</description>
          <addressOffset>0x994</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_B_00">
          <name>CRYPTO_ECC_B_10</name>
          <displayName>CRYPTO_ECC_B_10</displayName>
          <description>ECC the Parameter CURVEB Word10 of Elliptic Curve</description>
          <addressOffset>0x998</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_B_00">
          <name>CRYPTO_ECC_B_11</name>
          <displayName>CRYPTO_ECC_B_11</displayName>
          <description>ECC the Parameter CURVEB Word11 of Elliptic Curve</description>
          <addressOffset>0x99C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_B_00">
          <name>CRYPTO_ECC_B_12</name>
          <displayName>CRYPTO_ECC_B_12</displayName>
          <description>ECC the Parameter CURVEB Word12 of Elliptic Curve</description>
          <addressOffset>0x9A0</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_B_00">
          <name>CRYPTO_ECC_B_13</name>
          <displayName>CRYPTO_ECC_B_13</displayName>
          <description>ECC the Parameter CURVEB Word13 of Elliptic Curve</description>
          <addressOffset>0x9A4</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_B_00">
          <name>CRYPTO_ECC_B_14</name>
          <displayName>CRYPTO_ECC_B_14</displayName>
          <description>ECC the Parameter CURVEB Word14 of Elliptic Curve</description>
          <addressOffset>0x9A8</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_B_00">
          <name>CRYPTO_ECC_B_15</name>
          <displayName>CRYPTO_ECC_B_15</displayName>
          <description>ECC the Parameter CURVEB Word15 of Elliptic Curve</description>
          <addressOffset>0x9AC</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_B_00">
          <name>CRYPTO_ECC_B_16</name>
          <displayName>CRYPTO_ECC_B_16</displayName>
          <description>ECC the Parameter CURVEB Word16 of Elliptic Curve</description>
          <addressOffset>0x9B0</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_B_00">
          <name>CRYPTO_ECC_B_17</name>
          <displayName>CRYPTO_ECC_B_17</displayName>
          <description>ECC the Parameter CURVEB Word17 of Elliptic Curve</description>
          <addressOffset>0x9B4</addressOffset>
       </register>
       <register>
          <name>CRYPTO_ECC_N_00</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_ECC_N_00</displayName>
          <description>ECC the Parameter CURVEN Word0 of Elliptic Curve</description>
          <addressOffset>0x9B8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CURVEN</name>
              <description>ECC the Parameter CURVEN Value of Elliptic Curve \nIn GF(p), CURVEN is the prime p.\nIn GF(2m), CURVEN is  the irreducible polynomial.\nFor B-163 or K-163, CURVEN is stored in CRYPTO_ECC_N_00~CRYPTO_ECC_N_05\nFor B-233 or K-233, CURVEN is stored in CRYPTO_ECC_N_00~CRYPTO_ECC_N_07\nFor B-283 or K-283, CURVEN is stored in CRYPTO_ECC_N_00~CRYPTO_ECC_N_08\nFor B-409 or K-409, CURVEN is stored in CRYPTO_ECC_N_00~CRYPTO_ECC_N_12\nFor B-571 or K-571, CURVEN is stored in CRYPTO_ECC_N_00~CRYPTO_ECC_N_17\nFor P-192, CURVEN is stored in CRYPTO_ECC_N_00~CRYPTO_ECC_N_05\nFor P-224, CURVEN is stored in CRYPTO_ECC_N_00~CRYPTO_ECC_N_06\nFor P-256 or SM2, CURVEN is stored in CRYPTO_ECC_N_00~CRYPTO_ECC_N_07\nFor P-384, CURVEN is stored in CRYPTO_ECC_N_00~CRYPTO_ECC_N_11\nFor P-521, CURVEN is stored in CRYPTO_ECC_N_00~CRYPTO_ECC_N_16</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="CRYPTO_ECC_N_00">
          <name>CRYPTO_ECC_N_01</name>
          <displayName>CRYPTO_ECC_N_01</displayName>
          <description>ECC the Parameter CURVEN Word1 of Elliptic Curve</description>
          <addressOffset>0x9BC</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_N_00">
          <name>CRYPTO_ECC_N_02</name>
          <displayName>CRYPTO_ECC_N_02</displayName>
          <description>ECC the Parameter CURVEN Word2 of Elliptic Curve</description>
          <addressOffset>0x9C0</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_N_00">
          <name>CRYPTO_ECC_N_03</name>
          <displayName>CRYPTO_ECC_N_03</displayName>
          <description>ECC the Parameter CURVEN Word3 of Elliptic Curve</description>
          <addressOffset>0x9C4</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_N_00">
          <name>CRYPTO_ECC_N_04</name>
          <displayName>CRYPTO_ECC_N_04</displayName>
          <description>ECC the Parameter CURVEN Word4 of Elliptic Curve</description>
          <addressOffset>0x9C8</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_N_00">
          <name>CRYPTO_ECC_N_05</name>
          <displayName>CRYPTO_ECC_N_05</displayName>
          <description>ECC the Parameter CURVEN Word5 of Elliptic Curve</description>
          <addressOffset>0x9CC</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_N_00">
          <name>CRYPTO_ECC_N_06</name>
          <displayName>CRYPTO_ECC_N_06</displayName>
          <description>ECC the Parameter CURVEN Word6 of Elliptic Curve</description>
          <addressOffset>0x9D0</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_N_00">
          <name>CRYPTO_ECC_N_07</name>
          <displayName>CRYPTO_ECC_N_07</displayName>
          <description>ECC the Parameter CURVEN Word7 of Elliptic Curve</description>
          <addressOffset>0x9D4</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_N_00">
          <name>CRYPTO_ECC_N_08</name>
          <displayName>CRYPTO_ECC_N_08</displayName>
          <description>ECC the Parameter CURVEN Word8 of Elliptic Curve</description>
          <addressOffset>0x9D8</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_N_00">
          <name>CRYPTO_ECC_N_09</name>
          <displayName>CRYPTO_ECC_N_09</displayName>
          <description>ECC the Parameter CURVEN Word9 of Elliptic Curve</description>
          <addressOffset>0x9DC</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_N_00">
          <name>CRYPTO_ECC_N_10</name>
          <displayName>CRYPTO_ECC_N_10</displayName>
          <description>ECC the Parameter CURVEN Word10 of Elliptic Curve</description>
          <addressOffset>0x9E0</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_N_00">
          <name>CRYPTO_ECC_N_11</name>
          <displayName>CRYPTO_ECC_N_11</displayName>
          <description>ECC the Parameter CURVEN Word11 of Elliptic Curve</description>
          <addressOffset>0x9E4</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_N_00">
          <name>CRYPTO_ECC_N_12</name>
          <displayName>CRYPTO_ECC_N_12</displayName>
          <description>ECC the Parameter CURVEN Word12 of Elliptic Curve</description>
          <addressOffset>0x9E8</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_N_00">
          <name>CRYPTO_ECC_N_13</name>
          <displayName>CRYPTO_ECC_N_13</displayName>
          <description>ECC the Parameter CURVEN Word13 of Elliptic Curve</description>
          <addressOffset>0x9EC</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_N_00">
          <name>CRYPTO_ECC_N_14</name>
          <displayName>CRYPTO_ECC_N_14</displayName>
          <description>ECC the Parameter CURVEN Word14 of Elliptic Curve</description>
          <addressOffset>0x9F0</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_N_00">
          <name>CRYPTO_ECC_N_15</name>
          <displayName>CRYPTO_ECC_N_15</displayName>
          <description>ECC the Parameter CURVEN Word15 of Elliptic Curve</description>
          <addressOffset>0x9F4</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_N_00">
          <name>CRYPTO_ECC_N_16</name>
          <displayName>CRYPTO_ECC_N_16</displayName>
          <description>ECC the Parameter CURVEN Word16 of Elliptic Curve</description>
          <addressOffset>0x9F8</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_N_00">
          <name>CRYPTO_ECC_N_17</name>
          <displayName>CRYPTO_ECC_N_17</displayName>
          <description>ECC the Parameter CURVEN Word17 of Elliptic Curve</description>
          <addressOffset>0x9FC</addressOffset>
       </register>
       <register>
          <name>CRYPTO_ECC_K_00</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_ECC_K_00</displayName>
          <description>ECC the Scalar SCALARK Word0 of Point Multiplication</description>
          <addressOffset>0xA00</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SCALARK</name>
              <description>ECC the Scalar SCALARK Value of Point Multiplication\nBecause the SCALARK usually stores the private key, ECC accelerator do not allow to read the register SCALARK.\nFor B-163 or K-163, SCALARK is stored in CRYPTO_ECC_K_00~CRYPTO_ECC_K_05\nFor B-233 or K-233, SCALARK is stored in CRYPTO_ECC_K_00~CRYPTO_ECC_K_07\nFor B-283 or K-283, SCALARK is stored in CRYPTO_ECC_K_00~CRYPTO_ECC_K_08\nFor B-409 or K-409, SCALARK is stored in CRYPTO_ECC_K_00~CRYPTO_ECC_K_12\nFor B-571 or K-571, SCALARK is stored in CRYPTO_ECC_K_00~CRYPTO_ECC_K_17\nFor P-192, SCALARK is stored in CRYPTO_ECC_K_00~CRYPTO_ECC_K_05\nFor P-224, SCALARK is stored in CRYPTO_ECC_K_00~CRYPTO_ECC_K_06\nFor P-256 or SM2, SCALARK is stored in CRYPTO_ECC_K_00~CRYPTO_ECC_K_07\nFor P-384, SCALARK is stored in CRYPTO_ECC_K_00~CRYPTO_ECC_K_11\nFor P-521, SCALARK is stored in CRYPTO_ECC_K_00~CRYPTO_ECC_K_16</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="CRYPTO_ECC_K_00">
          <name>CRYPTO_ECC_K_01</name>
          <displayName>CRYPTO_ECC_K_01</displayName>
          <description>ECC the Scalar SCALARK Word1 of Point Multiplication</description>
          <addressOffset>0xA04</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_K_00">
          <name>CRYPTO_ECC_K_02</name>
          <displayName>CRYPTO_ECC_K_02</displayName>
          <description>ECC the Scalar SCALARK Word2 of Point Multiplication</description>
          <addressOffset>0xA08</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_K_00">
          <name>CRYPTO_ECC_K_03</name>
          <displayName>CRYPTO_ECC_K_03</displayName>
          <description>ECC the Scalar SCALARK Word3 of Point Multiplication</description>
          <addressOffset>0xA0C</addressOffset>
       </register>
