wosayttn/sdk-bsp-numaker-m55m1/Debug/svd/M55M1.svd
       <register>
          <name>KPI_KRF0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>KPI_KRF0</displayName>
          <description>Lower 32 Key Release Flag Register 0</description>
          <addressOffset>0x20</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>KRFmn</name>
              <description>Lower 32 Key Release Flag\nm is row number, n is column number.\nNote: This bit will be set by hardware, and should be cleared by software writing 1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No key event</description>
                    <value>0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Corresponding key has a low to high event change</description>
                    <value>1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>KPI_KRF1</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>KPI_KRF1</displayName>
          <description>Upper 32 Key Release Flag Register 1</description>
          <addressOffset>0x24</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>KRFmn</name>
              <description>Upper 32 Key Release Flag\nm is row number, n is column number.\nNote: This bit will be set by hardware, and should be cleared by software writing 1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No key event</description>
                    <value>0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Corresponding key has a low to high event change</description>
                    <value>1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>KPI_DLYCTL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>KPI_DLYCTL</displayName>
          <description>Delay Control Register</description>
          <addressOffset>0x28</addressOffset>
          <access>read-write</access>
          <resetValue>0x0000001F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PSCDIV</name>
              <description>Pre-scale Divider\nThis value is used to divide PRESCALE that is set in KPI_CTL[15:8]. The prescale divider counter is clocked by the divided crystal clock, XCLOCK. The number is from 1 to 256.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SCANDLY</name>
              <description>Key Array Scan Delay\nThis value is used to insert delay cycle between each key array scan. \nThe key array scan delay counter is clocked by the divided crystal clock, XCLOCK. \nNote: If the key array scan delay is set to 0, there is no delay between each key array scan.\nThere is no delay 1 cycle situation.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No delay</description>
                    <value>0</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>AWF_NS</name>
      <description>AWF Register Map</description>
      <groupName>AWF</groupName>
      <baseAddress>0x50449000</baseAddress>
      <!-- d -> no access permission -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x14</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x1C</offset>
        <size>0x28</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
       <register>
          <name>AWF_CTL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>AWF_CTL</displayName>
          <description>AWF Control Register</description>
          <addressOffset>0x0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HTIEN</name>
              <description>AWF High Threshold Interrupt Enable Bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>AWF high threshold interrupt Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>AWF high threshold interrupt Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>HTWKEN</name>
              <description>AWF High Threshold Wake Up Enable Bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>AWF high threshold wake up Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>AWF high threshold wake up Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>LTIEN</name>
              <description>AWF Low Threshold Interrupt Enable Bit</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>AWF low threshold interrupt Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>AWF low threshold interrupt Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>LTWKEN</name>
              <description>AWF Low Threshold Wake Up Enable Bit</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>AWF low threshold wake up Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>AWF low threshold wake up Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>ACUCNT</name>
              <description>Accumulation Count\nThe counter defines the acculated data to compare with high threshold and low threshold.The allowed maximum value is 8. If the write value is larger than 8, ACUCNT will become 0.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPPDMA_EN</name>
              <description>LPPDMA Enable Bit\nThis bit is used to enable LPPDMA to access AWF when chip is in NPD0/1/3.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>LPPDMA can't access AWF when chip is in NPD0/1/3</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>LPPDMA can access AWF when chip is in NPD0/1/3</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>AWF_HTH</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>AWF_HTH</displayName>
          <description>AWF High Threshold Value Register</description>
          <addressOffset>0x4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AWFHTH</name>
              <description>AWF High Threshold Value Register\nIf the accumulated value exceeds the high threshold value, comparing function will activate once set interrupt enable respectively.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>19</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>AWF_LTH</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>AWF_LTH</displayName>
          <description>AWF Low Threshold Value Register</description>
          <addressOffset>0x8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AWFLTH</name>
              <description>AWF Low Threshold Value Register\nIf the accumulated value is less than the low threshold value, comparing function will activate once set interrupt enable respectively.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>19</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>AWF_STATUS</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>AWF_STATUS</displayName>
          <description>AWF Status Register</description>
          <addressOffset>0xC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HTHIS</name>
              <description>AWF HTH Interupt Flag\nNote: This bit is set to 1 when ACUCNT is not zero and accumulation data is over than HTH. User writes 1 to clear this bit to 0. This bit will keep 1 if accumulation data is over than HTH after user writes 1 to clear.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>AWF HTH interrupt event has not occurred</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>AWF HTH interrupt event occurs</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>LTHIS</name>
              <description>AWF LTH Interupt Flag\nNote: This bit is set to 1 when ACUCNT is not zero and accumulation data is less than LTH. User writes 1 to clear this bit to 0. This bit wil keep 1 if accumulation data is less than LTH after user writes 1 to clear.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>AWF LTH interrupt event has not occurred</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>AWF LTH interrupt event occurs</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>AWF_WBINIT</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>AWF_WBINIT</displayName>
          <description>AWF Word Buffer Initial Value Register</description>
          <addressOffset>0x10</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WBINIT</name>
              <description>AWF Word Buffer Initial Value\nWriting this register will update WBINIT into all word registers (AWF_W0 ~ AWF_W7).\nWBINIT will also be updated into all word registers (AWF_W0 ~ AWF_W7) once ACUCNT is updated.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>AWF_DAT</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>AWF_DAT</displayName>
          <description>AWF Data Holding Register</description>
          <addressOffset>0x1C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AWFDAT</name>
              <description>AWF Data Holding Register\nThese bits are written by user software and will be filled in circularly from word0 to word[ACUCNT-1].</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>AWF_W0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>AWF_W0</displayName>
          <description>AWF Word Register 0</description>
          <addressOffset>0x20</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WORD</name>
              <description>AWF Word Register\nWord will accumulate from Word0 to Word[ACUCNT-1], and will compare with AWF_HTH and AWF_LTH.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="AWF_W0">
          <name>AWF_W1</name>
          <displayName>AWF_W1</displayName>
          <description>AWF Word Register 1</description>
          <addressOffset>0x24</addressOffset>
       </register>
       <register derivedFrom="AWF_W0">
          <name>AWF_W2</name>
          <displayName>AWF_W2</displayName>
          <description>AWF Word Register 2</description>
          <addressOffset>0x28</addressOffset>
       </register>
       <register derivedFrom="AWF_W0">
          <name>AWF_W3</name>
          <displayName>AWF_W3</displayName>
          <description>AWF Word Register 3</description>
          <addressOffset>0x2C</addressOffset>
       </register>
       <register derivedFrom="AWF_W0">
          <name>AWF_W4</name>
          <displayName>AWF_W4</displayName>
          <description>AWF Word Register 4</description>
          <addressOffset>0x30</addressOffset>
       </register>
       <register derivedFrom="AWF_W0">
          <name>AWF_W5</name>
          <displayName>AWF_W5</displayName>
          <description>AWF Word Register 5</description>
          <addressOffset>0x34</addressOffset>
       </register>
       <register derivedFrom="AWF_W0">
          <name>AWF_W6</name>
          <displayName>AWF_W6</displayName>
          <description>AWF Word Register 6</description>
          <addressOffset>0x38</addressOffset>
       </register>
       <register derivedFrom="AWF_W0">
          <name>AWF_W7</name>
          <displayName>AWF_W7</displayName>
          <description>AWF Word Register 7</description>
          <addressOffset>0x3C</addressOffset>
       </register>
       <register>
          <name>AWF_ACUVAL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>AWF_ACUVAL</displayName>
          <description>AWF Accumulated Value Register</description>
          <addressOffset>0x40</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ACUVAL</name>
              <description>AWF Accumulated Value Register\nAccumulated value will be accumulated from word0 to word[ACUCNT-1].</description>
              <bitOffset>0</bitOffset>
              <bitWidth>19</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
