wosayttn/sdk-bsp-numaker-m55m1/Debug/svd/M55M1.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>DMIC_NS</name>
      <description>DMIC Register Map</description>
      <groupName>DMIC</groupName>
      <baseAddress>0x50445000</baseAddress>
      <!-- d -> no access permission -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1C</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
       <register>
          <name>DMIC_CTL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>DMIC_CTL</displayName>
          <description>DMIC Control Register</description>
          <addressOffset>0x0</addressOffset>
          <access>read-write</access>
          <resetValue>0xF0000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
          </fields>
       </register>
       <register>
          <name>DMIC_DIV</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>DMIC_DIV</displayName>
          <description>DMIC Clock Divider Register</description>
          <addressOffset>0x4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000800</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
          </fields>
       </register>
       <register>
          <name>DMIC_STATUS</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>DMIC_STATUS</displayName>
          <description>DMIC Status Register</description>
          <addressOffset>0x8</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000002</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
          </fields>
       </register>
       <register>
          <name>DMIC_LPPDMACTL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>DMIC_LPPDMACTL</displayName>
          <description>DMIC LPPDMA Control Register</description>
          <addressOffset>0xC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
          </fields>
       </register>
       <register>
          <name>DMIC_FIFO</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>DMIC_FIFO</displayName>
          <description>DMIC FIFO Data Output Register</description>
          <addressOffset>0x10</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
          </fields>
       </register>
       <register>
          <name>DMIC_GAINCTL0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>DMIC_GAINCTL0</displayName>
          <description>DMIC Channel 0 and 1 Volume Control Register</description>
          <addressOffset>0x14</addressOffset>
          <access>read-write</access>
          <resetValue>0xC000C000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
          </fields>
       </register>
       <register>
          <name>DMIC_GAINCTL1</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>DMIC_GAINCTL1</displayName>
          <description>DMIC Channel 2 and 3 Volume Control Register</description>
          <addressOffset>0x18</addressOffset>
          <access>read-write</access>
          <resetValue>0xC000C000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
          </fields>
       </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>VAD_NS</name>
      <description>DMIC Register Map</description>
      <groupName>DMIC</groupName>
      <baseAddress>0x50445300</baseAddress>
      <!-- d -> no access permission -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x28</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
       <register>
          <name>VAD_SINCCTL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>VAD_SINCCTL</displayName>
          <description>VAD SINC Filter Control Register</description>
          <addressOffset>0x0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00030000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
          </fields>
       </register>
       <register>
          <name>VAD_BIQCTL0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>VAD_BIQCTL0</displayName>
          <description>VAD Biquad Filter Control Register 0</description>
          <addressOffset>0x4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
          </fields>
       </register>
       <register>
          <name>VAD_BIQCTL1</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>VAD_BIQCTL1</displayName>
          <description>VAD Biquad Filter Control Register 1</description>
          <addressOffset>0x8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
          </fields>
       </register>
       <register>
          <name>VAD_BIQCTL2</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>VAD_BIQCTL2</displayName>
          <description>VAD Biquad Filter Control Register 2</description>
          <addressOffset>0xC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
          </fields>
       </register>
       <register>
          <name>VAD_CTL0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>VAD_CTL0</displayName>
          <description>VAD Control Register 0</description>
          <addressOffset>0x10</addressOffset>
          <access>read-write</access>
          <resetValue>0x000700CC</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
          </fields>
       </register>
       <register>
          <name>VAD_CTL1</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>VAD_CTL1</displayName>
          <description>VAD Control Register 1</description>
          <addressOffset>0x14</addressOffset>
          <access>read-write</access>
          <resetValue>0x00007FFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
          </fields>
       </register>
       <register>
          <name>VAD_CTL2</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>VAD_CTL2</displayName>
          <description>VAD Control Register 2</description>
          <addressOffset>0x18</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
          </fields>
       </register>
       <register>
          <name>VAD_CTL3</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>VAD_CTL3</displayName>
          <description>VAD Control Register 3</description>
          <addressOffset>0x1C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00007FFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
          </fields>
       </register>
       <register>
          <name>VAD_STATUS0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>VAD_STATUS0</displayName>
          <description>VAD Status Read-back Register 0</description>
          <addressOffset>0x20</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
          </fields>
       </register>
       <register>
          <name>VAD_STATUS1</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>VAD_STATUS1</displayName>
          <description>VAD Status Read-back Register 1</description>
          <addressOffset>0x24</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
          </fields>
       </register>
