wosayttn/sdk-bsp-numaker-m55m1/Debug/svd/M55M1.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>KDF_NS</name>
      <description>KDF Register Map</description>
      <groupName>KDF</groupName>
      <baseAddress>0x50221000</baseAddress>
      <!-- d -> no access permission -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0xC</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x40</offset>
        <size>0x20</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x80</offset>
        <size>0x20</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x100</offset>
        <size>0x20</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x200</offset>
        <size>0xC</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x280</offset>
        <size>0x10</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xF00</offset>
        <size>0xC</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
       <register>
          <name>KDF_CTL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>KDF_CTL</displayName>
          <description>KDF Control Register</description>
          <addressOffset>0x0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>START</name>
              <description>KDF Start </description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No operation</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Start the operation</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>NEXT</name>
              <description>KDF Next Start</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No effect</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Start KDF to generate the next partial key only when BUSY is 0. BUSY flag will be set</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>FINISH</name>
              <description>KDF Next Finish</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No effect</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Finish generating the next partial key</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>MODE</name>
              <description>KDF Mode Selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>HKDF (RFC 5869)</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>KBKDF (NIST SP 800-108)</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>KEYINSEL</name>
              <description>KDF Input Key Source Selection\nNote: If KEYINSEL is 01, the NVM key is from KS OTP key 15.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>KEYIN from KDF_KEYIN register</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>KEYIN from NVM (Flash)</description>
                    <value>#01</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SALTSEL</name>
              <description>KDF Salt Selection</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>SALT from KDF_SALT register</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>SALT from random value</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>LBSEL</name>
              <description>KDF Label Selection</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>LABEL from KDF_LABEL register</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>LABEL from random value</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>CTXTSEL</name>
              <description>KDF Context Selection</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>CONTEXT from KDF_CONTEXT register</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>CONTEXT from random value</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>KDF_STS</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>KDF_STS</displayName>
          <description>KDF Status Register</description>
          <addressOffset>0x4</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BUSY</name>
              <description>KDF Busy Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>KDF is idle or finished</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>KDF is busy</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>HMACBUSY</name>
              <description>HMAC Busy Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>HMAC engine is idle or finished</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>HMAC engine is busy</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>KSERR</name>
              <description>KDF Access Key Store Error Flag</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No error</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Access Key Store failed</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>NEXTERR</name>
              <description>KDF Next Generation Error Flag</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No error</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>NEXT(KS_CTL[1]) times is greater than KLEN/256</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>KDF_KLEN</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>KDF_KLEN</displayName>
          <description>KDF Output Key Length Register</description>
          <addressOffset>0x8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>KLEN</name>
              <description>Output Key Length\nThe maxinum is 0xFF00 (65280-bit).\nIf KLEN is 0 or greater than the maximum, KDF will not execute.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>KDF_KEYIN0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>KDF_KEYIN0</displayName>
          <description>KDF Input Key Word 0 Register</description>
          <addressOffset>0x40</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>KEYIN</name>
              <description>Input Key\nFor RFC 5869, input keying material is to be filled in KEYIN.\nFor NIST SP 800-108, KI is to be filled in KEYIN.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="KDF_KEYIN0">
          <name>KDF_KEYIN1</name>
          <displayName>KDF_KEYIN1</displayName>
          <description>KDF Input Key Word 1 Register</description>
          <addressOffset>0x44</addressOffset>
       </register>
       <register derivedFrom="KDF_KEYIN0">
          <name>KDF_KEYIN2</name>
          <displayName>KDF_KEYIN2</displayName>
          <description>KDF Input Key Word 2 Register</description>
          <addressOffset>0x48</addressOffset>
       </register>
       <register derivedFrom="KDF_KEYIN0">
          <name>KDF_KEYIN3</name>
          <displayName>KDF_KEYIN3</displayName>
          <description>KDF Input Key Word 3 Register</description>
          <addressOffset>0x4C</addressOffset>
       </register>
       <register derivedFrom="KDF_KEYIN0">
          <name>KDF_KEYIN4</name>
          <displayName>KDF_KEYIN4</displayName>
          <description>KDF Input Key Word 4 Register</description>
          <addressOffset>0x50</addressOffset>
       </register>
       <register derivedFrom="KDF_KEYIN0">
          <name>KDF_KEYIN5</name>
          <displayName>KDF_KEYIN5</displayName>
          <description>KDF Input Key Word 5 Register</description>
          <addressOffset>0x54</addressOffset>
       </register>
       <register derivedFrom="KDF_KEYIN0">
          <name>KDF_KEYIN6</name>
          <displayName>KDF_KEYIN6</displayName>
          <description>KDF Input Key Word 6 Register</description>
          <addressOffset>0x58</addressOffset>
       </register>
       <register derivedFrom="KDF_KEYIN0">
          <name>KDF_KEYIN7</name>
          <displayName>KDF_KEYIN7</displayName>
          <description>KDF Input Key Word 7 Register</description>
          <addressOffset>0x5C</addressOffset>
       </register>
       <register>
          <name>KDF_KEYOUT0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>KDF_KEYOUT0</displayName>
          <description>KDF Output Key Word 0 Register</description>
          <addressOffset>0x80</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>KEYOUT</name>
              <description>Output Key\nThese register bits will be cleared if CPU completes reading key.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="KDF_KEYOUT0">
          <name>KDF_KEYOUT1</name>
          <displayName>KDF_KEYOUT1</displayName>
          <description>KDF Output Key Word 1 Register</description>
          <addressOffset>0x84</addressOffset>
       </register>
       <register derivedFrom="KDF_KEYOUT0">
          <name>KDF_KEYOUT2</name>
          <displayName>KDF_KEYOUT2</displayName>
          <description>KDF Output Key Word 2 Register</description>
          <addressOffset>0x88</addressOffset>
       </register>
       <register derivedFrom="KDF_KEYOUT0">
          <name>KDF_KEYOUT3</name>
          <displayName>KDF_KEYOUT3</displayName>
          <description>KDF Output Key Word 3 Register</description>
          <addressOffset>0x8C</addressOffset>
       </register>
       <register derivedFrom="KDF_KEYOUT0">
          <name>KDF_KEYOUT4</name>
          <displayName>KDF_KEYOUT4</displayName>
          <description>KDF Output Key Word 4 Register</description>
          <addressOffset>0x90</addressOffset>
       </register>
       <register derivedFrom="KDF_KEYOUT0">
          <name>KDF_KEYOUT5</name>
          <displayName>KDF_KEYOUT5</displayName>
          <description>KDF Output Key Word 5 Register</description>
          <addressOffset>0x94</addressOffset>
       </register>
       <register derivedFrom="KDF_KEYOUT0">
          <name>KDF_KEYOUT6</name>
          <displayName>KDF_KEYOUT6</displayName>
          <description>KDF Output Key Word 6 Register</description>
          <addressOffset>0x98</addressOffset>
       </register>
       <register derivedFrom="KDF_KEYOUT0">
          <name>KDF_KEYOUT7</name>
          <displayName>KDF_KEYOUT7</displayName>
          <description>KDF Output Key Word 7 Register</description>
          <addressOffset>0x9C</addressOffset>
       </register>
       <register>
          <name>KDF_SALT0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>KDF_SALT0</displayName>
          <description>KDF Salt 0 Register</description>
          <addressOffset>0x100</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SALT</name>
              <description>Salt\nThese register bits are for RFC 5869.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="KDF_SALT0">
          <name>KDF_SALT1</name>
          <displayName>KDF_SALT1</displayName>
          <description>KDF Salt 1 Register</description>
          <addressOffset>0x104</addressOffset>
       </register>
       <register derivedFrom="KDF_SALT0">
          <name>KDF_SALT2</name>
          <displayName>KDF_SALT2</displayName>
          <description>KDF Salt 2 Register</description>
          <addressOffset>0x108</addressOffset>
       </register>
       <register derivedFrom="KDF_SALT0">
          <name>KDF_SALT3</name>
          <displayName>KDF_SALT3</displayName>
          <description>KDF Salt 3 Register</description>
          <addressOffset>0x10C</addressOffset>
       </register>
       <register derivedFrom="KDF_SALT0">
          <name>KDF_SALT4</name>
          <displayName>KDF_SALT4</displayName>
          <description>KDF Salt 4 Register</description>
          <addressOffset>0x110</addressOffset>
       </register>
       <register derivedFrom="KDF_SALT0">
          <name>KDF_SALT5</name>
          <displayName>KDF_SALT5</displayName>
          <description>KDF Salt 5 Register</description>
          <addressOffset>0x114</addressOffset>
       </register>
       <register derivedFrom="KDF_SALT0">
          <name>KDF_SALT6</name>
          <displayName>KDF_SALT6</displayName>
          <description>KDF Salt 6 Register</description>
          <addressOffset>0x118</addressOffset>
       </register>
       <register derivedFrom="KDF_SALT0">
          <name>KDF_SALT7</name>
          <displayName>KDF_SALT7</displayName>
          <description>KDF Salt 7 Register</description>
          <addressOffset>0x11C</addressOffset>
       </register>
       <register>
          <name>KDF_LABEL0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>KDF_LABEL0</displayName>
          <description>KDF Label 0 Register</description>
          <addressOffset>0x200</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LABEL</name>
              <description>Label\nFor RFC 5869, partial info is to be filled in LABEL according to Figure 6.592.\nFor NIST SP 800-108, Label is to be filled in LABEL.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="KDF_LABEL0">
          <name>KDF_LABEL1</name>
          <displayName>KDF_LABEL1</displayName>
          <description>KDF Label 1 Register</description>
          <addressOffset>0x204</addressOffset>
       </register>
       <register derivedFrom="KDF_LABEL0">
          <name>KDF_LABEL2</name>
          <displayName>KDF_LABEL2</displayName>
          <description>KDF Label 2 Register</description>
          <addressOffset>0x208</addressOffset>
       </register>
       <register>
          <name>KDF_CTXT0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>KDF_CTXT0</displayName>
          <description>KDF Context 0 Register</description>
          <addressOffset>0x280</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CTXT</name>
              <description>Context\nFor RFC 5869, partial info is to be filled in CTXT according to Figure 6.592.\nFor NIST SP 800-108, Context is to be filled in CTXT.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="KDF_CTXT0">
          <name>KDF_CTXT1</name>
          <displayName>KDF_CTXT1</displayName>
          <description>KDF Context 1 Register</description>
          <addressOffset>0x284</addressOffset>
       </register>
       <register derivedFrom="KDF_CTXT0">
          <name>KDF_CTXT2</name>
          <displayName>KDF_CTXT2</displayName>
          <description>KDF Context 2 Register</description>
          <addressOffset>0x288</addressOffset>
       </register>
       <register derivedFrom="KDF_CTXT0">
          <name>KDF_CTXT3</name>
          <displayName>KDF_CTXT3</displayName>
          <description>KDF Context 3 Register</description>
          <addressOffset>0x28C</addressOffset>
       </register>
