wosayttn/sdk-bsp-numaker-m55m1/Debug/svd/M55M1.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>LPADC0_NS</name>
      <description>LPADC Register Map</description>
      <groupName>LPADC</groupName>
      <baseAddress>0x50442000</baseAddress>
      <!-- d -> no access permission -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x60</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x70</offset>
        <size>0x2C</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xA0</offset>
        <size>0x8</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x100</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x180</offset>
        <size>0x8</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x800</offset>
        <size>0x8</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x810</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
       <register>
          <name>LPADC_ADDR0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>LPADC_ADDR0</displayName>
          <description>ADC Data Register 0</description>
          <addressOffset>0x0</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RSLT</name>
              <description>A/D Conversion Result (Read Only)\nThis field contains conversion result of ADC.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OVERRUN</name>
              <description>Overrun Flag (Read Only)\nIf converted data in RSLT bits has not been read before new conversion result is loaded to this register, OVERRUN bit is set to 1. It is cleared by hardware after ADDR register is read.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Data in RSLT bits is not overwritten</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Data in RSLT bits is overwritten</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>VALID</name>
              <description>Valid Flag (Read Only)\nThis bit will be set to 1 when the conversion of the corresponding channel is completed. This bit will be cleared to 0 by hardware after ADDR register is read.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Data in RSLT bits is not valid</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Data in RSLT bits is valid</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="LPADC_ADDR0">
          <name>LPADC_ADDR1</name>
          <displayName>LPADC_ADDR1</displayName>
          <description>ADC Data Register 1</description>
          <addressOffset>0x4</addressOffset>
       </register>
       <register derivedFrom="LPADC_ADDR0">
          <name>LPADC_ADDR2</name>
          <displayName>LPADC_ADDR2</displayName>
          <description>ADC Data Register 2</description>
          <addressOffset>0x8</addressOffset>
       </register>
       <register derivedFrom="LPADC_ADDR0">
          <name>LPADC_ADDR3</name>
          <displayName>LPADC_ADDR3</displayName>
          <description>ADC Data Register 3</description>
          <addressOffset>0xC</addressOffset>
       </register>
       <register derivedFrom="LPADC_ADDR0">
          <name>LPADC_ADDR4</name>
          <displayName>LPADC_ADDR4</displayName>
          <description>ADC Data Register 4</description>
          <addressOffset>0x10</addressOffset>
       </register>
       <register derivedFrom="LPADC_ADDR0">
          <name>LPADC_ADDR5</name>
          <displayName>LPADC_ADDR5</displayName>
          <description>ADC Data Register 5</description>
          <addressOffset>0x14</addressOffset>
       </register>
       <register derivedFrom="LPADC_ADDR0">
          <name>LPADC_ADDR6</name>
          <displayName>LPADC_ADDR6</displayName>
          <description>ADC Data Register 6</description>
          <addressOffset>0x18</addressOffset>
       </register>
       <register derivedFrom="LPADC_ADDR0">
          <name>LPADC_ADDR7</name>
          <displayName>LPADC_ADDR7</displayName>
          <description>ADC Data Register 7</description>
          <addressOffset>0x1C</addressOffset>
       </register>
       <register derivedFrom="LPADC_ADDR0">
          <name>LPADC_ADDR8</name>
          <displayName>LPADC_ADDR8</displayName>
          <description>ADC Data Register 8</description>
          <addressOffset>0x20</addressOffset>
       </register>
       <register derivedFrom="LPADC_ADDR0">
          <name>LPADC_ADDR9</name>
          <displayName>LPADC_ADDR9</displayName>
          <description>ADC Data Register 9</description>
          <addressOffset>0x24</addressOffset>
       </register>
       <register derivedFrom="LPADC_ADDR0">
          <name>LPADC_ADDR10</name>
          <displayName>LPADC_ADDR10</displayName>
          <description>ADC Data Register 10</description>
          <addressOffset>0x28</addressOffset>
       </register>
       <register derivedFrom="LPADC_ADDR0">
          <name>LPADC_ADDR11</name>
          <displayName>LPADC_ADDR11</displayName>
          <description>ADC Data Register 11</description>
          <addressOffset>0x2C</addressOffset>
       </register>
       <register derivedFrom="LPADC_ADDR0">
          <name>LPADC_ADDR12</name>
          <displayName>LPADC_ADDR12</displayName>
          <description>ADC Data Register 12</description>
          <addressOffset>0x30</addressOffset>
       </register>
       <register derivedFrom="LPADC_ADDR0">
          <name>LPADC_ADDR13</name>
          <displayName>LPADC_ADDR13</displayName>
          <description>ADC Data Register 13</description>
          <addressOffset>0x34</addressOffset>
       </register>
       <register derivedFrom="LPADC_ADDR0">
          <name>LPADC_ADDR14</name>
          <displayName>LPADC_ADDR14</displayName>
          <description>ADC Data Register 14</description>
          <addressOffset>0x38</addressOffset>
       </register>
       <register derivedFrom="LPADC_ADDR0">
          <name>LPADC_ADDR15</name>
          <displayName>LPADC_ADDR15</displayName>
          <description>ADC Data Register 15</description>
          <addressOffset>0x3C</addressOffset>
       </register>
       <register derivedFrom="LPADC_ADDR0">
          <name>LPADC_ADDR16</name>
          <displayName>LPADC_ADDR16</displayName>
          <description>ADC Data Register 16</description>
          <addressOffset>0x40</addressOffset>
       </register>
       <register derivedFrom="LPADC_ADDR0">
          <name>LPADC_ADDR17</name>
          <displayName>LPADC_ADDR17</displayName>
          <description>ADC Data Register 17</description>
          <addressOffset>0x44</addressOffset>
       </register>
       <register derivedFrom="LPADC_ADDR0">
          <name>LPADC_ADDR18</name>
          <displayName>LPADC_ADDR18</displayName>
          <description>ADC Data Register 18</description>
          <addressOffset>0x48</addressOffset>
       </register>
       <register derivedFrom="LPADC_ADDR0">
          <name>LPADC_ADDR19</name>
          <displayName>LPADC_ADDR19</displayName>
          <description>ADC Data Register 19</description>
          <addressOffset>0x4C</addressOffset>
       </register>
       <register derivedFrom="LPADC_ADDR0">
          <name>LPADC_ADDR20</name>
          <displayName>LPADC_ADDR20</displayName>
          <description>ADC Data Register 20</description>
          <addressOffset>0x50</addressOffset>
       </register>
       <register derivedFrom="LPADC_ADDR0">
          <name>LPADC_ADDR21</name>
          <displayName>LPADC_ADDR21</displayName>
          <description>ADC Data Register 21</description>
          <addressOffset>0x54</addressOffset>
       </register>
       <register derivedFrom="LPADC_ADDR0">
          <name>LPADC_ADDR22</name>
          <displayName>LPADC_ADDR22</displayName>
          <description>ADC Data Register 22</description>
          <addressOffset>0x58</addressOffset>
       </register>
       <register derivedFrom="LPADC_ADDR0">
          <name>LPADC_ADDR23</name>
          <displayName>LPADC_ADDR23</displayName>
          <description>ADC Data Register 23</description>
          <addressOffset>0x5C</addressOffset>
       </register>
       <register derivedFrom="LPADC_ADDR0">
          <name>LPADC_ADDR28</name>
          <displayName>LPADC_ADDR28</displayName>
          <description>ADC Data Register 28</description>
          <addressOffset>0x70</addressOffset>
       </register>
       <register derivedFrom="LPADC_ADDR0">
          <name>LPADC_ADDR29</name>
          <displayName>LPADC_ADDR29</displayName>
          <description>ADC Data Register 29</description>
          <addressOffset>0x74</addressOffset>
       </register>
       <register derivedFrom="LPADC_ADDR0">
          <name>LPADC_ADDR30</name>
          <displayName>LPADC_ADDR30</displayName>
          <description>ADC Data Register 30</description>
          <addressOffset>0x78</addressOffset>
       </register>
       <register derivedFrom="LPADC_ADDR0">
          <name>LPADC_ADDR31</name>
          <displayName>LPADC_ADDR31</displayName>
          <description>ADC Data Register 31</description>
          <addressOffset>0x7C</addressOffset>
       </register>
