wosayttn/sdk-bsp-numaker-m55m1/Debug/svd/M55M1.svd
       <register>
          <name>LPADC_CFDCTL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>LPADC_CFDCTL</displayName>
          <description>ADC Channel Floating Detect Control Register</description>
          <addressOffset>0xA4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PRECHEN</name>
              <description>Precharge Enable Bit\nNote: Analog input voltage is 1/2 VREF when PRECHEN and DISCHEN are all enable.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Channel precharge Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Channel precharge Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>DISCHEN</name>
              <description>Discharge Enable Bit\nNote: Analog input voltage is 1/2 VREF when PRECHEN and DISCHEN are all enable.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Channel discharge Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Channel discharge Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>FDETCHEN</name>
              <description>Floating Detect Channel Enable Bit</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Floating Detect Channel Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Floating Detect Channel Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>LPADC_ADPDMA</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>LPADC_ADPDMA</displayName>
          <description>ADC LPPDMA Current Transfer Data Register</description>
          <addressOffset>0x100</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CURDAT</name>
              <description>ADC LPPDMA Current Transfer Data Register (Read Only)\nWhen LPPDMA transferring, read this register can monitor current LPPDMA transfer data.\nCurrent LPPDMA transfer data could be the content of ADDR0 ~ ADDR23, ADDR28, ADDR29, ADDR30 and ADDR31 registers.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>LPADC_ADCAL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>LPADC_ADCAL</displayName>
          <description>ADC Calibration Mode Register</description>
          <addressOffset>0x180</addressOffset>
          <access>read-write</access>
          <resetValue>0x0000005C</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CALEN</name>
              <description>Calibration Function Enable Bit\nNote: If chip is powered off, calibration function should be executed again.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Calibration function Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>CALIE</name>
              <description>Calibration Interrupt Enable Bit\nIf calibration function is enabled and the calibration is finished, CALIF bit will be asserted, in the meanwhile, if CALIE bit is set to 1, a calibration interrupt request is generated.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Calibration function Interrupt Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Calibration function Interrupt Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>LPADC_ADCALSTS</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>LPADC_ADCALSTS</displayName>
          <description>ADC Calibration Status Register</description>
          <addressOffset>0x184</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CALIF</name>
              <description>Calibration Finish Interrupt Flag\nIf calibration is finished, this flag will be set to 1. It is cleared by writing 1 to it.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>LPADC_AUTOCTL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>LPADC_AUTOCTL</displayName>
          <description>ADC Auto Operation Control Register</description>
          <addressOffset>0x800</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TRIGSEL</name>
              <description>Automatic Operation Trigger Source Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Auto-operation Trigger Source from LPTMR0</description>
                    <value>#0000</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Auto-operation Trigger Source from LPTMR1</description>
                    <value>#0001</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>Auto-operation Trigger Source from TTMR0</description>
                    <value>#0010</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Auto-operation Trigger Source from TTMR1</description>
                    <value>#0011</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>4</name>
                    <description>Auto-operation Trigger Source from WKIOA0</description>
                    <value>#0100</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>5</name>
                    <description>Auto-operation Trigger Source from WKIOB0</description>
                    <value>#0101</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>6</name>
                    <description>Auto-operation Trigger Source from WKIOC0</description>
                    <value>#0110</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>7</name>
                    <description>Auto-operation Trigger Source from WKIOD0</description>
                    <value>#0111</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>8</name>
                    <description>Auto-operation Trigger Source from ACMP0</description>
                    <value>#1000</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>9</name>
                    <description>Auto-operation Trigger Source from ACMP1</description>
                    <value>#1001</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>10</name>
                    <description>Auto-operation Trigger Source from ACMP2</description>
                    <value>#1010</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>11</name>
                    <description>Auto-operation Trigger Source from ACMP3</description>
                    <value>#1011</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIGEN</name>
              <description>Automatic Operation Trigger Enable Bit\nWhen automatic operation mode is enabled, the LPADC will start working if LPADC is triggered by a event sent from the trigger source selected by TRIGSEL[3:0] after this bit is set to 1.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>LPADC Automatic Operation Trigger disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>LPADC Automatic Operation Trigger enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>ADWKEN</name>
              <description>Automatic Operation Mode Conversion End Wake-up Enable Bit</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>LPADC automatic operation conversion end wake-up Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>LPADC automatic operation conversion end wake-up Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>CMP0WKEN</name>
              <description>Automatic Operation Mode Comparator 0 Wake-up Enable Bit</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>LPADC automatic operation comparator 0 wake-up Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>LPADC automatic operation comparator 0 wake-up Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>CMP1WKEN</name>
              <description>Automatic Operation Mode Comparator 1 Wake-up Enable Bit</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>LPADC automatic operation comparator 1 wake-up Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>LPADC automatic operation comparator 1 wake-up Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>AUTOEN</name>
              <description>Automatic Operation Mode Enable Bit</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>LPADC automatic operation Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>LPADC automatic operation Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>LPADC_AUTOSTRG</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>LPADC_AUTOSTRG</displayName>
          <description>ADC Auto Operation Software Trigger Register</description>
          <addressOffset>0x804</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWTRIG</name>
              <description>Automatic Operation Software Trigger Bit\nWrite 1 to this bit will trigger LPADC start automatic operation\nNote: This bit will be auto cleared by hardware</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>LPADC_AUTOSTS</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>LPADC_AUTOSTS</displayName>
          <description>ADC Auto Operation Status Register</description>
          <addressOffset>0x810</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADWKF</name>
              <description>Automatic Operation Conversion End Wake-up Flag Bit\nWhen automatic operation mode is enabled, and the conversion is finished, this flag will be set. If WKEN also set to 1, the chip will be wake-up.\nSoftware can write one to clear this bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMP0WKF</name>
              <description>Automatic Operation Compare 0 Wake-up Flag Bit\nWhen automatic operation mode is enabled, and the conversion result monitor comparator 0 is match setting criteria, this flag will be set. If CMP0WKEN also set to 1, the chip will be wake-up.\nSoftware can write one to clear this bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMP1WKF</name>
              <description>Automatic Operation Compare 1 Wake-up Flag Bit\nWhen automatic operation mode is enabled, and the conversion result monitor comparator 1 is match setting criteria, this flag will be set. If CMP1WKEN also set to 1, the chip will be wake-up.\nSoftware can write one to clear this bit</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
      </registers>
    </peripheral>
  </peripherals>
</device>
